[
{"Title": "Die Hard", "Year": "1988", "Genre": "Action, Thriller", "Rating": "8.2", "Plot": "NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of bank robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands."},
{"Title": "The Making of 'Terminator 2: Judgment Day'", "Year": "1991", "Genre": "Documentary, Short", "Rating": "7.1", "Plot": "This documentary treats movie fans to a behind-the-scenes look at the making of Terminator 2: Judgement Day, the blockbuster science-fiction film about the further attempts of the SkyNet computer system to assassinate John Conner before he can become a danger, as well as the resistance's efforts to protect him. Included are interviews with Arnold Schwazenegger, Linda Hamilton and the rest of the cast and crew who share their experiences from making the film, as well as disscuss the efforts that went into it."},
{"Title": "The Terminator", "Year": "1984", "Genre": "Action, Sci-Fi", "Rating": "8.0", "Plot": "A cyborg is sent from the future on a deadly mission. He has to kill Sarah Connor, a young woman whose life will have a great significance in years to come. Sarah has only one protector - Kyle Reese - also sent from the future. The Terminator uses his exceptional intelligence and strength to find Sarah, but is there any way to stop the seemingly indestructible cyborg ?"},
{"Title": "The Dark Knight", "Year": "2008", "Genre": "Action, Crime, Drama", "Rating": "9.0", "Plot": "Set within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against the Joker becomes deeply personal, forcing him to &quot;confront everything he believes&quot; and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent and Rachel Dawes."},
{"Title": "The Matrix", "Year": "1999", "Genre": "Action, Sci-Fi", "Rating": "8.7", "Plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion."},
{"Title": "Aliens", "Year": "1986", "Genre": "Action, Adventure, Sci-Fi", "Rating": "8.4", "Plot": "Fifty seven years after Ellen Ripley survived her disastrous ordeal, her escape vessel is recovered after drifting across the galaxy as she slept in cryogenic stasis. Back on Earth, nobody believed her story about the &quot;Aliens&quot; on the moon LV-426. After the &quot;Company&quot; orders the colony on LV-426 to investigate, however, all communication with the colony is lost. The Company enlists Ripley to aid a team of tough, rugged space marines on a rescue mission to the now partially terraformed moon to find out if there are aliens or survivors. As the mission unfolds, Ripley will be forced to come to grips with her worst nightmare, but even as she does, she finds that the worst is yet to come."},
{"Title": "Lethal Weapon", "Year": "1987", "Genre": "Action, Crime, Thriller", "Rating": "7.6", "Plot": "Martin Riggs is an L.A. cop with suicidal tendencies and Roger Murtaugh is the unlucky police officer with whom Riggs is assigned. Together they uncover a huge drug-smuggling operation, and as their success rate grows so does their friendship."},
{"Title": "Predator", "Year": "1987", "Genre": "Action, Sci-Fi, Thriller", "Rating": "7.8", "Plot": "A team of special force ops, led by a tough but fair soldier, Major &quot;Dutch&quot; Schaefer, are ordered to assist CIA man, Colonel Al Dillon, on a rescue mission for potential survivors of a Helicopter downed over remote South American jungle. Not long after they land, Dutch and his team discover that they have been sent in under false pretenses. This deception turns out to be the least of their worries though, when they find themselves being methodically hunted by something not of this world."},
{"Title": "Saving Private Ryan", "Year": "1998", "Genre": "Drama, War", "Rating": "8.6", "Plot": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother..."},
{"Title": "The Bourne Identity", "Year": "2002", "Genre": "Action, Mystery, Thriller", "Rating": "7.9", "Plot": "Based very loosely on Robert Ludlum's novel, the Bourne Identity is the story of a man whose wounded body is discovered by fishermen who nurse him back to health. He can remember nothing and begins to try to rebuild his memory based on clues such as a Swiss bank account, the number of which is implanted in his hip. He soon realizes that he is being hunted and takes off with Marie on a search to find out who he is - and why he is being hunted."},
{"Title": "Jurassic Park", "Year": "1993", "Genre": "Adventure, Sci-Fi, Thriller", "Rating": "8.1", "Plot": "Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island."},
{"Title": "Star Wars: Episode IV - A New Hope", "Year": "1977", "Genre": "Action, Adventure, Fantasy", "Rating": "8.6", "Plot": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy."},
{"Title": "First Blood", "Year": "1982", "Genre": "Action, Adventure, Drama", "Rating": "7.7", "Plot": "John J. Rambo is a former United States Special Forces soldier who fought in Vietnam and won the Congressional Medal of Honor, but his time in Vietnam still haunts him. As he came to Hope, Washington to visit a friend, he was guided out of town by the Sheriff William Teasel who insults Rambo, but what Teasel does not know that his insult angered Rambo to the point where Rambo became violent and was arrested. As he was at the county jail being cleaned, he escapes and goes on a rampage through the forest to try to escape from the sheriffs who want to kill him. Then, as Rambo's commanding officer, Colonel Samuel Trautman tries to save both the Sheriff's department and Rambo before the situation gets out of hand."},
{"Title": "Indiana Jones and the Last Crusade", "Year": "1989", "Genre": "Action, Adventure, Fantasy", "Rating": "8.3", "Plot": "An art collector appeals to Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure in heart."},
{"Title": "Star Wars: Episode V - The Empire Strikes Back", "Year": "1980", "Genre": "Action, Adventure, Fantasy", "Rating": "8.8", "Plot": "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader."},
{"Title": "Gladiator", "Year": "2000", "Genre": "Action, Adventure, Drama", "Rating": "8.5", "Plot": "Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. The only desire that fuels him now is the chance to rise to the top so that he will be able to look into the eyes of the man who will feel his revenge."},
{"Title": "The Avengers", "Year": "2012", "Genre": "Action, Adventure, Sci-Fi", "Rating": "8.1", "Plot": "Nick Fury is the director of S.H.I.E.L.D., an international peace-keeping agency. The agency is a who's who of Marvel Super Heroes, with Iron Man, The Incredible Hulk, Thor, Captain America, Hawkeye and Black Widow. When global security is threatened by Loki and his cohorts, Nick Fury and his team will need all their powers to save the world from disaster."},
{"Title": "Braveheart", "Year": "1995", "Genre": "Biography, Drama, History", "Rating": "8.4", "Plot": "William Wallace is a Scottish rebel who leads an uprising against the cruel English ruler Edward the Longshanks, who wishes to inherit the crown of Scotland for himself. When he was a young boy, William Wallace's father and brother, along with many others, lost their lives trying to free Scotland. Once he loses another of his loved ones, William Wallace begins his long quest to make Scotland free once and for all, along with the assistance of Robert the Bruce."},
{"Title": "Taken", "Year": "2008", "Genre": "Action, Crime, Thriller", "Rating": "7.8", "Plot": "Seventeen year-old Kim is the pride and joy of her father Bryan Mills. Bryan is a retired agent who left the Central Intelligence Agency to be near Kim in California. Kim lives with her mother Lenore and her wealthy stepfather Stuart. Kim manages to convince her reluctant father to allow her to travel to Paris with her friend Amanda. When the girls arrive in Paris they share a cab with a stranger named Peter, and Amanda lets it slip that they are alone in Paris. Using this information an Albanian gang of human traffickers kidnaps the girls. Kim barely has time to call her father and give him information. Her father gets to speak briefly to one of the kidnappers and he promises to kill the kidnappers if they do not let his daughter go free. The kidnapper wishes him &quot;good luck,&quot; so Bryan Mills travels to Paris to search for his daughter and her friend."},
{"Title": "300", "Year": "2006", "Genre": "Action, Fantasy", "Rating": "7.7", "Plot": "In the Battle of Thermopylae of 480 BC an alliance of Greek city-states fought the invading Persian army in the mountain pass of Thermopylae. Vastly outnumbered, the Greeks held back the enemy in one of the most famous last stands of history. Persian King Xerxes led a Army of well over 100,000 (Persian king Xerxes before war has about 170,000 army) men to Greece and was confronted by 300 Spartans, 700 Thespians, and 400 Thebans. Xerxes waited for 10 days for King Leonidas to surrender or withdraw but left with no options he pushed forward. After 3 days of battle all the Greeks were killed. The Spartan defeat was not the one expected, as a local shepherd, named Ephialtes, defected to the Persians and informed Xerxes that the separate path through Thermopylae, which the Persians could use to outflank the Greeks, was not as heavily guarded as they thought."},
{"Title": "Die Hard with a Vengeance", "Year": "1995", "Genre": "Action, Adventure, Thriller", "Rating": "7.6", "Plot": "John McClane is now almost a full-blown alcoholic and is suspended from the NYPD. But when a bomb goes off in the Bonwit Teller Department Store the police go insane trying to figure out what's going on. Soon, a man named Simon calls and asks for McClane. Simon tells Inspector Walter Cobb that McClane is going to play a game called &quot;Simon Says&quot;. He says that McClane is going to do the tasks he assigns him. If not, he'll set off another bomb. With the help of a Harlem electrician, John McClane must race all over New York trying to figure out the frustrating puzzles that the crafty terrorist gives him. But when a bomb goes off in a subway station right by the Federal Reserve (the biggest gold storage in the world) things start to get heated."},
{"Title": "Iron Man", "Year": "2008", "Genre": "Action, Adventure, Sci-Fi", "Rating": "7.9", "Plot": "Tony Stark. Genius, billionaire, playboy, philanthropist. Son of legendary inventor and weapons contractor Howard Stark. When Tony Stark is assigned to give a weapons presentation to an Iraqi unit led by Lt. Col. James Rhodes, he's given a ride on enemy lines. That ride ends badly when Stark's Humvee that he's riding in is attacked by enemy combatants. He survives - barely - with a chest full of shrapnel and a car battery attached to his heart. In order to survive he comes up with a way to miniaturize the battery and figures out that the battery can power something else. Thus Iron Man is born. He uses the primitive device to escape from the cave in Iraq. Once back home, he then begins work on perfecting the Iron Man suit. But the man who was put in charge of Stark Industries has plans of his own to take over Tony's technology for other matters."},
{"Title": "Independence Day", "Year": "1996", "Genre": "Action, Adventure, Sci-Fi", "Rating": "7.0", "Plot": "On July 2nd, communications systems worldwide are sent into chaos by a strange atmospheric interference. It is soon learned by the military that a number of enormous objects are on a collision course with Earth. At first thought to be meteors, they are later revealed to be gigantic spacecraft, piloted by a mysterious alien species. After attempts to communicate with the aliens go nowhere, David Levinson, an ex-scientist turned cable technician, discovers that the aliens are going to attack major points around the globe in less than a day. On July 3rd, the aliens all but obliterate New York, Los Angeles and Washington, as well as Paris, London, Houston and Moscow. The survivors set out in convoys towards Area 51, a strange government testing ground where it is rumored the military has a captured alien spacecraft of their own. The survivors devise a plan to fight back against the enslaving aliens, and July 4th becomes the day humanity will fight for its freedom. July 4th is their Independence Day..."},
{"Title": "Dirty Harry", "Year": "1971", "Genre": "Action, Crime, Drama", "Rating": "7.8", "Plot": "In the year 1971, San Francisco faces the terror of a maniac known as Scorpio- who snipes at innocent victims and demands ransom through notes left at the scene of the crime. Inspector Harry Callahan (known as Dirty Harry by his peers through his reputation handling of homicidal cases) is assigned to the case along with his newest partner Inspector Chico Gonzalez to track down Scorpio and stop him. Using humiliation and cat and mouse type of games against Callahan, Scorpio is put to the test with the cop with a dirty attitude."},
{"Title": "Batman", "Year": "1989", "Genre": "Action, Adventure", "Rating": "7.6", "Plot": "Gotham City. Crime boss Carl Grissom (Jack Palance) effectively runs the town but there's a new crime fighter in town - Batman (Michael Keaton). Grissom's right-hand man is Jack Napier (Jack Nicholson), a brutal man who is not entirely sane... After falling out between the two Grissom has Napier set up with the Police and Napier falls to his apparent death in a vat of chemicals. However, he soon reappears as The Joker and starts a reign of terror in Gotham City. Meanwhile, reporter Vicki Vale (Kim Basinger) is in the city to do an article on Batman. She soon starts a relationship with Batman's everyday persona, billionaire Bruce Wayne."},
{"Title": "Total Recall", "Year": "1990", "Genre": "Action, Sci-Fi, Thriller", "Rating": "7.5", "Plot": "Douglas Quaid is haunted by a recurring dream about a journey to Mars. He hopes to find out more about this dream and buys a holiday at Rekall Inc. where they sell implanted memories. But something goes wrong with the memory implantation and he remembers being a secret agent fighting against the evil Mars administrator Cohaagen. Now the story really begins and it's a rollercoaster ride until the massive end of the movie."},
{"Title": "RoboCop", "Year": "1987", "Genre": "Action, Crime, Sci-Fi", "Rating": "7.5", "Plot": "Detroit - in the future - is crime-ridden and run by a massive company. The company has developed a huge crime-fighting robot, which unfortunately develops a rather dangerous glitch. The company sees a way to get back in favor with the public when policeman Alex Murphy is killed by a street gang. Murphy's body is reconstructed within a steel shell and called RoboCop. RoboCop is very successful against criminals and becomes a target of supervillian Boddicker."},
{"Title": "Lethal Weapon 2", "Year": "1989", "Genre": "Action, Crime, Thriller", "Rating": "7.2", "Plot": "Riggs and Murtaugh are trying to take down some drug dealers but the they turn out to be not run of the mill drug dealers; they have automatic weapons and helicopters. Eventually they grab one of their vehicles and find a million dollars worth of gold coins or Krugerrands in the trunk. Later Murtaugh is threatened by the men they're pursuing. That's when the Captain reassigns them to protect a man named Leo Getz who is suppose to testify in a big case. When they get to where Leo is, someone tries to kill him and that's when they learn he laundered half a billion dollars worth of drug money. He then takes them to a place he once went to and that's when the people there start shooting at them. Later when they come back with back up they learn that the men work for the South African consulate and have diplomatic immunity. They deduce that they are the ones they were looking for, but because of they have diplomatic immunity they can't do anything."},
{"Title": "True Lies", "Year": "1994", "Genre": "Action, Comedy, Thriller", "Rating": "7.2", "Plot": "Harry Tasker (Arnold Schwarzenegger) leads a double life. At work he is a government agent with a license to do just about anything, while at home he pretends to be a dull computer salesman. He is on the trail of stolen nuclear weapons that are in the hands of fanatic terrorists when something more important comes up. Harry finds his wife is seeing another man (Bill Paxton) because she needs some adventure in her life. Harry decides to give it to her, juggling pursuit of terrorists on one hand and an adventure for his wife on the other while showing he can Tango all at once."},
{"Title": "Batman Begins", "Year": "2005", "Genre": "Action, Adventure", "Rating": "8.3", "Plot": "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long."},
{"Title": "Speed", "Year": "1994", "Genre": "Action, Adventure, Crime", "Rating": "7.2", "Plot": "Bomber terrorist's elevator plan backfires, so he rigs a bomb to a LA city bus. The stipulation is: once armed, the bus must stay above 50 mph to keep from exploding. Also if LAPD Officer tries to unload any passengers off, Payne will detonate it. Joe Morton co-stars as Jack's superior, and Jeff Daniels supports Jack helping him try to defuse the bomb."},
{"Title": "Heat", "Year": "1995", "Genre": "Crime, Drama, Thriller", "Rating": "8.2", "Plot": "Hunters and their prey--Neil and his professional criminal crew hunt to score big money targets (banks, vaults, armored cars) and are, in turn, hunted by Lt. Vincent Hanna and his team of cops in the Robbery/Homicide police division. A botched job puts Hanna onto their trail while they regroup and try to put together one last big 'retirement' score. Neil and Vincent are similar in many ways, including their troubled personal lives. At a crucial moment in his life, Neil disobeys the dictum taught to him long ago by his criminal mentor--'Never have anything in your life that you can't walk out on in thirty seconds flat, if you spot the heat coming around the corner'--as he falls in love. Thus the stage is set for the suspenseful ending...."},
{"Title": "Enter the Dragon", "Year": "1973", "Genre": "Action, Crime, Drama", "Rating": "7.7", "Plot": "Enter the Dragon revolves around the three main characters. Lee, a man recruited by an agency to investigate a tournament hosted by Han, since they believe he has an Opium trade there. Roper and Williams are former army buddies since Vietnam and they enter the tournament due to different problems that they have. Roper is on the run from the Mafia due to his gambling debts, while Williams is harassed by racist police officers and defends himself from them and uses the car for his getaway. It is a deadly tournament that they will enter on an island. Lee's job is to get the other two out of there alive."},
{"Title": "The Fifth Element", "Year": "1997", "Genre": "Action, Adventure, Sci-Fi", "Rating": "7.7", "Plot": "In the twenty-third century, the universe is threatened by evil. The only hope for mankind is the Fifth Element, who comes to Earth every five thousand years to protect the humans with four stones of the four elements: fire, water, Earth and air. A Mondoshawan spacecraft is bringing The Fifth Element back to Earth but it is destroyed by the evil Mangalores. However, a team of scientists use the DNA of the remains of the Fifth Element to rebuild the perfect being called Leeloo. She escapes from the laboratory and stumbles upon the taxi driver and former elite commando Major Korben Dallas that helps her to escape from the police. Leeloo tells him that she must meet Father Vito Cornelius to accomplish her mission. Meanwhile, the Evil uses the greedy and cruel Jean-Baptiste Emanuel Zorg and a team of mercenary Mangalores to retrieve the stones and avoid the protection of Leeloo. But the skilled Korben Dallas has fallen in love with Leeloo and decides to help her to retrieve the stones."},
{"Title": "Indiana Jones and the Temple of Doom", "Year": "1984", "Genre": "Action, Adventure", "Rating": "7.6", "Plot": "Set in 1935, a professor, archaeologist, and legendary hero by the name of Indiana Jones is back in action in his newest adventure. But this time he teams up with a night club singer named Wilhelmina &quot;Willie&quot; Scott and a twelve-year-old boy named Short Round. They end up in an Indian small distressed village, where the people believe that evil spirits have taken all their children away after a sacred precious stone was stolen! They also discovered the great mysterious terror surrounding a booby-trapped temple known as the Temple of Doom! Thuggee is beginning to attempt to rise once more, believing that with the power of all five Sankara stones they can rule the world! Now, it's all up to Indiana to put an end to the Thuggee campaign, rescue the lost children, win the girl and conquer the Temple of Doom."},
{"Title": "Léon: The Professional", "Year": "1994", "Genre": "Crime, Drama, Thriller", "Rating": "8.6", "Plot": "After her father, mother, older sister and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer is forced to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother."},
{"Title": "Alien", "Year": "1979", "Genre": "Horror, Sci-Fi", "Rating": "8.5", "Plot": "A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick up an SOS warning from a distant moon. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realizes that they are not alone on the spaceship when an alien stowaway is on the cargo ship."},
{"Title": "Skyfall", "Year": "2012", "Genre": "Action, Adventure, Thriller", "Rating": "7.8", "Plot": "When Bond's latest assignment goes gravely wrong and agents around the world are exposed, MI6 is attacked forcing M to relocate the agency. These events cause her authority and position to be challenged by Gareth Mallory (Ralph Fiennes), the new Chairman of the Intelligence and Security Committee. With MI6 now compromised from both inside and out, M is left with one ally she can trust: Bond. 007 takes to the shadows - aided only by field agent, Eve (Naomie Harris) - following a trail to the mysterious Silva (Javier Bardem), whose lethal and hidden motives have yet to reveal themselves."},
{"Title": "The Bourne Supremacy", "Year": "2004", "Genre": "Action, Thriller", "Rating": "7.8", "Plot": "After escaping from the emotional and physical pain he previously encountered. Jason Bourne and his girlfriend Marie begin a new life as far away as possible. But when an assassination attempt on Bourne goes horribly wrong, Bourne must re-enter the life he wanted to leave behind, in order to find out the truth why they are still after him."},
{"Title": "Goldfinger", "Year": "1964", "Genre": "Action, Adventure, Thriller", "Rating": "7.7", "Plot": "Bond is back and his next mission takes him to Fort Knox, where Auric Goldfinger and his henchman are planning to raid Fort Knox and obliterate the world economy. To save the world once again, Bond will need to become friends with Goldfinger, dodge killer hats and avoid Goldfinger's personal pilot, the sexy Pussy Galore. She might not have feelings for Bond, but will 007 help her change her mind?"},
{"Title": "Die Hard 2", "Year": "1990", "Genre": "Action, Thriller", "Rating": "7.1", "Plot": "After the terrifying events in LA, John McClane (Willis) is about to go through it all again. A team of terrorists, led by Col. Stuart (Sadler) is holding the entire airport hostage. The terrorists are planning to rescue a drug lord from justice. In order to do so, they have seized control of all electrical equipment affecting all planes. With no runway lights available, all aircraft have to remain in the air, with fuel running low, McClane will need to be fast."},
{"Title": "Star Wars: Episode VI - Return of the Jedi", "Year": "1983", "Genre": "Action, Adventure, Fantasy", "Rating": "8.3", "Plot": "Luke Skywalker battles horrible Jabba the Hut and cruel Darth Vader to save his comrades in the Rebel Alliance and triumph over the Galactic Empire. Han Solo and Princess Leia reaffirm their love and team with Chewbacca, Lando Calrissian, the Ewoks and the androids C-3PO and R2-D2 to aid in the disruption of the Dark Side and the defeat of the evil emperor."},
{"Title": "The Fugitive", "Year": "1993", "Genre": "Action, Crime, Drama", "Rating": "7.8", "Plot": "A well respected Chicago surgeon Dr. Richard Kimble has found out that his wife, Helen, has been murdered ferociously in her own home. The police found Kimble and accused him of the murder. Then, Kimble (without Justifiable Reason) was tried, convicted, and sentenced to death. However, on the way to prison, Kimble's transport crashed. Kimble escapes and is now on the run. Deputy Samuel Gerard from Chicago takes charge of the chase of Kimble. Meanwhile, Kimble takes up his own investigation to find who really killed his wife, and to lure Gerard and his team into it as well."},
{"Title": "Scarface", "Year": "1983", "Genre": "Crime, Drama", "Rating": "8.3", "Plot": "Tony Montana manages to leave Cuba during the Mariel exodus of 1980. He finds himself in a Florida refugee camp but his friend Manny has a way out for them: undertake a contract killing and arrangements will be made to get a green card. He's soon working for drug dealer Frank Lopez and shows his mettle when a deal with Colombian drug dealers goes bad. He also brings a new level of violence to Miami. Tony is protective of his younger sister but his mother knows what he does for a living and disowns him. Tony is impatient and wants it all however, including Frank's empire and his mistress Elvira Hancock. Once at the top however, Tony's outrageous actions make him a target and everything comes crumbling down."},
{"Title": "The Incredibles", "Year": "2004", "Genre": "Animation, Action, Adventure", "Rating": "8.0", "Plot": "Bob Parr (A.K.A. Mr. Incredible), and his wife Helen (A.K.A. Elastigirl), are the world's greatest famous crime-fighting superheroes in Metroville. Always saving lives and battling evil on a daily basis. But fifteen years later, they have been forced to adopt civilian identities and retreat to the suburbs where they have no choice but to retire as superheroes to live a &quot;normal life&quot; with their three children Violet, Dash and Jack-Jack (who were secretly born with superpowers). Itching to get back into action, Bob gets his chance when a mysterious communication summons him to a remote island for a top secret assignment. He soon discovers that it will take a super family effort to rescue the world from total destruction."},
{"Title": "Beverly Hills Cop", "Year": "1984", "Genre": "Action, Comedy, Crime", "Rating": "7.3", "Plot": "Detroit cop Axel Foley is delighted when he receives a surprise visit from his best friend Mikey Tandino, who lives in California. Not long after Mikey arrives in Detroit, Mikey is killed, right in front of Axel, by a man named Zack. Axel follows Zack to Beverly Hills, California, where Beverly Hills police department Lieutenant Andrew Bogomil assigns Detective Billy Rosewood and Rosewood's partner, Sergeant John Taggart, to keep an eye on Axel. Axel visits his friend Jenny Summers, who works in an art gallery. With Jenny's help, Axel discovers that Zack works for Jenny's boss, Victor Maitland, the man who owns the art gallery. Maitland is a drug kingpin who is using the gallery as a front, and Maitland had Zack kill Mikey after Maitland accused Mikey of stealing some of Maitland's bonds. With the help of Jenny, Billy, and Taggart, Axel does what he can to make sure Maitland and Zack won't kill any more people."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."}
]