[
{"Title": "Monty Python and the Holy Grail", "Year": "1975", "Genre": "Adventure, Comedy, Fantasy", "Rating": "8.3", "Plot": "History is turned on its comic head when, in 10th century England, King Arthur travels the countryside to find knights who will join him at the Round Table in Camelot. Gathering up the men is a tale in itself but after a bit of a party at Camelot, many decide to leave only to be stopped by God who sends them on a quest: to find the Holy Grail. After a series of individual adventures, the knights are reunited but must face a wizard named Tim, killer rabbits and lessons in the use of holy hand grenades. Their quest comes to an end however when the police intervene - just what you would expect in a Monty Python movie."},
{"Title": "Airplane!", "Year": "1980", "Genre": "Comedy", "Rating": "7.8", "Plot": "Still craving for the love of his life, Ted Striker follows Elaine onto the flight that she is working on as a member of the cabin crew. Elaine doesn't want to be with Ted anymore, but when the crew and passengers fall ill from food poisoning, all eyes are on Ted."},
{"Title": "Groundhog Day", "Year": "1993", "Genre": "Comedy, Fantasy, Romance", "Rating": "8.0", "Plot": "A weather man is reluctantly sent to cover a story about a weather forecasting &quot;rat&quot; (as he calls it). This is his fourth year on the story, and he makes no effort to hide his frustration. On awaking the 'following' day he discovers that it's Groundhog Day again, and again, and again. First he uses this to his advantage, then comes the realisation that he is doomed to spend the rest of eternity in the same place, seeing the same people do the same thing EVERY day."},
{"Title": "Ghostbusters", "Year": "1984", "Genre": "Action, Comedy, Fantasy", "Rating": "7.8", "Plot": "Peter Venkman, Ray Stantz and Egon work at the University where they delve into the paranormal and fiddle with many unethical experiments on the students. As they are kicked out of the University do they really understand their knowledge of the paranormal and go into business for themselves. Under the new snazzy business name of 'Ghostbusters', and living in the old firehouse building they work out of, they are called to rid New York City of paranormal phenomenon at everyone's whim.... for a price. They make national press as the media thinks and pressures everybody the Ghostbusters are the cause of it all. Thrown in jail by the EPA, the mayor takes a chance and calls on them to help save the city. Unbeknownst to all, a long dead Gozer worshiper (Evo Shandor) erected downtown apartment building is the cause of all the paranormal activity. They find out the building could resurrect the ancient Hittite god, Gozer, and bring an end to all of humanity. Who are you gonna call to stop this terrible world-ending menace?"},
{"Title": "Caddyshack", "Year": "1980", "Genre": "Comedy, Sport", "Rating": "7.3", "Plot": "Comical goings on at an exclusive golf club. All the members are wealthy and eccentric, and all the staff are poor and slightly less eccentric. The main character is 'Danny'; he's a caddy who will do almost anything to raise money to go to college. There are many subplots, including the assistant green keeper's pursuit of a cute (obviously stuffed) gopher."},
{"Title": "Blazing Saddles", "Year": "1974", "Genre": "Comedy, Western", "Rating": "7.8", "Plot": "The Ultimate Western Spoof. A town where everyone seems to be named Johnson is in the way of the railroad. In order to grab their land, Hedley Lemar (Harvey Korman), a politically connected nasty person, sends in his henchmen to make the town unlivable. After the sheriff is killed, the town demands a new sheriff from the Governor (Mel Brooks). Hedley convinces him to send the town the first Black sheriff (Cleavon Little) in the west. Bart is a sophisticated urbanite who will have some difficulty winning over the townspeople."},
{"Title": "Unseen + Untold: National Lampoon's Animal House", "Year": "2003", "Genre": "Documentary", "Rating": "5.9", "Plot": "One 25th anniversary of one of the greatest comedies, the filmmakers and casts tell about their work on the cult classic: Animal House, a story about the dean of a college who is trying to kick the Delta House, a fraternity, out of school. However, the frat brothers of the house have other plans for him."},
{"Title": "The Hangover", "Year": "2009", "Genre": "Comedy", "Rating": "7.7", "Plot": "Angelenos Doug Billings and Tracy Garner are about to get married. Two days before the wedding, the four men in the wedding party - Doug, Doug's two best buddies Phil Wenneck and Stu Price, and Tracy's brother Alan Garner - hop into Tracy's father's beloved Mercedes convertible for a 24-hour stag party to Las Vegas. Phil, a married high school teacher, has the same maturity level as his students when he's with his pals. Stu, a dentist, is worried about everything, especially what his controlling girlfriend Melissa thinks. Because she disapproves of traditional male bonding rituals, Stu has to lie to her about the stag, he telling her that they are going on a wine tasting tour in the Napa Valley. Regardless, he intends on eventually marrying her, against the advice and wishes of his friends. And Alan seems to be unaware of what are considered the social graces of the western world. The morning after their arrival in Las Vegas, they awaken in their hotel suite each with the worst hangover. None remembers what happened in the past twelve or so hours. The suite is in shambles. And certain things are in the suite that shouldn't be, and certain things that should be in the suite are missing. Probably the most important in the latter category is Doug. As Phil, Stu and Alan try to find Doug using only what little pieces of information they have at hand, they go on a journey of discovery of how certain things got into the suite and what happened to the missing items. However they are on a race for time as if they can't find Doug in the next few hours, they are going to have to explain to Tracy why they are not yet back in Los Angeles. And even worse, they may not find Doug at all before the wedding."},
{"Title": "Dumb and Dumber", "Year": "1994", "Genre": "Comedy", "Rating": "7.3", "Plot": "Harry and Lloyd are two good friends who happen to be really stupid. The duo set out on a cross country trip from Providence to Aspen, Colorado to return a briefcase full of money to its rightful owner, a beautiful woman named Mary Swanson. After a trip of one mishap after another, the duo eventually make it to Aspen. But the two soon realize that Mary and her briefcase are the least of their problems."},
{"Title": "Vacation", "Year": "2015", "Genre": "Adventure, Comedy", "Rating": "6.1", "Plot": "Hoping to bring his family closer together and to recreate his childhood vacation for his own kids, an adult Rusty Griswold takes his wife and two sons on a cross-country road trip to Walley World. Needless to say, things don't go quite as planned."},
{"Title": "Young Frankenstein", "Year": "1974", "Genre": "Comedy", "Rating": "8.0", "Plot": "A young neurosurgeon (Gene Wilder) inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback called Igor, a pretty lab assistant named Inga and the old housekeeper, frau Blucher -iiiiihhh!-. Young Frankenstein believes that the work of his grandfather is only crap, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind..."},
{"Title": "The Big Lebowski", "Year": "1998", "Genre": "Comedy, Crime", "Rating": "8.1", "Plot": "When &quot;The Dude&quot; Lebowski is mistaken for a millionaire Lebowski, two thugs urinate on his rug to coerce him into paying a debt he knows nothing about. While attempting to gain recompense for the ruined rug from his wealthy counterpart, he accepts a one-time job with high pay-off. He enlists the help of his bowling buddy, Walter, a gun-toting Jewish-convert with anger issues. Deception leads to more trouble, and it soon seems that everyone from porn empire tycoons to nihilists want something from The Dude."},
{"Title": "Office Space", "Year": "1999", "Genre": "Comedy", "Rating": "7.8", "Plot": "In the Initech office, the insecure Peter Gibbons hates his job and the abusive Division VP Bill Lumbergh that has just hired two consultants to downsize the company. His best friends are the software engineers Michael Bolton and Samir Nagheenanajar that also hate Initech, and his next door neighbor Lawrence. His girlfriend Anne is cheating on him but she convinces Peter to visit the hypnotherapist Dr. Swanson. Peter tells how miserable his life is and Dr. Swanson hypnotizes him and he goes into a state of ecstasy. However, Dr. Swanson dies immediately after giving the hypnotic suggestion to Peter. He dates the waitress Joanna and changes his attitude in the company, being promoted by the consultants. When he discovers that Michael and Samir will be fired, they decide to plant a virus in the account system to embezzle fraction of cents in each financial operation into Peter's account. However Michael commits a mistake in the software and instead of decimals, they steal a large amount. The desperate trio tries to fix the problem or they will go to prison."},
{"Title": "Life of Brian", "Year": "1979", "Genre": "Comedy", "Rating": "8.1", "Plot": "The story of Brian of Nazareth, born on the same day as Jesus of Nazareth, who takes a different path in life that leads to the same conclusion. Brian joins a political resistance movement aiming to get the Romans out of Judea. Brian scores a victory of sorts when he manages to paint political slogans on an entire wall in the city of Jerusalem. The movement is not very effective but somehow Brian becomes a prophet and gathers his own following. His fate is sealed however and he lives a very short life."},
{"Title": "The Blues Brothers", "Year": "1980", "Genre": "Adventure, Comedy, Crime", "Rating": "7.9", "Plot": "After the release of Jake Blues from prison, he and brother Elwood go to visit &quot;The Penguin&quot;, the last of the nuns who raised them in a boarding school. They learn the Archdiocese will stop supporting the school and will sell the place to the Education Authority. The only way to keep the place open is if the $5000 tax on the property is paid within 11 days. The Blues Brothers want to help, and decide to put their blues band back together and raise the money by staging a big gig. As they set off on their &quot;mission from God&quot; they seem to make more enemies along the way. Will they manage to come up with the money in time?"},
{"Title": "Trading Places", "Year": "1983", "Genre": "Comedy", "Rating": "7.5", "Plot": "Louis Winthorpe is a businessman who works for commodities brokerage firm of Duke and Duke owned by the brothers Mortimer and Randolph Duke. Now they bicker over the most trivial of matters and what they are bickering about is whether it's a person's environment or heredity that determines how well they will do in life. When Winthorpe bumps into Billy Ray Valentine, a street hustler and assumes he is trying to rob him, he has him arrested. Upon seeing how different the two men are, the brothers decide to make a wager as to what would happen if Winthorpe loses his job, his home and is shunned by everyone he knows and if Valentine was given Winthorpe's job. So they proceed to have Winthorpe arrested and to be placed in a compromising position in front of his girlfriend. So all he has to rely on is the hooker who was hired to ruin him."},
{"Title": "Ferris Bueller's Day Off", "Year": "1986", "Genre": "Comedy", "Rating": "7.8", "Plot": "High school student Ferris Bueller wants a day off from school and he's developed an incredibly sophisticated plan to pull it off. He talks his friend Cameron into taking his father's prized Ferrari and with his girlfriend Sloane head into Chicago for the day. While they are taking in what the city has to offer school principal Ed Rooney is convinced that Ferris is, not for the first time, playing hooky for the day and is hell bent to catch him out. Ferris has anticipated that, much to Rooney's chagrin."},
{"Title": "The Naked Gun: From the Files of Police Squad!", "Year": "1988", "Genre": "Comedy, Crime", "Rating": "7.6", "Plot": "A re-run of many of the gags from the original TV series 'Police Squad'. An Airplane type spoof, this time with the an incompetent lieutenant (Drebin) who always 'gets his man'. Visual gags come thick and fast, and it's impossible to catch them all with one viewing. The plot.. Queen Elizabeth II of England is coming to town, and Vincent Ludwig has plans to assassinate her using a brainwashed baseball player."},
{"Title": "Happy Gilmore", "Year": "1996", "Genre": "Comedy, Sport", "Rating": "7.0", "Plot": "A Hockey player wannabe finds out that he has the most powerful golf drive in history. He joins the P.G.A. tour to make some money to save grandma's house. The downside is that his hocky player mentality doesn't really go on the P.G.A. tour. Especially with the favorite to win the championship."},
{"Title": "Ace Ventura: Pet Detective", "Year": "1994", "Genre": "Comedy", "Rating": "6.9", "Plot": "To be a Pet Detective, you have to understand both the criminals and animals. Ace Ventura goes even further... He behaves like a criminal animal. When a football team's mascot (a dolphin) is stolen just before the Superbowl, Ace Ventura is put on the case. Now, who would want to steal a dolphin, and why?"},
{"Title": "Spaceballs", "Year": "1987", "Genre": "Adventure, Comedy, Sci-Fi", "Rating": "7.1", "Plot": "King Roland of the planet Druidia is trying to marry his daughter Princess Vespa to Prince Valium, but Vespa is kidnapped by the evil race of the Spaceballs. The Spaceballs ask Roland a tremendous ransom: all the air of Druidia (you see, the air of Spaceball had serious pollution problems...). The King decides to offer a generous amount of money to a space rogue, Lone Starr, to persuade him to save Vespa. What follows is the parody of a _LOT_ of famous SF movies."},
{"Title": "National Lampoon's Christmas Vacation", "Year": "1989", "Genre": "Comedy", "Rating": "7.6", "Plot": "It's Christmas time and the Griswolds are preparing for a family seasonal celebration, but things never run smoothly for Clark, his wife Ellen and their two kids. Clark's continual bad luck is worsened by his obnoxious family guests, but he manages to keep going knowing that his Christmas bonus is due soon."},
{"Title": "Shaun of the Dead", "Year": "2004", "Genre": "Comedy, Horror", "Rating": "7.9", "Plot": "Shaun doesn't have a very good day, so he decides to turn his life around by getting his ex to take him back, but he times it for right in the middle of what may be a zombie apocalypse... But for him, it's an opportunity to show everyone he knows how useful he is by saving them all. All he has to do is survive... And get his ex back."},
{"Title": "There's Something About Mary", "Year": "1998", "Genre": "Comedy, Romance", "Rating": "7.1", "Plot": "Ted was a geek in high school, who was going to go to the prom with one of the most popular girls in school, Mary. The prom date never happened, because Ted had a very unusual accident. Thirteen years later he realizes he is still in love with Mary, so he hires a private investigator to track her down. That investigator discovers he too may be in love with Mary, so he gives Ted some false information to keep him away from her. But soon Ted finds himself back into Mary's life, as we watch one funny scene after another."},
{"Title": "Anchorman: The Legend of Ron Burgundy", "Year": "2004", "Genre": "Comedy", "Rating": "7.2", "Plot": "In 1970s San Diego, journalism was a well respected profession and people actually cared about what they saw on TV. And the top rated anchor man in the city is Ron Burgundy. He enjoys his run at the top, and has for the last five years. And his news team is equally as good as he is. Professional jock and former professional baseball player Champ Kind handles the sports, the curiously dim witted Brick Tamland - who's a few channels short of a cable subscription - handles the weather, and ladies' man Brian Fantana - whose collection of fine scents would be in the Guinness Book Of Records - handles the on-field reporting. But now all that is about to change forever. The TV station Burgundy works for, Channel 4, has embraced diversity and has hired a beautiful new female anchor named Veronica Corningstone. While Ron Burgundy and the rest of the Channel 4 news team enjoys fighting with competitors, drinking, and flirting with the ladies, Veronica quietly climbs her way to the top. And Veronica's success drives Ron Burgundy crazy. So much that Veronica's meddling causes Ron to get demoted and ultimately lose his job with Channel 6. Now left with nothing, Ron must find a way to get back to the top - and that involves a story about a rare Chinese panda giving birth on US soil. Will Ron be the one to report the story on a national level?"},
{"Title": "The 40-Year-Old Virgin", "Year": "2005", "Genre": "Comedy, Romance", "Rating": "7.1", "Plot": "Andy at the age of 40 still hasn't had sex. He lets his secret slip at a poker game with his buds from work. After the revealing all his friends are on a mission to help get him laid. Along the way Andy meets a nice mom, Trish, and they fall head over heels for each other."},
{"Title": "Stripes", "Year": "1981", "Genre": "Comedy, War", "Rating": "6.9", "Plot": "At the end of a very bad day when he realizes his life has gone and is going nowhere, John Winger is able to convince his best friend, Russell Ziskey, whose life is not much better, to enlist in the army, despite they not being obvious soldier material. In basic training, they are only two of a bunch of misfits that comprise their platoon. However, it is still John that is constantly butting heads with their drill sergeant, Sergeant Hulka. Two of their saving graces are Stella and Louise, two MPs who get them out of one scrape after another. Their entire platoon is in jeopardy of not graduating. But what happens during basic leads to their entire platoon being assigned to an overseas mission in Italy, to test a new urban assault vehicle, the EM-50 project. John and Russell decide to take the EM-50 for an unauthorized test drive to visit Stella and Louise who have been reassigned to West Germany. In the process, the rest of the platoon, Hulka, and Hulka's immediate superior, self-absorbed Captain Stillman, get caught unofficially behind enemy Communist lines in Czechoslovakia. John and Russell, with Stella and Louise's help, will have to show their true mettle as US army soldiers and in the process test the capabilities of the EM-50 to rescue their platoon without the rest of the US army knowing what's going on, and thus without any assistance beyond themselves."},
{"Title": "Tommy Boy", "Year": "1995", "Genre": "Adventure, Comedy", "Rating": "7.1", "Plot": "Tommy Callahan Jr. is a slow-witted, clumsy guy who recently graduated college after attending for seven years. His father, Big Tom Callahan, owns an auto parts factory in Ohio. When Tommy arrives back home, he finds he has a position at the factory waiting for him. His dad also introduces Tommy to the new brake pad division of the factory and to Tommy's soon-to-be stepmother, Beverly, and her son Paul. But when Big Tom dies, the factory threatens to go under unless the new brake pads are to be sold. Therefore, Tommy must go on the road to sell them, along with the assistance of Richard, Big Tom's right-hand man. Will Tommy save the company, or will the factory, and the town, go under?"},
{"Title": "Austin Powers: International Man of Mystery", "Year": "1997", "Genre": "Adventure, Comedy", "Rating": "7.0", "Plot": "Austin Powers is a 60's spy who is cryonically frozen and released in the 1990's. The world is a very different place for Powers. Unfortunately for Austin, everyone is no longer sex-mad. Although he may be in a different decade, his mission is still the same. He has teamed up with Vanessa Kensington to stop the evil Dr. Evil, who was also frozen in the past. Dr. Evil stole a nuclear weapon and is demanding a payment of (when he realises its the 90's) 100 billion dollars. Can Austin Powers stop this madman? or will he caught up with Evil's henchman, with names like Alotta Fagina and Random Task? Only time will tell!"},
{"Title": "Home Alone", "Year": "1990", "Genre": "Comedy, Family", "Rating": "7.5", "Plot": "It is Christmas time and the McCallister family is preparing for a vacation in Paris, France. But the youngest in the family named Kevin got into a scuffle with his older brother Buzz and was sent to his room which is on the third floor of his house. Then, the next morning, while the rest of the family was in a rush to make it to the airport on time, they completely forgot about Kevin who now has the house all to himself. Being home alone was fun for Kevin, having a pizza all to himself, jumping on his parents' bed, and making a mess. Then, Kevin discovers about two burglars, Harry and Marv, about to rob his house on Christmas Eve. Kevin acts quickly by wiring his own house with makeshift booby traps to stop the burglars and to bring them to justice."},
{"Title": "My Cousin Vinny", "Year": "1992", "Genre": "Comedy, Crime", "Rating": "7.5", "Plot": "Bill Gambini and Stanley Rothenstein are two friends from New York University who just received scholarships to UCLA. They decide to drive through the South. Once they arrive in Alabama, they stop at a local convenience store to pick up a few snacks. But, no sooner than they leave the store, they are arrested. They had thought that they were arrested for shoplifting, but they were arrested for murder and robbery. Worse, they are facing execution for this crime. Bill and Stan do not have enough money for a lawyer, so the good news is that Bill has a lawyer in his family, his cousin, Vincent Laguardia Gambini. The bad news is that Vinny is an inexperienced lawyer who has not been at a trial. So, Vinny has to defend his clients and battle an uncompromising judge, some tough locals, and even his fiancée, Mona Lisa Vito, who just does not know when to shut up, to prove his clients' innocence. But he will soon realize that he is going to need help."},
{"Title": "Superbad", "Year": "2007", "Genre": "Comedy", "Rating": "7.6", "Plot": "Seth and Evan are best friends, inseparable, navigating the last weeks of high school. Usually shunned by the popular kids, Seth and Evan luck into an invitation to a party, and spend a long day, with the help of their nerdy friend Fogell, trying to score enough alcohol to lubricate the party and inebriate two girls, Jules and Becca, so they can kick-start their sex lives and go off to college with a summer full of experience and new skills. Their quest is complicated by Fogell's falling in with two inept cops who both slow and assist the plan. If they do get the liquor to the party, what then? Is sex the only rite of passage at hand?"},
{"Title": "Step Brothers", "Year": "2008", "Genre": "Comedy", "Rating": "6.9", "Plot": "Brennan Huff and Dale Doback are both about 40 when Brennan's mom and Dale's dad marry. The sons still live with the parents so they must now share a room. Initial antipathy threatens the household's peace and the parents' relationship. Dad lays down the law: both slackers have a week to find a job. Out of the job search and their love of music comes a pact that leads to friendship but more domestic disarray compounded by the boys' sleepwalking. Hovering nearby are Brennan's successful brother and his lonely wife: the brother wants to help sell his step-father's house, the wife wants Dale's attention, and the newlyweds want to retire and sail the seven seas. Can harmony come from the discord?"},
{"Title": "Police Academy", "Year": "1984", "Genre": "Comedy", "Rating": "6.7", "Plot": "The year is 1984 and the mayoress has removed set personal criteria form the requirements to join the police force. No longer is sex, weight, height and orientation a factor. This now allows for an insurgence of people applying. The Police Academy series follows a select group of misfits in their quest to become police men and women. The first film of the series follows these misfits in their time at the Police Academy. The main focus is on a petty criminal called Mahoney. Mahoney is busted for criminal damage and as punishment is forced to go to Police Academy. Mahoney initially feels that this isn't the right place for him and he makes it his mission to be thrown out as he is not allowed to quit. As the classes go by and the training exercises are played out, Mahoney soon realizes that he is actually enjoying the academy and does want to become a police officer. We are also introduced to the gun maniac Tackelberry, the very tall Hightower, voluptuous Callahan, squeaky Hooks, human beat box and sound effects master Jones and the ever confuzzled Commandant Lassard. This group become good friends and become the base for the rest of the series of films."},
{"Title": "The Jerk", "Year": "1979", "Genre": "Comedy", "Rating": "7.2", "Plot": "Navin is an idiot. He grew up in Mississippi as adopted son of a black family but on his 18th birthday he feels he wants to discover the rest of the world and sets out to St. Louis. There everyone exploits his naivety, but then a simple invention brings him a fortune."},
{"Title": "Big", "Year": "1988", "Genre": "Comedy, Drama, Family", "Rating": "7.3", "Plot": "A young boy (David Moscow) makes a wish at a carnival machine to be big. He wakes up the following morning to find that it has been granted and his body has grown older overnight. But he is still the same 13-year-old boy inside. Now he must learn how to cope with the unfamiliar world of grown-ups including getting a job and having his first romantic encounter with a woman. What will he find out about this strange world?"},
{"Title": "Back to the Future", "Year": "1985", "Genre": "Adventure, Comedy, Sci-Fi", "Rating": "8.5", "Plot": "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean &quot;time machine&quot; invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future."},
{"Title": "The Princess Bride", "Year": "1987", "Genre": "Adventure, Family, Fantasy", "Rating": "8.1", "Plot": "An elderly man reads the book &quot;The Princess Bride&quot; to his sick and thus currently bedridden adolescent grandson, the reading of the book which has been passed down within the family for generations. The grandson is sure he won't like the story, with a romance at its core, he preferring something with lots of action and &quot;no kissing&quot;. But the grandson is powerless to stop his grandfather, whose feelings he doesn't want to hurt. The story centers on Buttercup, a former farm girl who has been chosen as the princess bride to Prince Humperdinck of Florian. Buttercup does not love him, she who still laments the death of her one true love, Westley, five years ago. Westley was a hired hand on the farm, his stock answer of &quot;as you wish&quot; to any request she made of him which she came to understand was his way of saying that he loved her. But Westley went away to sea, only to be killed by the Dread Pirate Roberts. On a horse ride to clear her mind of her upcoming predicament of marriage, Buttercup is kidnapped by a band of bandits: Vizzini who works on his wits, and his two associates, a giant named Fezzik who works on his brawn, and a Spaniard named Inigo Montoya, who has trained himself his entire life to be an expert swordsman. They in turn are chased by the Dread Pirate Roberts himself. But chasing them all is the Prince, and his men led by Count Tyrone Rugen. What happens to these collectives is dependent partly on Buttercup, who does not want to marry the Prince, and may see other options as lesser evils, and partly on the other motives of individuals within the groups. But a larger question is what the grandson will think of the story as it proceeds and at its end, especially as he sees justice as high a priority as action."},
{"Title": "The Pink Panther", "Year": "2006", "Genre": "Adventure, Comedy, Crime", "Rating": "5.6", "Plot": "When the coach of the France soccer team is killed by a poisoned dart in the stadium in the end of a game, and his expensive and huge ring with the diamond Pink Panther disappears, the ambitious Chief Insp. Dreyfus assigns the worst police inspector Jacques Clouseau to the case. His intention is to give a diversion to the press, while he uses his best men to chase the killer and thief. He assigns Gendarme Gilbert Ponton to work with Clouseau and inform each step of the investigation. When Clouseau is nominated with honor to the highest prize in France, Dreyfus decides to humiliate Clouseau and take him out of the case. However Clouseau has already solved the mystery."},
{"Title": "Wayne's World", "Year": "1992", "Genre": "Comedy, Music", "Rating": "7.0", "Plot": "Wayne is still living at home. He has a world class collection of name tags from jobs he's tried, but he does have his own public access TV show. A local station decides to hire him and his sidekick, Garth, to do their show professionally and Wayne & Garth find that it is no longer the same. Wayne falls for a bass guitarist and uses his and Garth's Video contacts to help her career along, knowing that Ben Oliver, the sleazy advertising guy who is ruining their show will probably take her away from him if they fail."},
{"Title": "Mrs. Doubtfire", "Year": "1993", "Genre": "Comedy, Drama, Family", "Rating": "6.9", "Plot": "Eccentric actor Daniel Hillard is an amusing and caring father. But after a disastrous birthday party for his son, Daniel's wife Miranda draws the line and files a divorce. He can see his three children only once a week which doesn't sit well with him. Daniel also holds a job at a TV studio as a shipping clerk under the recommendation of his liason. But when Miranda puts out an ad for a housekeeper, Daniel takes it upon himself to make a disguise as a Scottish lady named Mrs Doubtfire. And Daniel must also deal with Miranda's new boyfriend Stu Dunemyer."},
{"Title": "Coming to America", "Year": "1988", "Genre": "Comedy, Romance", "Rating": "7.0", "Plot": "It is the 21st birthday of Prince Akeem of Zamunda and he is to marry a woman he never saw before. Now the prince breaks with tradition and travels to America to look for the love of his life."},
{"Title": "Wedding Crashers", "Year": "2005", "Genre": "Comedy, Romance", "Rating": "7.0", "Plot": "Two friends, John (played by Owen Wilson) and Jeremy (Vince Vaughn), crash weddings to pick up women. One day they crash the wedding of the daughter of the Treasury Secretary, Secretary Cleary (Christopher Walken). Instead of short-term flings they end up being invited to the Clearys' island estate, and potentially meet the loves of their lives..."},
{"Title": "Meet the Parents", "Year": "2000", "Genre": "Comedy, Romance", "Rating": "7.0", "Plot": "A Jewish male nurse plans to ask his live-in girl friend to marry him. However, he learns that her strict father expects to be asked for his daughter's hand before she can accept. Thus begins the visit from Hell as the two travel to meet Mom and Dad, who turns out to be former CIA with a lie detector in the basement. Coincidentally, a sister also has announced her wedding to a young doctor. Of course everything that can go wrong, does, including the disappearance of Dad's beloved Himalayan cat, Jinxie."},
{"Title": "Old School", "Year": "2003", "Genre": "Comedy", "Rating": "7.1", "Plot": "Mitch, Frank and Beanie are disillusioned with their personal lives begining when Mitch's nymphomanic girlfriend, Heidi, cheats on him, then former party animal Frank gets married, but unwilling to let go of his wild life, and Beanie is a family man seeking to reclaim his wild and crazy youth. Beanie suggests that they form their own fraternity in Mitch's new house on a college campus to re-live their glory days by bringing together a variety of misfit college students, losers, middle-aged and elderly retirees as their new friends and later try to avoid being evicted by the new Dean of Students, Pritchard, whom still holds a personal grudge against all three of them."},
{"Title": "Beverly Hills Cop", "Year": "1984", "Genre": "Action, Comedy, Crime", "Rating": "7.3", "Plot": "Detroit cop Axel Foley is delighted when he receives a surprise visit from his best friend Mikey Tandino, who lives in California. Not long after Mikey arrives in Detroit, Mikey is killed, right in front of Axel, by a man named Zack. Axel follows Zack to Beverly Hills, California, where Beverly Hills police department Lieutenant Andrew Bogomil assigns Detective Billy Rosewood and Rosewood's partner, Sergeant John Taggart, to keep an eye on Axel. Axel visits his friend Jenny Summers, who works in an art gallery. With Jenny's help, Axel discovers that Zack works for Jenny's boss, Victor Maitland, the man who owns the art gallery. Maitland is a drug kingpin who is using the gallery as a front, and Maitland had Zack kill Mikey after Maitland accused Mikey of stealing some of Maitland's bonds. With the help of Jenny, Billy, and Taggart, Axel does what he can to make sure Maitland and Zack won't kill any more people."},
{"Title": "American Pie", "Year": "1999", "Genre": "Comedy", "Rating": "7.0", "Plot": "Jim, Oz, Finch and Kevin are four friends who make a pact that before they graduate they will all lose their virginity. The hard job now is how to reach that goal by prom night. Whilst Oz begins singing to grab attention and Kevin tries to persuade his girlfriend, Finch tries any easy route of spreading rumors and Jim fails miserably. Whether it is being caught on top of a pie or on the Internet, Jim always ends up with his trusty sex advice from his father. Will they achieve their goal of getting laid by prom night? Or will they learn something much different?"},
{"Title": "Napoleon Dynamite", "Year": "2004", "Genre": "Comedy", "Rating": "6.9", "Plot": "Preston, Idaho's most curious resident, Napoleon Dynamite, lives with his grandma and his 32-year-old brother (who cruises chat rooms for ladies) and works to help his best friend, Pedro, snatch the Student Body President title from mean teen Summer Wheatley."},
{"Title": "Liar Liar", "Year": "1997", "Genre": "Comedy, Fantasy", "Rating": "6.9", "Plot": "Fletcher Reede, a fast talking attorney, habitual liar, and divorced father is an incredibly successful lawyer who has built his career by lying. He has a habit of giving precedence to his job and always breaking promises to be with his young son Max, but Fletcher lets Max down once too often, for missing his own son's birthday party. But until then at 8:15 Max has decided to make an honest man out of him as he wishes for one whole day his dad couldn't tell a lie. When the wish comes true all Fletcher can do is tell the truth and cannot tell one lie. Uh-oh for Fletcher!"},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."}
]