[
{"Title": "The Godfather", "Year": "1972", "Genre": "Crime, Drama", "Rating": "9.2", "Plot": "When the aging head of a famous crime family decides to transfer his position to one of his subalterns, a series of unfortunate events start happening to the family, and a war begins between all the well-known families leading to insolence, deportation, murder and revenge, and ends with the favorable successor being finally chosen."},
{"Title": "The Godfather: Part II", "Year": "1974", "Genre": "Crime, Drama", "Rating": "9.0", "Plot": "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba."},
{"Title": "Goodfellas", "Year": "1990", "Genre": "Crime, Drama", "Rating": "8.7", "Plot": "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?"},
{"Title": "The Shawshank Redemption", "Year": "1994", "Genre": "Drama", "Rating": "9.3", "Plot": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red."},
{"Title": "The Silence of the Lambs", "Year": "1991", "Genre": "Crime, Drama, Thriller", "Rating": "8.6", "Plot": "FBI trainee Clarice Starling works hard to advance her career, including trying to hide or put behind her West Virginia roots, of which if some knew would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford. While she is still a trainee, Crawford does ask her to question Dr. Hannibal Lecter, a psychiatrist imprisoned thus far for eight years in maximum security isolation for being a serial killer, he who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as Buffalo Bill who has so far killed five victims, all located in the eastern US, all young women who are slightly overweight especially around the hips, all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her as a woman to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game with her having often to read between the very cryptic lines he provides. She has to decide how much she will play along as his request in return for talking to him is to expose herself emotionally to him. The case takes more dire turns when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin, the daughter of Senator Ruth Martin, which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton, the warden at the prison, he an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings."},
{"Title": "Seven Samurai", "Year": "1954", "Genre": "Adventure, Drama", "Rating": "8.7", "Plot": "A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village."},
{"Title": "The Departed", "Year": "2006", "Genre": "Crime, Drama, Thriller", "Rating": "8.5", "Plot": "In South Boston, the state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints undercover?"},
{"Title": "Scarface", "Year": "1983", "Genre": "Crime, Drama", "Rating": "8.3", "Plot": "Tony Montana manages to leave Cuba during the Mariel exodus of 1980. He finds himself in a Florida refugee camp but his friend Manny has a way out for them: undertake a contract killing and arrangements will be made to get a green card. He's soon working for drug dealer Frank Lopez and shows his mettle when a deal with Colombian drug dealers goes bad. He also brings a new level of violence to Miami. Tony is protective of his younger sister but his mother knows what he does for a living and disowns him. Tony is impatient and wants it all however, including Frank's empire and his mistress Elvira Hancock. Once at the top however, Tony's outrageous actions make him a target and everything comes crumbling down."},
{"Title": "Casino", "Year": "1995", "Genre": "Crime, Drama", "Rating": "8.2", "Plot": "This Martin Scorsese film depicts the Janus-like quality of Las Vegas--it has a glittering, glamorous face, as well as a brutal, cruel one. Ace Rothstein and Nicky Santoro, mobsters who move to Las Vegas to make their mark, live and work in this paradoxical world. Seen through their eyes, each as a foil to the other, the details of mob involvement in the casinos of the 1970's and '80's are revealed. Ace is the smooth operator of the Tangiers casino, while Nicky is his boyhood friend and tough strongman, robbing and shaking down the locals. However, they each have a tragic flaw--Ace falls in love with a hustler, Ginger, and Nicky falls into an ever-deepening spiral of drugs and violence."},
{"Title": "Pulp Fiction", "Year": "1994", "Genre": "Crime, Drama", "Rating": "8.9", "Plot": "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents."},
{"Title": "The Usual Suspects", "Year": "1995", "Genre": "Crime, Mystery, Thriller", "Rating": "8.6", "Plot": "Following a truck hijack in New York, five conmen are arrested and brought together for questioning. As none of them are guilty, they plan a revenge operation against the police. The operation goes well, but then the influence of a legendary mastermind criminal called Keyser Söze is felt. It becomes clear that each one of them has wronged Söze at some point and must pay back now. The payback job leaves 27 men dead in a boat explosion, but the real question arises now: Who actually is Keyser Söze?"},
{"Title": "Die Hard", "Year": "1988", "Genre": "Action, Thriller", "Rating": "8.2", "Plot": "NYPD cop John McClane goes on a Christmas vacation to visit his wife Holly in Los Angeles where she works for the Nakatomi Corporation. While they are at the Nakatomi headquarters for a Christmas party, a group of bank robbers led by Hans Gruber take control of the building and hold everyone hostage, with the exception of John, while they plan to perform a lucrative heist. Unable to escape and with no immediate police response, John is forced to take matters into his own hands."},
{"Title": "Fargo", "Year": "1996", "Genre": "Crime, Drama, Thriller", "Rating": "8.1", "Plot": "Jerry works in his father-in-law's car dealership and has gotten himself in financial problems. He tries various schemes to come up with money needed for a reason that is never really explained. It has to be assumed that his huge embezzlement of money from the dealership is about to be discovered by father-in-law. When all else falls through, plans he set in motion earlier for two men to kidnap his wife for ransom to be paid by her wealthy father (who doesn't seem to have the time of day for son-in-law). From the moment of the kidnapping, things go wrong and what was supposed to be a non-violent affair turns bloody with more blood added by the minute. Jerry is upset at the bloodshed, which turns loose a pregnant sheriff from Brainerd, MN who is tenacious in attempting to solve the three murders in her jurisdiction."},
{"Title": "American History X", "Year": "1998", "Genre": "Crime, Drama", "Rating": "8.5", "Plot": "Derek Vineyard is paroled after serving 3 years in prison for brutally killing two black men who tried to break into/steal his truck. Through his brother, Danny Vineyard's narration, we learn that before going to prison, Derek was a skinhead and the leader of a violent white supremacist gang that committed acts of racial crime throughout L.A. and his actions greatly influenced Danny. Reformed and fresh out of prison, Derek severs contact with the gang and becomes determined to keep Danny from going down the same violent path as he did."},
{"Title": "Training Day", "Year": "2001", "Genre": "Crime, Drama, Thriller", "Rating": "7.7", "Plot": "In Los Angeles, a city where streets are overrun by drug dealers, those who have sworn to uphold the law are breaking them to clean up the streets. Denzel Washington plays L.A.P.D. detective Alonzo Harris, a veteran narcotics officer whose methods of enforcing the law are questionable, if not corrupt. 'Training Day' follows Harris as he trains rookie Jake Hoyt over a 24-hour period. Ethical dilemmas arise for Hoyt as well as the audience as questions present themselves as to whether or not Harris' methodology for ridding the streets of South Central Los Angeles of drugs is right or wrong."},
{"Title": "Heat", "Year": "1995", "Genre": "Crime, Drama, Thriller", "Rating": "8.2", "Plot": "Hunters and their prey--Neil and his professional criminal crew hunt to score big money targets (banks, vaults, armored cars) and are, in turn, hunted by Lt. Vincent Hanna and his team of cops in the Robbery/Homicide police division. A botched job puts Hanna onto their trail while they regroup and try to put together one last big 'retirement' score. Neil and Vincent are similar in many ways, including their troubled personal lives. At a crucial moment in his life, Neil disobeys the dictum taught to him long ago by his criminal mentor--'Never have anything in your life that you can't walk out on in thirty seconds flat, if you spot the heat coming around the corner'--as he falls in love. Thus the stage is set for the suspenseful ending...."},
{"Title": "Léon: The Professional", "Year": "1994", "Genre": "Crime, Drama, Thriller", "Rating": "8.6", "Plot": "After her father, mother, older sister and little brother are killed by her father's employers, the 12-year-old daughter of an abject drug dealer is forced to take refuge in the apartment of a professional hitman who at her request teaches her the methods of his job so she can take her revenge on the corrupt DEA agent who ruined her life by killing her beloved brother."},
{"Title": "The Dark Knight", "Year": "2008", "Genre": "Action, Crime, Drama", "Rating": "9.0", "Plot": "Set within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against the Joker becomes deeply personal, forcing him to &quot;confront everything he believes&quot; and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent and Rachel Dawes."},
{"Title": "L.A. Confidential", "Year": "1997", "Genre": "Crime, Drama, Mystery", "Rating": "8.3", "Plot": "1950's Los Angeles is the seedy backdrop for this intricate noir-ish tale of police corruption and Hollywood sleaze. Three very different cops are all after the truth, each in their own style: Ed Exley, the golden boy of the police force, willing to do almost anything to get ahead, except sell out; Bud White, ready to break the rules to seek justice, but barely able to keep his raging violence under control; and Jack Vincennes, always looking for celebrity and a quick buck until his conscience drives him to join Exley and White down the one-way path to find the truth behind the dark world of L.A. crime."},
{"Title": "Reservoir Dogs", "Year": "1992", "Genre": "Crime, Drama, Thriller", "Rating": "8.3", "Plot": "Six criminals, who are strangers to each other, are hired by a crime boss, Joe Cabot, to carry out a diamond robbery. Right at the outset, they are given false names with the intention that they won't get too close and will concentrate on the job instead. They are completely sure that the robbery is going to be a success. But, when the police show up right at the time and the site of the robbery, panic spreads amongst the group members, and two of them are killed in the subsequent shootout, along with a few policemen and civilians. When the remaining people assemble at the premeditated rendezvous point (a warehouse), they begin to suspect that one of them is an undercover cop."},
{"Title": "Taxi Driver", "Year": "1976", "Genre": "Crime, Drama", "Rating": "8.3", "Plot": "Travis Bickle is an ex-Marine and Vietnam War veteran living in New York City. As he suffers from insomnia, he spends his time working as a taxi driver at night, watching porn movies at seedy cinemas during the day, or thinking about how the world, New York in particular, has deteriorated into a cesspool. He's a loner who has strong opinions about what is right and wrong with mankind. For him, the one bright spot in New York humanity is Betsy, a worker on the presidential nomination campaign of Senator Charles Palantine. He becomes obsessed with her. After an incident with her, he believes he has to do whatever he needs to make the world a better place in his opinion. One of his priorities is to be the savior for Iris, a twelve-year-old runaway and prostitute who he believes wants out of the profession and under the thumb of her pimp and lover Matthew."},
{"Title": "The Untouchables", "Year": "1987", "Genre": "Crime, Drama, Thriller", "Rating": "7.9", "Plot": "1920's prohibition Chicago is corrupt from the judges downward. So in going up against Al Capone, Treasury agent Eliot Ness picks just two cops to help him and his accountant colleague. One is a sharp-shooting rookie, the other a seen-it-all beat man. The four of them are ready to battle Capone and his empire, but it could just be that guns are not the best way to get him."},
{"Title": "No Country for Old Men", "Year": "2007", "Genre": "Crime, Drama, Thriller", "Rating": "8.1", "Plot": "In rural Texas, welder and hunter Llewelyn Moss (Josh Brolin) discovers the remains of several drug runners who have all killed each other in an exchange gone violently wrong. Rather than report the discovery to the police, Moss decides to simply take the two million dollars present for himself. This puts the psychopathic killer, Anton Chigurh (Javier Bardem), on his trail as he dispassionately murders nearly every rival, bystander and even employer in his pursuit of his quarry and the money. As Moss desperately attempts to keep one step ahead, the blood from this hunt begins to flow behind him with relentlessly growing intensity as Chigurh closes in. Meanwhile, the laconic Sheriff Ed Tom Bell (Tommy Lee Jones) blithely oversees the investigation even as he struggles to face the sheer enormity of the crimes he is attempting to thwart."},
{"Title": "Ocean's Eleven", "Year": "2001", "Genre": "Crime, Thriller", "Rating": "7.8", "Plot": "Danny Ocean wants to score the biggest heist in history. He combines an eleven member team, including Frank Catton, Rusty Ryan and Linus Caldwell. Their target? The Bellagio, the Mirage and the MGM Grand. All casinos owned by Terry Benedict. It's not going to be easy, as they plan to get in secretly and out with $150 million."},
{"Title": "Butch Cassidy and the Sundance Kid", "Year": "1969", "Genre": "Biography, Crime, Drama", "Rating": "8.1", "Plot": "Butch and Sundance are the two leaders of the Hole-in-the-Wall Gang. Butch is all ideas, Sundance is all action and skill. The west is becoming civilized and when Butch and Sundance rob a train once too often, a special posse begins trailing them no matter where they run. Over rock, through towns, across rivers, the group is always just behind them. When they finally escape through sheer luck, Butch has another idea, &quot;Let's go to Bolivia&quot;. Based on the exploits of the historical characters."},
{"Title": "Carlito's Way", "Year": "1993", "Genre": "Crime, Drama, Thriller", "Rating": "7.9", "Plot": "A Puerto Rican ex-con pledges to stay away from his former drug dealing ways but finds himself being dragged back by his past connections and the naive machinations of his lawyer and best friend. Hoping to raise enough money to get away from New York, Carlito Brigante takes on the job of running a nightclub, renews an affair with a dancer but old associates and old instincts suck him back into a world of violence and mistrust."},
{"Title": "Gangs of New York", "Year": "2002", "Genre": "Crime, Drama", "Rating": "7.5", "Plot": "Having seen his father killed in a major gang fight in New York, young Amsterdam Vallon is spirited away for his own safety. Some years later, he returns to the scene of his father's death, the notorious Five Points district in New York. It's 1863 and lower Manhattan is run by gangs, the most powerful of which is the Natives, headed by Bill &quot;The Butcher&quot; Cutting. He believes that America should belong to native-born Americans and opposes the waves of immigrants, mostly Irish, entering the city. It's also the time of the Civil War and forced conscription leads to the worst riots in US history. Amid the violence and corruption, young Vallon tries to establish himself in the area and also seek revenge over his father's death."},
{"Title": "Batman Begins", "Year": "2005", "Genre": "Action, Adventure", "Rating": "8.3", "Plot": "When his parents are killed, billionaire playboy Bruce Wayne relocates to Asia where he is mentored by Henri Ducard and Ra's Al Ghul in how to fight evil. When learning about the plan to wipe out evil in Gotham City by Ducard, Bruce prevents this plan from getting any further and heads back to his home. Back in his original surroundings, Bruce adopts the image of a bat to strike fear into the criminals and the corrupt as the icon known as 'Batman'. But it doesn't stay quiet for long."},
{"Title": "Road to Perdition", "Year": "2002", "Genre": "Crime, Drama, Thriller", "Rating": "7.7", "Plot": "1931. Mike Sullivan and Connor Rooney are two henchmen of elderly Chicago-based Irish-American mobster John Rooney, Connor's father. In many respects, John treats Mike more as his son, who he raised as his own after Mike was orphaned, than the volatile Connor, who nonetheless sees himself as the heir apparent to the family business. One evening, Mike's eldest son, twelve year old Michael Sullivan Jr., who has no idea what his father does for a living, witnesses Connor and his father gun down an associate and his men, the situation gone wrong initiated from an action by Connor. Caught witnessing the incident, Michael is sworn to secrecy about what he saw. Regardless, Connor, not wanting any loose ends, makes an attempt to kill Mike, his wife and their two sons. Mike and the surviving members of his family know that they need to go on the run as Connor, who has gone into hiding, will be protected through mob loyalty, especially by John, who cannot turn on his own flesh and blood. Still, Mike has to figure out a way for retribution for what Connor did, while still protecting him and his family, not only from Connor, but from John and his fellow associates. Through it all, Mike wants those in his family that had no say in what he chose as a living, to have some redemption for their eternal souls."},
{"Title": "Magnum Force", "Year": "1973", "Genre": "Action, Crime, Mystery", "Rating": "7.2", "Plot": "San Francisco Police Inspector 'Dirty' Harry Callahan and his new partner, Early Smith have been temporarily reassigned from Homicide to Stakeout Duty. You Meanwhile, those of the city's criminals who manage to avoid punishment by the courts are nevertheless being killed by unknown assassins. Callahan begins to investigate the murders despite being the orders of his superior officer, Lieutenant Briggs. A man has to know his limitations..."},
{"Title": "The Dark Knight Rises", "Year": "2012", "Genre": "Action, Thriller", "Rating": "8.4", "Plot": "Despite his tarnished reputation after the events of The Dark Knight, in which he took the rap for Dent's crimes, Batman feels compelled to intervene to assist the city and its police force which is struggling to cope with Bane's plans to destroy the city."},
{"Title": "The Making of 'Kill Bill: Volume 2'", "Year": "2004", "Genre": "Documentary", "Rating": "6.2", "Plot": "N/A"},
{"Title": "Sin City", "Year": "2005", "Genre": "Crime, Thriller", "Rating": "8.0", "Plot": "Four tales of crime adapted from Frank Miller's popular comics, focusing around a muscular brute who's looking for the person responsible for the death of his beloved Goldie, a man fed up with Sin City's corrupt law enforcement who takes the law into his own hands after a horrible mistake, a cop who risks his life to protect a girl from a deformed pedophile, and a hitman looking to make a little cash."},
{"Title": "Mystic River", "Year": "2003", "Genre": "Crime, Drama, Mystery", "Rating": "8.0", "Plot": "In the summer of 1975 in a neighborhood in Boston, 3 kids, Dave Boyle and two of his friends, Jimmy and Sean, are playing on the sidewalk when Dave gets abducted by two men and endures several days of sexual abuse. Eventually, Dave escapes traumatized throughout adulthood. Jimmy is an ex-con and a father of three, whose daughter Katie, is found dead and Dave becomes the number one suspect. Sean is a homicide detective, investigating Katie's murder, ends up finding himself faced with past and present demons as more is uncovered about Katie's murder. Learning Katie had a boyfriend, ballistics later turn up a gun belonging to the father, which then puts her boyfriend as the suspect. Will Sean find out who killed Katie? Will Jimmy make it through the investigation? And will Dave ever find out what really happened when he was abducted?"},
{"Title": "Falling Down", "Year": "1993", "Genre": "Crime, Drama, Thriller", "Rating": "7.6", "Plot": "On the day of his daughter's (Joey Hope Singer) birthday, William &quot;D-Fens&quot; Foster (Michael Douglas) is trying to get to his estranged ex-wife's (Barbara Hershey) house to see his daughter. He has a breakdown and leaves his car in a traffic jam in Los Angeles and decides to walk. Along the way he stops at a convenience store and tries to get some change for a phone call but the owner, Mister Lee (Michael Paul Chan), does not give him change. This destabilizes William who then breaks apart the shop with a baseball bat and goes to an isolated place to drink a coke. Two gangsters (Agustin Rodriguez & Eddie Frias) threaten him and he reacts by hitting them with the bat. D-FENS continues walking and stops at a phone booth. The gangsters hunt him down with their gang and shoot at him but crash their car. William goes nuts and takes their gym bag with weapons proceeding in his journey of rage against injustice. Meanwhile Sergeant Martin Prendergast (Robert Duvall), who is working on his last day before retirement, is following the wave of crimes and believes that the same man is responsible but the other detectives do not pay attention to him."},
{"Title": "Collateral", "Year": "2004", "Genre": "Crime, Drama, Thriller", "Rating": "7.5", "Plot": "LA cabbie Max Durocher is the type of person who can wax poetic about other people's lives, which impresses U.S. Justice Department prosecutor Annie Farrell, one of his fares, so much that she gives him her telephone number at the end of her ride. Although a dedicated man as seen through the efficiency in which he does his work, he can't or won't translate that eloquence into a better life for himself. He deludes himself into believing that his now twelve year cabbie job is temporary and that someday he will own his own limousine service. He even lies to his hospitalized mother that he already owns one, with a further lie that he tells her as such primarily to make her happy, rather than the truth which is that he won't do anything to achieve that dream. One night, Max picks up a well dressed man named Vincent, who asks Max to be his only fare for the evening. For a flat fee of $600, plus an extra $100 if he gets to the airport on time - Vincent wants Max to drive him to five stops that evening. Max somewhat reluctantly agrees. Max learns the hard way at their first stop when a body falls from a third story apartment window and lands dead on top of his cab that Vincent is a contract hit man. Vincent's main goal, as per his current contract, is to kill five people, one at each of the stops, but he will not let others get in the way of that goal, even if it means killing them, including Max. As Vincent forces Max to continue driving him for the evening, Max tries slyly at every turn to take back control of his life from Vincent, especially when Max learns of one of the names on Vincent's hit list. Meanwhile, LAPD narcotics detective, Ray Fanning, and ultimately the FBI get involved when Vincent's first victim is associated with a case in which Ray is working undercover. Ray is able to piece together information which makes him hot on Max and Vincent's tail."},
{"Title": "Traffic", "Year": "2000", "Genre": "Crime, Drama, Thriller", "Rating": "7.6", "Plot": "An intertwined drama about the United States' war on drugs, seen through the eyes of a once conservative judge, now newly-appointed drug czar, his crack-addicted daughter, two DEA agents, a jailed drug kingpin's wife, and a Mexican cop who begins to question his boss's motives."},
{"Title": "RoboCop", "Year": "1987", "Genre": "Action, Crime, Sci-Fi", "Rating": "7.5", "Plot": "Detroit - in the future - is crime-ridden and run by a massive company. The company has developed a huge crime-fighting robot, which unfortunately develops a rather dangerous glitch. The company sees a way to get back in favor with the public when policeman Alex Murphy is killed by a street gang. Murphy's body is reconstructed within a steel shell and called RoboCop. RoboCop is very successful against criminals and becomes a target of supervillian Boddicker."},
{"Title": "Payback", "Year": "1999", "Genre": "Action, Crime, Drama", "Rating": "7.1", "Plot": "Porter is bad, but his neighbours are worse. Street-wise and tough, an ex-marine, he is betrayed by a one-time partner, and shot in the back by his junkie wife. He survives and returns, looking to recover his share from the robbery of an Asian crime gang. The money has passed into the hands of &quot;the Outfit&quot;, a slick gangster organisation that runs the city. He has to make his way through a world populated by heroin dealers, prostitutes, sado-masochists, gunmen and crooked cops, a place where torture is a way of life. His only friend is a former employer, a prostitute, and her loyalty is in question, given she now works for the Outfit. He makes good early progress, but then falls into the hands of Fairfax, the crime boss."},
{"Title": "True Romance", "Year": "1993", "Genre": "Crime, Drama, Romance", "Rating": "7.9", "Plot": "In Detroit, Clarence Worley goes to the movie theater alone on the day of his birthday to watch some movies. The gorgeous Alabama Whitman accidentally drops her popcorn on Clarence and they watch the movie together. Later they go to a diner for pie, and end up having a one night stand. In the morning, Alabama confesses that she is a call-girl hired to spend the night with him, but she has fallen in love with him. In the morning they get married and Clarence goes to the club where she worked to bring her some clothes. However, her pimp Drexl Spivey and his partner beat up Clarence and he reacts by killing them both. Clarence asks for Alabama's suitcase with her clothes and the other girls mistakenly give another one with cocaine. When Clarence discovers the mistake, he decides to travel with Alabama to the house of his friend, the aspiring actor Dick Ritchie, to sell the drug and travel to Mexico. He visits his father Clifford Worley and gives his address to him. But the Sicilian Mafia is the owner of the drug and a group of killers are sent to hunt down Clarnece and Alabama."},
{"Title": "O Brother, Where Art Thou?", "Year": "2000", "Genre": "Adventure, Comedy, Crime", "Rating": "7.8", "Plot": "Loosely based on Homer's &quot;Odyssey,&quot; the movie deals with the picaresque adventures of Ulysses Everett McGill and his companions Delmar and Pete in 1930s Mississipi. Sprung from a chain gang and trying to reach Everett's home to recover the buried loot of a bank heist they are confronted by a series of strange characters--among them sirens, a cyclops, bank robber George &quot;Baby Face&quot; Nelson (very annoyed by that nickname), a campaigning governor and his opponent, a KKK lynch mob, and a blind prophet who warns the trio that &quot;the treasure you seek shall not be the treasure you find.&quot;"},
{"Title": "Beverly Hills Cop", "Year": "1984", "Genre": "Action, Comedy, Crime", "Rating": "7.3", "Plot": "Detroit cop Axel Foley is delighted when he receives a surprise visit from his best friend Mikey Tandino, who lives in California. Not long after Mikey arrives in Detroit, Mikey is killed, right in front of Axel, by a man named Zack. Axel follows Zack to Beverly Hills, California, where Beverly Hills police department Lieutenant Andrew Bogomil assigns Detective Billy Rosewood and Rosewood's partner, Sergeant John Taggart, to keep an eye on Axel. Axel visits his friend Jenny Summers, who works in an art gallery. With Jenny's help, Axel discovers that Zack works for Jenny's boss, Victor Maitland, the man who owns the art gallery. Maitland is a drug kingpin who is using the gallery as a front, and Maitland had Zack kill Mikey after Maitland accused Mikey of stealing some of Maitland's bonds. With the help of Jenny, Billy, and Taggart, Axel does what he can to make sure Maitland and Zack won't kill any more people."},
{"Title": "North by Northwest", "Year": "1959", "Genre": "Adventure, Mystery, Thriller", "Rating": "8.3", "Plot": "Madison Avenue advertising man Roger Thornhill finds himself thrust into the world of spies when he is mistaken for a man by the name of George Kaplan. Foreign spy Philip Vandamm and his henchman Leonard try to eliminate him but when Thornhill tries to make sense of the case, he is framed for murder. Now on the run from the police, he manages to board the 20th Century Limited bound for Chicago where he meets a beautiful blond, Eve Kendall, who helps him to evade the authorities. His world is turned upside down yet again when he learns that Eve isn't the innocent bystander he thought she was. Not all is as it seems however, leading to a dramatic rescue and escape at the top of Mt. Rushmore."},
{"Title": "On the Waterfront", "Year": "1954", "Genre": "Crime, Drama, Thriller", "Rating": "8.2", "Plot": "Terry Malloy dreams about being a prize fighter, while tending his pigeons and running errands at the docks for Johnny Friendly, the corrupt boss of the dockers union. Terry witnesses a murder by two of Johnny's thugs, and later meets the dead man's sister and feels responsible for his death. She introduces him to Father Barry, who tries to force him to provide information for the courts that will smash the dock racketeers."},
{"Title": "Batman", "Year": "1989", "Genre": "Action, Adventure", "Rating": "7.6", "Plot": "Gotham City. Crime boss Carl Grissom (Jack Palance) effectively runs the town but there's a new crime fighter in town - Batman (Michael Keaton). Grissom's right-hand man is Jack Napier (Jack Nicholson), a brutal man who is not entirely sane... After falling out between the two Grissom has Napier set up with the Police and Napier falls to his apparent death in a vat of chemicals. However, he soon reappears as The Joker and starts a reign of terror in Gotham City. Meanwhile, reporter Vicki Vale (Kim Basinger) is in the city to do an article on Batman. She soon starts a relationship with Batman's everyday persona, billionaire Bruce Wayne."},
{"Title": "City of God", "Year": "2002", "Genre": "Crime, Drama", "Rating": "8.6", "Plot": "Brazil, 1960s, City of God. The Tender Trio robs motels and gas trucks. Younger kids watch and learn well...too well. 1970s: Li'l Zé has prospered very well and owns the city. He causes violence and fear as he wipes out rival gangs without mercy. His best friend Bené is the only one to keep him on the good side of sanity. Rocket has watched these two gain power for years, and he wants no part of it. Yet he keeps getting swept up in the madness. All he wants to do is take pictures. 1980s: Things are out of control between the last two remaining gangs...will it ever end? Welcome to the City of God."},
{"Title": "Die Hard 2", "Year": "1990", "Genre": "Action, Thriller", "Rating": "7.1", "Plot": "After the terrifying events in LA, John McClane (Willis) is about to go through it all again. A team of terrorists, led by Col. Stuart (Sadler) is holding the entire airport hostage. The terrorists are planning to rescue a drug lord from justice. In order to do so, they have seized control of all electrical equipment affecting all planes. With no runway lights available, all aircraft have to remain in the air, with fuel running low, McClane will need to be fast."},
{"Title": "Escape from New York", "Year": "1981", "Genre": "Action, Sci-Fi", "Rating": "7.2", "Plot": "In the future, crime is out of control and New York City's Manhattan is a maximum security prison. Grabbing a bargaining chip right out of the air, convicts bring down the President's plane in bad old Gotham. Gruff Snake Plissken, a one-eyed lone warrior new to prison life, is coerced into bringing the President, and his cargo, out of this land of undesirables."},
{"Title": "All the President's Men", "Year": "1976", "Genre": "Biography, Drama, History", "Rating": "8.0", "Plot": "In the run-up to the 1972 elections, Washington Post reporter Bob Woodward covers what seems to be a minor break-in at the Democratic Party National headquarters. He is surprised to find top lawyers already on the defense case, and the discovery of names and addresses of Republican fund organizers on the accused further arouses his suspicions. The editor of the Post is prepared to run with the story and assigns Woodward and Carl Bernstein to it. They find the trail leading higher and higher in the Republican Party, and eventually into the White House itself."},
{"Title": "Natural Born Killers", "Year": "1994", "Genre": "Crime, Drama", "Rating": "7.3", "Plot": "Mickey Knox and Mallory Wilson aren't your typical lovers - after killing her abusive father, they go on a road trip where, every time they stop somewhere, they kill pretty well everyone around them. They do however leave one person alive at every shootout to tell the story and they soon become a media sensation thanks to sensationalized reporting. Told in a highly visual style."}
]