[
{"Title": "Good Will Hunting", "Year": "1997", "Genre": "Drama", "Rating": "8.3", "Plot": "A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart."},
{"Title": "The Shawshank Redemption", "Year": "1994", "Genre": "Drama", "Rating": "9.3", "Plot": "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red."},
{"Title": "The Departed", "Year": "2006", "Genre": "Crime, Drama, Thriller", "Rating": "8.5", "Plot": "In South Boston, the state police force is waging war on Irish-American organized crime. Young undercover cop Billy Costigan is assigned to infiltrate the mob syndicate run by gangland chief Frank Costello. While Billy quickly gains Costello's confidence, Colin Sullivan, a hardened young criminal who has infiltrated the state police as an informer for the syndicate is rising to a position of power in the Special Investigation Unit. Each man becomes deeply consumed by their double lives, gathering information about the plans and counter-plans of the operations they have penetrated. But when it becomes clear to both the mob and the police that there is a mole in their midst, Billy and Colin are suddenly in danger of being caught and exposed to the enemy - and each must race to uncover the identity of the other man in time to save themselves. But is either willing to turn on their friends and comrades they've made during their long stints undercover?"},
{"Title": "Fight Club", "Year": "1999", "Genre": "Drama", "Rating": "8.8", "Plot": "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power. When the narrator is exposed to the hidden agenda of Tyler's fight club, he must accept the awful truth that Tyler may not be who he says he is."},
{"Title": "Rain Man", "Year": "1988", "Genre": "Drama", "Rating": "8.0", "Plot": "Charles Sanford &quot;Charlie&quot; Babbit is a self-centered Los Angeles-based automobile dealer/hustler/bookie who is at war with his own life. Charlie, as a young teenager, used his father's 1949 Buick convertible without permission and as a result, he went to jail for two days on account that his father reported it stolen. It is then that Charlie learns that his estranged father died and left him from his last will and testament a huge bed of roses and the car while the remainder will of $3 Million goes into a trust fund to be distributed to someone. Charlie seemed pretty angry by this and decides to look into this matter. It seems as if that &quot;someone&quot; is Raymond, Charlie's unknown brother, an autistic savant who lives in a world of his own, resides at the Walbrook Institute. Charlie then kidnaps Raymond and decides to take him on a lust for life trip to the west coast as a threat to get the $3 Million inheritance. Raymond's acts and nagging, including repeated talks of &quot;Abbott & Costello&quot;, &quot;Four minutes till Wapner&quot; and refusal to fly on an airline except Quantas drives Charlie insane... and out of his selfish world into a cross-country trek of pure love and understanding that these two both have."},
{"Title": "Gladiator", "Year": "2000", "Genre": "Action, Adventure, Drama", "Rating": "8.5", "Plot": "Maximus is a powerful Roman general, loved by the people and the aging Emperor, Marcus Aurelius. Before his death, the Emperor chooses Maximus to be his heir over his own son, Commodus, and a power struggle leaves Maximus and his family condemned to death. The powerful general is unable to save his family, and his loss of will allows him to get captured and put into the Gladiator games until he dies. The only desire that fuels him now is the chance to rise to the top so that he will be able to look into the eyes of the man who will feel his revenge."},
{"Title": "Forrest Gump", "Year": "1994", "Genre": "Drama, Romance", "Rating": "8.8", "Plot": "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone."},
{"Title": "Arrival", "Year": "2016", "Genre": "Drama, Mystery, Sci-Fi", "Rating": "7.9", "Plot": "Linguistics professor Louise Banks leads an elite team of investigators when gigantic spaceships touchdown in 12 locations around the world. As nations teeter on the verge of global war, Banks and her crew must race against time to find a way to communicate with the extraterrestrial visitors. Hoping to unravel the mystery, she takes a chance that could threaten her life and quite possibly all of mankind."},
{"Title": "Hacksaw Ridge", "Year": "2016", "Genre": "Biography, Drama, History", "Rating": "8.2", "Plot": "The true story of Desmond T. Doss, the conscientious objector who, at the Battle of Okinawa, won the Medal of Honor for his incredible bravery and regard for his fellow soldiers. We see his upbringing and how this shaped his views, especially his religious view and anti-killing stance. We see Doss's trials and tribulations after enlisting in the US Army and trying to become a medic. Finally, we see the hell on Earth that was Hacksaw Ridge."},
{"Title": "The Sixth Sense", "Year": "1999", "Genre": "Drama, Mystery, Thriller", "Rating": "8.1", "Plot": "Malcom Crowe (Bruce Willis)is a child psychologist who receives an award on the same night that he is visited by a very unhappy ex-patient. After this encounter, Crowe takes on the task of curing a young boy with the same ills as the ex-patient (Donnie Wahlberg) . This boy &quot;sees dead people&quot;. Crowe spends a lot of time with the boy much to the dismay of his wife (Olivia Williams). Cole's mom (Toni Collette) is at her wit's end with what to do about her son's increasing problems. Crowe is the boy's only hope."},
{"Title": "The Prestige", "Year": "2006", "Genre": "Drama, Mystery, Sci-Fi", "Rating": "8.5", "Plot": "In the end of the Nineteenth Century, in London, Robert Angier, his beloved wife Julia McCullough and Alfred Borden are friends and assistants of a magician. When Julia accidentally dies during a performance, Robert blames Alfred for her death and they become enemies. Both become famous and rival magicians, sabotaging the performance of the other on the stage. When Alfred performs a successful trick, Robert becomes obsessed trying to disclose the secret of his competitor with tragic consequences."},
{"Title": "Sicario", "Year": "2015", "Genre": "Action, Crime, Drama", "Rating": "7.6", "Plot": "When drug violence worsens on the USA Mexico border, the FBI sends an idealistic agent, Kate Macer (Emily Blunt) on a mission to eradicate a drug cartel responsible for a bomb that had killed members of her team."},
{"Title": "La La Land", "Year": "2016", "Genre": "Comedy, Drama, Music", "Rating": "8.1", "Plot": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart."},
{"Title": "Hell or High Water", "Year": "2016", "Genre": "Crime, Drama, Thriller", "Rating": "7.6", "Plot": "In Texas, after the death of his mother, the unemployed oil and gas worker Toby Howard is losing his ranch to the Texas Midlands Bank. Toby is divorced from his wife who lives with their two sons. When his brother Tanner Howard is released from the prison, they team up to rob agencies of the Texas Midlands Bank to raise money to pay the loan so that Toby may leave the real estate to his sons. Meanwhile the Texas Ranger Marcus Hamilton who is near retirement and his Indian descendant partner Alberto Parker try to anticipate the next move of the thieves."},
{"Title": "Seven Samurai", "Year": "1954", "Genre": "Adventure, Drama", "Rating": "8.7", "Plot": "A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village."},
{"Title": "The Green Mile", "Year": "1999", "Genre": "Crime, Drama, Fantasy", "Rating": "8.5", "Plot": "Death Row guards at a penitentiary, in the 1930's, have a moral dilemma with their job when they discover one of their prisoners, a convicted murderer, has a special gift."},
{"Title": "Donnie Darko", "Year": "2001", "Genre": "Drama, Sci-Fi, Thriller", "Rating": "8.1", "Plot": "Donnie Darko doesn't get along too well with his family, his teachers and his classmates; but he does manage to find a sympathetic friend in Gretchen, who agrees to date him. He has a compassionate psychiatrist, who discovers hypnosis is the means to unlock hidden secrets. His other companion may not be a true ally. Donnie has a friend named Frank - a large bunny which only Donnie can see. When an engine falls off a plane and destroys his bedroom, Donnie is not there. Both the event, and Donnie's escape, seem to have been caused by supernatural events. Donnie's mental illness, if such it is, may never allow him to find out for sure."},
{"Title": "The Truman Show", "Year": "1998", "Genre": "Comedy, Drama, Sci-Fi", "Rating": "8.1", "Plot": "In this movie, Truman is a man whose life is a fake one... The place he lives is in fact a big studio with hidden cameras everywhere, and all his friends and people around him, are actors who play their roles in the most popular TV-series in the world: The Truman Show. Truman thinks that he is an ordinary man with an ordinary life and has no idea about how he is exploited. Until one day... he finds out everything. Will he react?"},
{"Title": "The Legend of 1900", "Year": "1998", "Genre": "Drama, Music, Romance", "Rating": "8.1", "Plot": "1900. Danny Boodmann, a stoker on an American passenger liner, Virginian, finds a baby abandoned on the ship. He names the child Danny Boodmann T.D. Lemon Nineteen Hundred '1900' and raises the child as his own until his death in an accident on the ship. The child never leaves the ship and turns out to be a musical genius, especially when it comes to playing the piano. As an adult he befriends a trumpet player in the ship's band, Max Tooney. After several years on the ship Max leaves, and tells the story of 1900 to the owner of a music store."},
{"Title": "Full Metal Jacket", "Year": "1987", "Genre": "Drama, War", "Rating": "8.3", "Plot": "A two-segment look at the effect of the military mindset and war itself on Vietnam era Marines. The first half follows a group of recruits in boot camp under the command of the punishing Gunnery Sergeant Hartman. The second half shows one of those recruits, Joker, covering the war as a correspondent for Stars and Stripes, focusing on the Tet offensive."},
{"Title": "The Machinist", "Year": "2004", "Genre": "Drama, Thriller", "Rating": "7.7", "Plot": "Trevor Reznik is a machinist in a factory. An extreme case of insomnia has led to him not sleeping in a year, and his body withering away to almost nothing. He has an obsessive compulsion to write himself reminder notes and keep track of his dwindling weight, both scribbled on yellow stickies in his apartment. The only person he lets into his life in an emotional sense is Stevie, a prostitute, although he has an infatuation with Maria, a single mother waitress working in an airport diner. His co-workers don't associate with and mistrust him because of not knowing what is going on in his life that has led to his emaciated physical appearance. A workplace incident further alienates him with his coworkers, and in conjunction with some unfamiliar pieces of paper he finds in his apartment, Trevor believes that someone or some people - probably one or some of his coworkers - are out to get him, using a phantom employee named Ivan as their front. As Trevor goes on a search for evidence as to Ivan's schemes and whereabouts, Trevor may come to a true understanding of what has caused his insomnia."},
{"Title": "Crash", "Year": "2004", "Genre": "Crime, Drama, Thriller", "Rating": "7.8", "Plot": "Over a thirty-six hour period in Los Angeles, a handful of disparate people's lives intertwine as they deal with the tense race relations that belie life in the city. Among the players are: the Caucasian district attorney, who uses race as a political card; his Caucasian wife, who, having recently been carjacked by two black men, believes that her stereotypical views of non-whites is justified and cannot be considered racism; the two black carjackers who use their race both to their advantage and as an excuse; partnered Caucasian police constables, one who is a racist and uses his authority to harass non-whites, and the other who hates his partner because of those racist views, but who may have the same underlying values in his subconscious; a black film director and his black wife, who believes her husband doesn't support their black background enough, especially in light of an incident with the racist white cop; partnered police detectives and sometimes lovers, one Hispanic female and the other black male, the latter who is dealing with a drugged out mother that feels he isn't concerned enough about taking care of family; an East Asian man who is run over but who is hiding some valuable cargo in the back of his van; a Persian store owner, who feels he isn't getting satisfaction from American society when his store is robbed time and time again; and a Hispanic locksmith, who just wants to keep his family, especially his young daughter, safe in a seemingly unsafe world."},
{"Title": "Looper", "Year": "2012", "Genre": "Action, Crime, Drama", "Rating": "7.4", "Plot": "Joe is classified as a &quot;looper&quot;, a job in which his employers use time travel to send men from the future to be killed into the past, where Joe can properly dispose of their bodies. However, to tie up loose ends and erase the evidence of his ever being a looper, Joe knows that one day his future self will be sent back for him to kill. When this day comes, Joe's future self is prepared and escapes, and the two men struggle separately in the past trying to evade capture and attempting to fulfill their own personal agendas."},
{"Title": "Eternal Sunshine of the Spotless Mind", "Year": "2004", "Genre": "Drama, Romance, Sci-Fi", "Rating": "8.3", "Plot": "A man, Joel Barish, heartbroken that his girlfriend Clementine underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realizes that he still loves her, and may be too late to correct his mistake."},
{"Title": "The Notebook", "Year": "2004", "Genre": "Drama, Romance", "Rating": "7.9", "Plot": "In a nursing home, resident Duke reads a romance story for an old woman who has senile dementia with memory loss. In the late 1930s, wealthy seventeen year-old Allie Hamilton is spending summer vacation in Seabrook. Local worker Noah Calhoun meets Allie at a carnival and they soon fall in love with each other. One day, Noah brings Allie to an ancient house that he dreams of buying and restoring and they attempt to make love but get interrupted by their friend. Allie's parents do not approve of their romance since Noah belongs to another social class, and they move to New York with her. Noah writes 365 letters (A Year) to Allie, but her mother Anne Hamilton does not deliver them to her daughter. Three years later, the United States joins the World War II and Noah and his best friend Fin enlist in the army, and Allie works as an army nurse. She meets injured soldier Lon Hammond in the hospital. After the war, they meet each other again going on dates and then, Lon, who is wealthy and handsome, proposes. Meanwhile Noah buys and restores the old house and many people want to buy it. When Allie accidentally sees the photo of Noah and his house in a newspaper, she feels divided between her first love and her commitment with Lon. Meanwhile Duke stops reading to the old lady since his children are visiting him in the nursing home."},
{"Title": "One Flew Over the Cuckoo's Nest", "Year": "1975", "Genre": "Drama", "Rating": "8.7", "Plot": "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse."},
{"Title": "A Beautiful Mind", "Year": "2001", "Genre": "Biography, Drama", "Rating": "8.2", "Plot": "From the heights of notoriety to the depths of depravity, John Forbes Nash, Jr. experienced it all. A mathematical genius, he made an astonishing discovery early in his career and stood on the brink of international acclaim. But the handsome and arrogant Nash soon found himself on a painful and harrowing journey of self-discovery. After many years of struggle, he eventually triumphed over his tragedy, and finally - late in life - received the Nobel Prize."},
{"Title": "Bridge of Spies", "Year": "2015", "Genre": "Drama, History, Thriller", "Rating": "7.6", "Plot": "In the cold war, a lawyer, James B. Donovan is recruited by the CIA and involved in an intense negotiation mission to release and exchange a CIA U-2 spy-plane pilot, Francis G. Powers. The pilot was arrested alive after his plane was shot down by the Soviet Union during a mission and stays in the company of a KGB intelligence officer, Rudolf Abel, who was arrested for espionage in the US."},
{"Title": "Saving Private Ryan", "Year": "1998", "Genre": "Drama, War", "Rating": "8.6", "Plot": "Opening with the Allied invasion of Normandy on 6 June 1944, members of the 2nd Ranger Battalion under Cpt. Miller fight ashore to secure a beachhead. Amidst the fighting, two brothers are killed in action. Earlier in New Guinea, a third brother is KIA. Their mother, Mrs. Ryan, is to receive all three of the grave telegrams on the same day. The United States Army Chief of Staff, George C. Marshall, is given an opportunity to alleviate some of her grief when he learns of a fourth brother, Private James Ryan, and decides to send out 8 men (Cpt. Miller and select members from 2nd Rangers) to find him and bring him back home to his mother..."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."},
{"Title": "American Psycho", "Year": "2000", "Genre": "Crime, Drama", "Rating": "7.6", "Plot": "Patrick Bateman is handsome, well educated and intelligent. He is twenty-seven and living his own American dream. He works by day on Wall Street, earning a fortune to complement the one he was born with. At night he descends into madness, as he experiments with fear and violence."}
]