[
{"Title": "Apollo 13", "Year": "1995", "Genre": "Adventure, Drama, History", "Rating": "7.6", "Plot": "Based on the true story of the ill-fated 13th Apollo mission bound for the moon. Astronauts Lovell, Haise and Swigert were scheduled to fly Apollo 14, but are moved up to 13. It's 1970, and The US has already achieved their lunar landing goal, so there's little interest in this &quot;routine&quot; flight.. until that is, things go very wrong, and prospects of a safe return fade."},
{"Title": "Titanic", "Year": "1997", "Genre": "Drama, Romance", "Rating": "7.8", "Plot": "84 years later, a 100 year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning."},
{"Title": "Lincoln", "Year": "2012", "Genre": "Biography, Drama, History", "Rating": "7.4", "Plot": "In 1865, as the American Civil War winds inexorably toward conclusion, U.S. president Abraham Lincoln endeavors to achieve passage of the landmark constitutional amendment which will forever ban slavery from the United States. However, his task is a race against time, for peace may come at any time, and if it comes before the amendment is passed, the returning southern states will stop it before it can become law. Lincoln must, by almost any means possible, obtain enough votes from a recalcitrant Congress before peace arrives and it is too late. Yet the president is torn, as an early peace would save thousands of lives. As the nation confronts its conscience over the freedom of its entire population, Lincoln faces his own crisis of conscience -- end slavery or end the war."},
{"Title": "Thirteen Days", "Year": "2000", "Genre": "Drama, History, Thriller", "Rating": "7.3", "Plot": "In October, 1962, U-2 surveillance photos reveal that the Soviet Union is in the process of placing nuclear weapons in Cuba. These weapons have the capability of wiping out most of the Eastern and Southern United States in minutes if they become operational. President John F. Kennedy and his advisors must come up with a plan of action against the Soviets. Kennedy is determined to show that he is strong enough to stand up to the threat, and the Pentagon advises U.S. military strikes against Cuba--which could lead the way to another U.S. invasion of the island. However, Kennedy is reluctant to follow through, because a U.S. invasion could cause the Soviets to retaliate in Europe. A nuclear showdown appears to be almost inevitable. Can it be prevented?"},
{"Title": "Seabiscuit", "Year": "2003", "Genre": "Drama, History, Sport", "Rating": "7.3", "Plot": "It's the Depression, and everyone needs to hold onto a dream to get them through the bad times. Car maker Charles Howard is no different, he who is trying to rebuild his life after the tragic death of his only child and the resulting end of his first marriage. With second wife Marcela at his side, Charles wants to get into horse racing and ends up with a team of underdogs who are also chasing their own dream. The first is trainer Tom Smith, who has a natural instinct to spot the capabilities of horses. The second is the horse Tom chooses for Charles, Seabiscuit, an unconventional choice as despite his pedigreed lineage, Seabiscuit is small at fifteen and a half hands tall with a slight limp. But Tom can see something in Seabiscuit's nature to make him a winner, if only Seabiscuit can be retrained from his inbred losing ways. And third is the jockey they decide to hire, Johnny &quot;Red&quot; Pollard, so nicknamed because of his hair color. Like Tom, Red has always shown a natural way with horses, but a difficult upbringing due solely to the Depression has made Red an angry young man, which has gotten him into trouble both on and off the track. And he is large for a jockey, and thus he always feels the need to battle the weight issue. Another common trait between Tom, Seabiscuit and Red is that they have been called crazy by those in traditional horse racing circles. Against the odds, Seabiscuit, with his human team behind him, does show his winning abilities and captures the imagination of all those others wanting to believe in a dream. But Seabiscuit's victories are at smaller races. As such, Charles aims high and wants Seabiscuit to race Triple Crown winner War Admiral, who by all accounts is a winner and should be a winner. If given the chance to race against War Admiral (whose owner doesn't want to race as he feels he has nothing to prove), will Seabiscuit and his team continue to keep the dreams of the common Americans alive? Through the good and the bad, especially as Red and Seabiscuit face mirroring problems, they all have to decide what is in their collective best interest."},
{"Title": "Hotel Rwanda", "Year": "2004", "Genre": "Biography, Drama, History", "Rating": "8.1", "Plot": "During the 1990s, some of the worst atrocities in the history of mankind took place in the country of Rwanda--and in an era of high-speed communication and round the clock news, the events went almost unnoticed by the rest of the world. In only three months, one million people were brutally murdered. In the face of these unspeakable actions, inspired by his love for his family, an ordinary man summons extraordinary courage to save the lives of over a thousand helpless refugees, by granting them shelter in the hotel he manages."},
{"Title": "The Count of Monte Cristo", "Year": "2002", "Genre": "Action, Adventure, Drama", "Rating": "7.8", "Plot": "'The Count of Monte Cristo' is a remake of the Alexander Dumas tale by the same name. Dantes, a sailor who is falsely accused of treason by his best friend Fernand, who wants Dantes' girlfriend Mercedes for himself. Dantes is imprisoned on the island prison of Chateau d'If for 13 years, where he plots revenge against those who betrayed him. With the help of another prisoner, he escapes the island and proceeds to transform himself into the wealthy Count of Monte Cristo as part of his plan to exact revenge."},
{"Title": "The Duchess", "Year": "2008", "Genre": "Biography, Drama, History", "Rating": "6.9", "Plot": "Georgiana Spencer became Duchess of Devonshire on her marriage to the Duke in 1774, at the height of the Georgian period, a period of fashion, decadence, and political change. Spirited and adored by the public at large she quickly found her marriage to be a disappointment, defined by her duty to produce a male heir and the Duke's philandering and callous indifference to her. She befriends Lady Bess but finds she is once again betrayed by her husband who wields his power with the three eventually living uncomfortably together. Against this background, and with the pressures of an unfaithful husband, strict social pressures and constant public scrutiny, Georgiana falls passionately in love with Charles Grey, a rising young Whig politician. However, despite his ongoing liaison with Lady Bess, the Duke refuses to allow her to continue the affair and threatens to take her children from her."},
{"Title": "The Tuskegee Airmen", "Year": "1995", "Genre": "Drama, History, War", "Rating": "7.2", "Plot": "During the Second World War, a special project is begun by the US Army Air Corps to integrate African American pilots into the Fighter Pilot Program. Known as the &quot;Tuskegee Airman&quot; for the name of the airbase at which they were trained, these men were forced to constantly endure harassement, prejudice, and much behind the scenes politics until at last they were able to prove themselves in combat."},
{"Title": "Australia", "Year": "2008", "Genre": "Adventure, Drama, Romance", "Rating": "6.6", "Plot": "In northern Australia at the beginning of World War II, an English aristocrat inherits a cattle station the size of Maryland. When English cattle barons plot to take her land, she reluctantly joins forces with a rough-hewn stock-man to drive 2,000 head of cattle across hundreds of miles of the country's most unforgiving land, only to still face the bombing of Darwin, Australia, by the Japanese forces that had attacked Pearl Harbor only months earlier."},
{"Title": "Invictus", "Year": "2009", "Genre": "Biography, Drama, History", "Rating": "7.4", "Plot": "The film tells the inspiring true story of how Nelson Mandela joined forces with the captain of South Africa's rugby team to help unite their country. Newly elected President Mandela knows his nation remains racially and economically divided in the wake of apartheid. Believing he can bring his people together through the universal language of sport, Mandela rallies South Africa's rugby team as they make their historic run to the 1995 Rugby World Cup Championship match."},
{"Title": "The Social Network", "Year": "2010", "Genre": "Biography, Drama", "Rating": "7.7", "Plot": "On a fall night in 2003, Harvard undergrad and computer programming genius Mark Zuckerberg sits down at his computer and heatedly begins working on a new idea. In a fury of blogging and programming, what begins in his dorm room soon becomes a global social network and a revolution in communication. A mere six years and 500 million friends later, Mark Zuckerberg is the youngest billionaire in history... but for this entrepreneur, success leads to both personal and legal complications."},
{"Title": "Red Tails", "Year": "2012", "Genre": "Action, Adventure, Drama", "Rating": "5.9", "Plot": "Italy, 1944. As the war takes its toll on Allied forces in Europe, a squadron of black pilots known as the Tuskegee Airmen are finally given the chance to prove themselves in the sky - even as they battle discrimination on the ground. It's a tribute to the unsung heroes who rose above extraordinary challenges and ultimately soared into history."},
{"Title": "Marie Antoinette", "Year": "2006", "Genre": "Biography, Drama, History", "Rating": "6.4", "Plot": "&quot;All eyes will be on you,&quot; says the Austrian Empress, Maria Theresa to her youngest daughter Marie Antoinette. The film, marketed for a teen audience, is an impressionistic retelling of Marie Antoinette's life as a young queen in the opulent and eccentric court at Versailles. The film focuses on Marie Antoinette, as she matures from a teenage bride to a young woman and eventual queen of France."},
{"Title": "Les Misérables", "Year": "2012", "Genre": "Drama, History, Musical", "Rating": "7.6", "Plot": "Jean Valjean, known as Prisoner 24601, is released from prison and breaks parole to create a new life for himself while evading the grip of the persistent Inspector Javert. Set in post-revolutionary France, the story reaches resolution against the background of the June Rebellion."},
{"Title": "Flyboys", "Year": "2006", "Genre": "Action, Adventure, Drama", "Rating": "6.5", "Plot": "Before the United States enters World War I, some American youths volunteer for the French military. Subsequently, they become the first U.S. fighter pilots and form a squadron known as the Lafayette Escadrille, whose exploits and heroism become the stuff of legend. This fictional version follows a laconic Texas rancher, an eager Nebraska kid, a Black boxer already in France, and a New York swell, as they arrive green for training, get their baptism by fire when German planes ambush them on their first mission, and graduate to heroics. Rawlings, the Texan, falls in love with a young woman he meets at a brothel."},
{"Title": "Man on Wire", "Year": "2008", "Genre": "Documentary, Biography", "Rating": "7.8", "Plot": "On August 7, 1974, Philippe Petit, a French wire walker, juggler, and street performer days shy of his 25th birthday, spent 45 minutes walking, dancing, kneeling, and lying on a wire he and friends strung between the rooftops of the Twin Towers. Uses contemporary interviews, archival footage, and recreations to tell the story of his previous walks between towers of Notre Dame and of the Sydney Harbour Bridge, his passions and friendships, and the details of the night before the walk: getting cable into the towers, hiding from guards, and mounting the wire. It ends with observations of the profound changes the walk's success brought to Philippe and those closest to him."},
{"Title": "Elizabeth: The Golden Age", "Year": "2007", "Genre": "Biography, Drama, History", "Rating": "6.9", "Plot": "Two faiths, two empires, two rulers - colliding in 1588. Papist Spain wants to bring down the heretic Elizabeth. Philip is building an armada but needs a rationale to attack. With covert intrigue, Spain sets a trap for the Queen and her principal secretary, Walsingham, using as a pawn Elizabeth's cousin Mary Stuart, who's under house arrest in the North. The trap springs, and the armada sets sail, to rendezvous with French ground forces and to attack. During these months, the Virgin Queen falls in love with Walter Raleigh, keeping him close to court and away from the sea and America. Is treachery or heroism at his heart? Does loneliness await her passionate majesty?"},
{"Title": "Little Big Man", "Year": "1970", "Genre": "Adventure, Comedy, Drama", "Rating": "7.6", "Plot": "Jack Crabb is 121 years old as the film begins. A collector of oral histories asks him about his past. He recounts being captured and raised by indians, becoming a gunslinger, marrying an indian, watching her killed by General George Armstrong Custer, and becoming a scout for him at Little Big Horn."},
{"Title": "Flight 93", "Year": "2006", "Genre": "Action, Crime, Drama", "Rating": "6.3", "Plot": "On September 11th 2001, four domestic flights are hijacked by terrorists in the United States of America. After the collision of three against selected targets, the passengers and crew of United Airlines Flight 93 fight against four terrorists to take back the control of the airplane."},
{"Title": "Gods and Generals", "Year": "2003", "Genre": "Biography, Drama, History", "Rating": "6.3", "Plot": "The rise and fall of legendary war hero Thomas &quot;Stonewall&quot; Jackson as he leads the Confederacy to great success against the Union from 1861 to 1863."},
{"Title": "The New World", "Year": "2005", "Genre": "Biography, Drama, History", "Rating": "6.7", "Plot": "Captain Smith is spared his mutinous hanging sentence after captain Newport's ship arrives in 1607 to found Jamestown, an English colony in Virginia. The initially friendly natives, who have no personal property concept, turn hostile after a 'theft' is 'punished' violently on the spot. During an armed exploration, Smith is captured, but spared when the chief's favorite daughter Pocahontas pleads for the stranger who soon becomes her lover and learns to love their naive 'savage' way of harmonious life. Ultimately he returns to the grim fort, which would starve hadn't she arranged for Indian generosity. Alas, each side soon brands their own lover a traitor, so she is banished and he flogged as introduction to slavish toiling. Changes turn again, leading Smith to accept a northern-more mission and anglicized Pocahontas, believing him dead, becoming the mother of aristocratic new lover John Rolfe's son. They'll meet again for a finale in England."},
{"Title": "Shattered Glass", "Year": "2003", "Genre": "Drama, History", "Rating": "7.2", "Plot": "This film tells the true story of fraudulent Washington, D.C. journalist Stephen Glass (Christensen), who rose to meteoric heights as a young writer in his 20s, becoming a staff writer at &quot;The New Republic&quot; for three years (1995-1998), where 27 of his 41 published stories were either partially or completely made up. Looking for a short cut to fame, Glass concocted sources, quotes and even entire stories, but his deception did not go unnoticed forever, and eventually, his world came crumbling down..."},
{"Title": "World Trade Center", "Year": "2006", "Genre": "Drama, History, Thriller", "Rating": "6.0", "Plot": "On September, 11th 2001, after the terrorist attack to the World Trade Center, the building collapses over the rescue team from the Port Authority Police Department. Will Jimeno and his sergeant John McLoughlin are found alive trapped under the wreckage while the rescue teams fight to save them."},
{"Title": "Matewan", "Year": "1987", "Genre": "Drama, History", "Rating": "7.9", "Plot": "Mingo County, West Virginia, 1920. Coal miners, struggling to form a union, are up against company operators and the gun thugs of the notorious Baldwin-Felts detective agency. Black and Italian miners, brought in by the company to break the strike, are caught between the two forces. UMWA organizer and dual-card Wobbly Joe Kenehan determines to bring the local, Black, and Italian groups together. While Kenehan and his story are fictional, the setting and the dramatic climax are historical; Sid Hatfield, Cabell C. Testerman, C. E. Lively and the Felts brothers were real-life participants, and 'Few Clothes' is based on a character active several years previously."},
{"Title": "The Newton Boys", "Year": "1998", "Genre": "Action, Crime, Drama", "Rating": "6.0", "Plot": "Four Newton brothers are a poor farmer family in the 1920s. The oldest of them, Willis, one day realizes that there's no future in the fields and offers his brothers to become a bank robbers. Soon the family agrees. They become very famous robbers, and five years later execute the greatest train robbery in American history."},
{"Title": "Kundun", "Year": "1997", "Genre": "Biography, Drama, History", "Rating": "7.0", "Plot": "The Tibetans refer to the Dalai Lama as 'Kundun', which means 'The Presence'. He was forced to escape from his native home, Tibet, when communist China invaded and enforced an oppressive regime upon the peaceful nation of Tibet. The Dalai Lama escaped to India in 1959 and has been living in exile in Dharamsala ever since."},
{"Title": "The Other Boleyn Girl", "Year": "2008", "Genre": "Biography, Drama, History", "Rating": "6.7", "Plot": "A sumptuous and sensual tale of intrigue, romance and betrayal set against the backdrop of a defining moment in European history: two beautiful sisters, Anne and Mary Boleyn, driven by their family's blind ambition, compete for the love of the handsome and passionate King Henry VIII."},
{"Title": "The Lady and the Duke", "Year": "2001", "Genre": "Drama, History, Romance", "Rating": "6.9", "Plot": "An episodic look at Grace Elliott (1760-1823) and Philippe, the Duke of Orleans, during the French Revolution. In 1790, they are friends, no longer lovers. He suggests she leave France, she warns him to quit the Revolution. In 1792, she must escape Paris on foot. Less than a month later, she returns on an errand of mercy and shows great courage saving the governor of Tuileries. The Duke in turn steps in to protect Grace. In early 1793, she demands a promise from the Duke that he vote to spare Louis's life; he does not, and Grace is furious. In April, he warns her of a search; she is arrested and brought before the committee. Orleans, too, is suspect. The guillotine awaits."},
{"Title": "Project Nim", "Year": "2011", "Genre": "Documentary", "Rating": "7.4", "Plot": "From the Oscar-winning team behind MAN ON WIRE comes the story of Nim, the chimpanzee who in the 1970s became the focus of a landmark experiment which aimed to show that an ape could learn to communicate with language if raised and nurtured like a human child. Following Nim's extraordinary journey through human society, and the enduring impact he makes on the people he meets along the way, the film is an unflinching and unsentimental biography of an animal we tried to make human. What we learn about his true nature - and indeed our own - is comic, revealing and profoundly unsettling."},
{"Title": "Sicko", "Year": "2007", "Genre": "Documentary, Drama", "Rating": "8.0", "Plot": "Documentary look at health care in the United States as provided by profit-oriented health maintenance organizations (HMOs) compared to free, universal care in Canada, the U.K., and France. Moore contrasts U.S. media reports on Canadian care with the experiences of Canadians in hospitals and clinics there. He interviews patients and doctors in the U.K. about cost, quality, and salaries. He examines why Nixon promoted HMOs in 1971, and why the Clintons' reform effort failed in the 1990s. He talks to U.S. ex-pats in Paris about French services, and he takes three 9/11 clean-up volunteers, who developed respiratory problems, to Cuba for care. He asks of Americans, &quot;Who are we?&quot;"},
{"Title": "Little Big Man", "Year": "1970", "Genre": "Adventure, Comedy, Drama", "Rating": "7.6", "Plot": "Jack Crabb is 121 years old as the film begins. A collector of oral histories asks him about his past. He recounts being captured and raised by indians, becoming a gunslinger, marrying an indian, watching her killed by General George Armstrong Custer, and becoming a scout for him at Little Big Horn."},
{"Title": "Christopher Columbus: The Discovery", "Year": "1992", "Genre": "Adventure, Biography, Drama", "Rating": "4.4", "Plot": "Genoan navigator Christopher Columbus has a dream to find an alternative route to sail to the Indies, by traveling west instead of east, across the unchartered Ocean sea. After failing to find backing from the Portugese, he goes to the Spanish court to ask Queen Isabella and King Ferdinand for help. After surviving a grilling from the Head of the Spanish Inquisition Tomas de Torquemada, he eventually gets the blessing from Queen Isabella and sets sail in three ships to travel into the unknown. Along the way he must deal with sabotage from Portugese spies and mutiny from a rebellious crew."},
{"Title": "Of Gods and Men", "Year": "2010", "Genre": "Drama, History", "Rating": "7.2", "Plot": "In 1996, in Algeria, eight French monks of The Monastery Notre-Dame de l'Atlas of Tibhirine have a simple life serving the poor community that was raised around the monastery. During the Algerian Civil War, they are threatened by terrorists but they decide to stay in the country and not return to France."},
{"Title": "Endgame", "Year": "2011", "Genre": "Crime, Drama", "Rating": "7.7", "Plot": "Endgame is an original drama series centering on brilliant chess master, Arkady Balagan. Traumatized by the murder of his fiancée, Balagan has become a prisoner in his luxury Vancouver hotel, terrified to step outside. To pay his bill, Balagan starts solving mysteries - using an unlikely band of hotel employees and chess fanatics to do his legwork. Arrogant, brilliant and charismatic, the Russian-born Balagan uses the skills that made him chess champion of the world to solve the crimes that mystify others. He imagines events, interviews the living and the dead, and runs conflicting scenarios - all in his head. And we get to watch right along with him as he solves crimes that baffle the police. In Endgame, we see genius at work."},
{"Title": "Catch a Fire", "Year": "2006", "Genre": "Biography, Drama, History", "Rating": "6.7", "Plot": "A political thriller: the real-life story of a South African hero's journey to freedom. In the country's turbulent and divided times in the 1980s, Patrick Chamusso is an oil refinery foreman and soccer coach who is apolitical - until he and his wife Precious are jailed. Patrick is stunned into action against the country's oppressive reigning system, even as police Colonel Nic Vos further insinuates himself into the Chamussos' lives."},
{"Title": "Dear America: Letters Home from Vietnam", "Year": "1987", "Genre": "Documentary, History, War", "Rating": "7.9", "Plot": "A documentary featuring letters written by U.S. soldiers, sailors, airmen, and Marines during the Viet Nam War to their families and friends back home. Archive footage of the war and news coverage thereof augment the first-person 'narrative' by men and women who were in the war, some of whom did not survive it."},
{"Title": "The Agronomist", "Year": "2003", "Genre": "Documentary, Biography, History", "Rating": "7.5", "Plot": "A profile of Haitian radio journalist and human rights activist, Jean Dominique. It includes: historical footage of Haiti's vivid and tumultuous past; interviews with Dominique, himself and with Michele Montas--his heroic wife, life-long love, and extraordinary partner; and incorporates footage shot before Dominique's assassination on April 3, 2000."},
{"Title": "My Voyage to Italy", "Year": "1999", "Genre": "Documentary", "Rating": "8.3", "Plot": "&quot;I saw these movies. They had a powerful effect on me. You should see them.&quot; That's Martin Scorsese's message for this documentary. We meet his family on Elizabeth Street in New York; he's a third generation Italian with Sicilian roots. Starting in 1949, they watched movies on TV as well as in theaters, lots of Italian imports. Scorsese, with his narration giving a personal as well as a public context, shows extended clips of these movies. Films of Rossellini and De Sica fill part one; those of Visconti, Fellini, and Antonioni comprise part two. Scorsese takes time with emotion, style, staging, technique, political context, and cinematic influence. It's his movie family."},
{"Title": "Incident at Oglala", "Year": "1992", "Genre": "Documentary, History", "Rating": "7.6", "Plot": "On June 26, 1975, during a period of high tensions on the Pine Ridge reservation in South Dakota, two FBI agents were killed in a shootout with a group of Indians. Although several men were charged with killing the agents, only one, Leonard Peltier, was found guilty. This film describes the events surrounding the shootout and suggests that Peltier was unjustly convicted."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."},
{"Title": "The Sands of Time", "Year": "1998", "Genre": "Adventure, Drama", "Rating": "4.4", "Plot": "Diane, a young and attractive archaeologist, gets to know Dr. Neal Hogan in the secret archives at the Vatican. Both of them are interested in the great mystery that Diane's father, the famous scientist Dr. Shannon, must have uncovered in Africa -- because since that time her father has not been seen by a living soul. Nevertheless, Diane is absolutely convinced that her father is still alive: he was looking for the &quot;tower of the first born&quot;, which according to ancient records is supposed to lead to &quot;great wisdom&quot;. Ignoring her friends' warnings, Diane decides to travel off in search of her father and find the legendary tower. Also in search of the monument -- which has contained secret knowledge about space and time for millennia -- are a sheik's horde of wild desert riders, as well as a heavily-armed group of soldiers under the command of the brave officer Léon. Together with her protector Rashid, an mysterious prince of the desert and old friend of her father's whom she knows from her youth, Diane withstands great dangers, and finally comes face-to-face with her missing father..."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."},
{"Title": "Riding Giants", "Year": "2004", "Genre": "Documentary, History, Sport", "Rating": "7.9", "Plot": "A semiserious, often rollicking, multigenerational insider's look at the origins of surfing, the colorful and subversive birth of surf culture, and the mythology and lure of the big wave. This passionate and fluid film is without question the first authentic history of surfing from its humble Hawaiian beginnings to the big business it became to the still-rebellious universe it inhabits today. Riding Giants is a study in individuality and freedom, the pursuit and techniques of pure kinetic pleasure, and the risk taking and attitudes that characterize its leading figures. For some viewers, this is perhaps more than they ever wanted to know. But Peralta's detailed knowledge of the surfing lifestyle, its icons and locations, its boom and exploitation by the media, and the fascination it has held for young men for more than five decades is unparalleled and fuels this expedition for the expert and initiate alike. Closely chronicling the sometimes-life-and-death drama that big-wave riding entails, Riding Giants is an often-mesmerizing visual thrill ride. But the most appealing aspect of this often revelatory documentary is the realization that the man versus nature dialectic never ends; the search for the ultimate wave and the spiritual pinnacle can only be pursued but never reached."},
{"Title": "Man of Iron", "Year": "1981", "Genre": "Drama, History", "Rating": "7.5", "Plot": "A worker becomes a &quot;man of iron&quot; forged by experience, a son comes to terms with his father, a couple fall in love, a reporter searches for courage, and a nation undergoes historic change. In Warsaw in 1980, the Party sends Winkel, a weak, alcoholic TV hack, to Gdansk to dig up dirt on the shipyard strikers, particularly on Maciek Tomczyk, an articulate worker whose father was killed in the December 1970 protests. Posing as sympathetic, Winkel interviews people who know Tomczyk, including his detained wife, Agnieszka. Their narrations become flashbacks using actual news footage of 1968 and 1970 protests and of the later birth of free unions and Solidarity."},
{"Title": "Mr. Death: The Rise and Fall of Fred A. Leuchter, Jr.", "Year": "1999", "Genre": "Documentary, Biography", "Rating": "7.5", "Plot": "Documentary about Fred Leuchter, an engineer who became an expert on execution devices and was later hired by revisionist historian Ernst Zundel to &quot;prove&quot; that there were no gas chambers at Auschwitz. Leuchter published a controversial report confirming Zundel's position, which ultimately ruined his own career. Most of the footage is of Leuchter, puttering around execution facilities or chipping away at the walls of Auschwitz, but Morris also interviews various historians, associates, and neighbors."},
{"Title": "K-19: The Widowmaker", "Year": "2002", "Genre": "Drama, History, Thriller", "Rating": "6.7", "Plot": "The story of USSR's first nuclear ballistic submarine, which suffered a malfunction in its nuclear reactor on its maiden voyage in the North Atlantic in 1961. The submarine's crew, led by the unyielding Captain Alexi Vostrikov, races against time to prevent a Chernobyl-like nuclear disaster which threatens not only the lives of his crew, but has the potential to ignite a world war between the super powers."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."}
]