[
{"Title": "Halloween", "Year": "1978", "Genre": "Horror, Thriller", "Rating": "7.8", "Plot": "The year is 1963, the night: Halloween. Police are called to 43 Lampkin Ln. only to discover that 15 year old Judith Myers has been stabbed to death, by her 6 year-old brother, Michael. After being institutionalized for 15 years, Myers breaks out on the night before Halloween. No one knows, nor wants to find out, what will happen on October 31st 1978 besides Myers' psychiatrist, Dr. Loomis. He knows Michael is coming back to Haddonfield, but by the time the town realizes it, it'll be too late for many people."},
{"Title": "The Shining", "Year": "1980", "Genre": "Drama, Horror", "Rating": "8.4", "Plot": "Signing a contract, Jack Torrance, a normal writer and former teacher agrees to take care of a hotel which has a long, violent past that puts everyone in the hotel in a nervous situation. While Jack slowly gets more violent and angry of his life, his son, Danny, tries to use a special talent, the &quot;Shining&quot;, to inform the people outside about whatever that is going on in the hotel."},
{"Title": "The Exorcist", "Year": "1973", "Genre": "Horror", "Rating": "8.0", "Plot": "A visiting actress in Washington, D.C., notices dramatic and dangerous changes in the behavior and physical make-up of her 12-year-old daughter. Meanwhile, a young priest at nearby Georgetown University begins to doubt his faith while dealing with his mother's terminal sickness. And, book-ending the story, a frail, elderly priest recognizes the necessity for a show-down with an old demonic enemy."},
{"Title": "A Nightmare on Elm Street", "Year": "1984", "Genre": "Horror", "Rating": "7.5", "Plot": "On Elm Street, Nancy Thompson and a group of her friends including Tina Gray, Rod Lane and Glen Lantz are being tormented by a clawed killer in their dreams named Freddy Krueger. Nancy must think quickly, as Freddy tries to pick off his victims one by one. When he has you in your sleep, who is there to save you?"},
{"Title": "Psycho", "Year": "1960", "Genre": "Horror, Mystery, Thriller", "Rating": "8.5", "Plot": "Phoenix officeworker Marion Crane is fed up with the way life has treated her. She has to meet her lover Sam in lunch breaks and they cannot get married because Sam has to give most of his money away in alimony. One Friday Marion is trusted to bank $40,000 by her employer. Seeing the opportunity to take the money and start a new life, Marion leaves town and heads towards Sam's California store. Tired after the long drive and caught in a storm, she gets off the main highway and pulls into The Bates Motel. The motel is managed by a quiet young man called Norman who seems to be dominated by his mother."},
{"Title": "Alien", "Year": "1979", "Genre": "Horror, Sci-Fi", "Rating": "8.5", "Plot": "A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick up an SOS warning from a distant moon. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realizes that they are not alone on the spaceship when an alien stowaway is on the cargo ship."},
{"Title": "The Texas Chain Saw Massacre", "Year": "1974", "Genre": "Horror", "Rating": "7.5", "Plot": "En route to visit their grandfather's grave (which has apparently been ritualistically desecrated), five teenagers drive past a slaughterhouse, pick up (and quickly drop) a sinister hitch-hiker, eat some delicious home-cured meat at a roadside gas station, before ending up at the old family home... where they're plunged into a never-ending nightmare as they meet a family of cannibals who more than make up in power tools what they lack in social skills..."},
{"Title": "Friday the 13th", "Year": "1980", "Genre": "Horror, Mystery, Thriller", "Rating": "6.5", "Plot": "One summer at Camp Crystal Lake, a group of young counselors begin to get ready to lead campers. Unfortunately for the former, someone isn't happy about what's going on in the camp and enjoys playing kill the counselor. As bodies fall to the ground in the camp, no one is safe."},
{"Title": "Poltergeist", "Year": "1982", "Genre": "Horror, Thriller", "Rating": "7.4", "Plot": "A young family are visited by ghosts in their home. At first the ghosts appear friendly, moving objects around the house to the amusement of everyone, then they turn nasty and start to terrorise the family before they &quot;kidnap&quot; the youngest daughter."},
{"Title": "The Silence of the Lambs", "Year": "1991", "Genre": "Crime, Drama, Thriller", "Rating": "8.6", "Plot": "FBI trainee Clarice Starling works hard to advance her career, including trying to hide or put behind her West Virginia roots, of which if some knew would automatically classify her as being backward or white trash. After graduation, she aspires to work in the agency's Behavioral Science Unit under the leadership of Jack Crawford. While she is still a trainee, Crawford does ask her to question Dr. Hannibal Lecter, a psychiatrist imprisoned thus far for eight years in maximum security isolation for being a serial killer, he who cannibalized his victims. Clarice is able to figure out the assignment is to pick Lecter's brains to help them solve another serial murder case, that of someone coined by the media as Buffalo Bill who has so far killed five victims, all located in the eastern US, all young women who are slightly overweight especially around the hips, all who were drowned in natural bodies of water, and all who were stripped of large swaths of skin. She also figures that Crawford chose her as a woman to be able to trigger some emotional response from Lecter. After speaking to Lecter for the first time, she realizes that everything with him will be a psychological game with her having often to read between the very cryptic lines he provides. She has to decide how much she will play along as his request in return for talking to him is to expose herself emotionally to him. The case takes more dire turns when a sixth victim is discovered, this one from who they are able to retrieve a key piece of evidence if Lecter is being forthright as to its meaning. A potential seventh victim is high profile Catherine Martin, the daughter of Senator Ruth Martin, which places greater scrutiny on the case as they search for a hopefully still alive Catherine. Who may factor into what happens is Dr. Frederick Chilton, the warden at the prison, he an opportunist who sees the higher profile with Catherine, meaning a higher profile for himself if he can insert himself successfully into the proceedings."},
{"Title": "The Thing", "Year": "1982", "Genre": "Horror, Mystery, Sci-Fi", "Rating": "8.1", "Plot": "A US research station, Antarctica, early-winter 1982. The base is suddenly buzzed by a helicopter from the nearby Norwegian research station. They are trying to kill a dog that has escaped from their base. After the destruction of the Norwegian chopper the members of the US team fly to the Norwegian base, only to discover them all dead or missing. They do find the remains of a strange creature the Norwegians burned. The Americans take it to their base and deduce that it is an alien life form. After a while it is apparent that the alien can take over and assimilate into other life forms, including humans, and can spread like a virus. This means that anyone at the base could be inhabited by The Thing, and tensions escalate."},
{"Title": "Jaws", "Year": "1975", "Genre": "Adventure, Drama, Thriller", "Rating": "8.0", "Plot": "It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat."},
{"Title": "Scream", "Year": "1996", "Genre": "Horror, Mystery", "Rating": "7.2", "Plot": "1 year after her mother's death, Sydney Prescott (Neve Campbell), and her friends started experiencing some strange phone calls. They later learned the calls were coming from a crazed serial killer, in a white faced mask and a large black robe, looking for revenge. His phone calls usually consist of many questions, the main one being: Whats your favorite scary movie? Along with many scary movie trivia, ending with bloody pieces of innocent lives scattered around the small town of Woodsboro."},
{"Title": "Night of the Living Dead", "Year": "1968", "Genre": "Horror", "Rating": "7.9", "Plot": "Barbra and Johnny visit their father's grave in a remote cemetery when they are suddenly set upon by zombies. Barbra manages to get away and takes refuge in what seems to be an abandoned farm house. She is soon joined by Ben who stopped at the house in need of gas. Beset by the walking dead all around them Ben does his best to secure the doors and windows. The news reports are grim however with creatures returning to life everywhere. Barbra and Ben are surprised when they realize there are 5 people hiding out in the basement: Harry, Helen and Judy Cooper; and a young couple, Tom and Judy. Dissensions sets in almost immediately with Harry Cooper wanting to be in charge. As their situation deteriorates, their chances of surviving the night lessen minute by minute."},
{"Title": "It", "Year": "2017", "Genre": "Drama, Horror, Thriller", "Rating": "7.4", "Plot": "In the Town of Derry, the local kids are disappearing one by one, leaving behind bloody remains. In a place known as 'The Barrens', a group of seven kids are united by their horrifying and strange encounters with an evil clown and their determination to kill It."},
{"Title": "Carrie", "Year": "1976", "Genre": "Horror", "Rating": "7.4", "Plot": "It's nearing the end of the school year. High school senior Carrie White is a social outcast, largely due to being unwise to the ways of the world based on her upbringing. Her mother, Margaret White, is a religious fanatic, her extreme views primarily targeted against sex, which she believes is a sin. She even believes natural associated processes such as menstruation are a sin, about which she has refused to mention to Carrie. Mrs. White's beliefs were taken to that extreme largely because of her own failed marriage and her husband Ralph long ago having run off with another woman. The only adult authority figure who tries to help Carrie with her life is her phys ed teacher, Miss Collins, who is nonetheless warned not to get too close to go against how Mrs. White chooses to raise Carrie, Mrs. White whose beliefs are well known in the community. An impromptu event that happens among Carrie's phys ed classmates against her leads to her classmates being punished. One of those students, self absorbed Chris Hargensen, vows revenge against Carrie for that punishment, the method of the revenge associated to the phys ed class incident. Another student however, the popular Sue Snell, begins to feel sorry for Carrie. In wanting to help her get out of her shell, Sue asks her boyfriend, the equally popular Tommy Ross, to take Carrie to the senior prom instead of her. This move does not sit well with Mrs. White, who in her extreme view believes Carrie will fall prey to sin. All these competing issues lead to Carrie deciding on an impulse to use a newfound skill to free herself from the figurative chains that have long been placed around her, with tragic consequences."},
{"Title": "Dawn of the Dead", "Year": "2004", "Genre": "Action, Horror, Thriller", "Rating": "7.3", "Plot": "Ana goes home to her peaceful suburban residence, but she is unpleasantly surprised the morning that follows when her husband is brutally attacked by her zombified neighbor. In the chaos of her once picturesque neighborhood, Ana flees and stumbles upon a police officer named Kenneth, along with more survivors who decide that their best chances of survival would be found in the deserted Crossroads Shopping Mall. When supplies begin running low and other trapped survivors need help, the group comes to the realization that they cannot stay put forever at the Shopping Mall, and devise a plan to escape."},
{"Title": "The Omen", "Year": "1976", "Genre": "Horror", "Rating": "7.6", "Plot": "Robert and Katherine Thorn seem to have it all. They are happily married and he is the US Ambassador to Great Britain, but they want nothing more than to have children. When Katharine has a stillborn child, Robert is approached by a priest at the hospital who suggests that they take a healthy newborn whose mother has just died in childbirth. Without telling his wife he agrees. After relocating to London, strange events - and the ominous warnings of a priest - lead him to believe that the child he took from that Italian hospital is evil incarnate."},
{"Title": "Rosemary's Baby", "Year": "1968", "Genre": "Drama, Horror", "Rating": "8.0", "Plot": "Rosemary and Guy Woodhouse move into an apartment in an opulent but gothic building in Manhattan. Their landlord Edward &quot;Hutch&quot; Hutchins attempts to dissuade them from doing so: the building has an unsavory history. They discover that their neighbors are a very friendly elderly couple named Roman and Minnie Castevet, and Guy begins to spend a great deal of time with them. Strange things begin to happen: a young woman Rosemary meets in the laundry commits suicide, Rosemary has strange dreams and hears strange noises and Guy becomes remote and distant. Then Rosemary falls pregnant and begins to suspect that her neighbors have special plans for her child."},
{"Title": "The Evil Dead", "Year": "1981", "Genre": "Horror", "Rating": "7.5", "Plot": "Five college students take time off to spend a peaceful vacation in a remote cabin. A book and audio tape is discovered, and its evil is found to be powerful once the incantations are read out loud. The friends find themselves helpless to stop the evil as it takes them one by one, with only one survivor left with the evil dead and desperately tries to fight to live until morning."},
{"Title": "Hellraiser", "Year": "1987", "Genre": "Horror, Thriller", "Rating": "7.0", "Plot": "Clive Barker's feature directing debut graphically depicts the tale of a man and wife who move into an old house and discover a hideous creature - the man's half-brother, who is also the woman's former lover - hiding upstairs. Having lost his earthly body to a trio of S&M demons, the Cenobites, he is brought back into existence by a drop of blood on the floor. He soon forces his former mistress to bring him his necessary human sacrifices to complete his body... but the Cenobites won't be happy about this."},
{"Title": "The Ring", "Year": "2002", "Genre": "Horror, Mystery", "Rating": "7.1", "Plot": "Rachel Keller is a journalist investigating a videotape that may have killed four teenagers (including her niece). There is an urban legend about this tape: the viewer will die seven days after watching it. If the legend is correct, Rachel will have to run against time to save her son's and her own life."},
{"Title": "Child's Play", "Year": "1988", "Genre": "Horror, Thriller", "Rating": "6.6", "Plot": "When Charles Lee Ray needs to get quick escape from cop Mike Norris, he takes his soul and buries it into playful, seemingly good guy doll Chucky. Little does he know a little boy by the name of Andy Barclay will be the new owner of him soon-to-come. Charles confides in Andy while he commits numerous murders. Once the adults accept Andy's story as truth, it's too late."},
{"Title": "Pet Sematary", "Year": "1989", "Genre": "Horror, Thriller", "Rating": "6.6", "Plot": "The Creeds have just moved to a new house in the countryside. Their house is perfect, except for two things: the semi-trailers that roar past on the narrow road, and the mysterious cemetery in the woods behind the house. The Creed's neighbours are reluctant to talk about the cemetery, and for good reason too."},
{"Title": "Saw", "Year": "2004", "Genre": "Horror, Mystery, Thriller", "Rating": "7.6", "Plot": "Waking up in a undisclosed location in a unknown room two men, adam and gordon are trapped into a single room with a dead body. Given random tools with riddles hidnen around the room. Wondering who could have done this there are clues to who might of done it; the jigsaw killer. The question is not just who but why would a serial killer leave two men in a room. Both adam and gordon hiding secrets they must trust and work together to get out or die...can they survive jigsaws game or die trying?"},
{"Title": "Aliens", "Year": "1986", "Genre": "Action, Adventure, Sci-Fi", "Rating": "8.4", "Plot": "Fifty seven years after Ellen Ripley survived her disastrous ordeal, her escape vessel is recovered after drifting across the galaxy as she slept in cryogenic stasis. Back on Earth, nobody believed her story about the &quot;Aliens&quot; on the moon LV-426. After the &quot;Company&quot; orders the colony on LV-426 to investigate, however, all communication with the colony is lost. The Company enlists Ripley to aid a team of tough, rugged space marines on a rescue mission to the now partially terraformed moon to find out if there are aliens or survivors. As the mission unfolds, Ripley will be forced to come to grips with her worst nightmare, but even as she does, she finds that the worst is yet to come."},
{"Title": "The Sixth Sense", "Year": "1999", "Genre": "Drama, Mystery, Thriller", "Rating": "8.1", "Plot": "Malcom Crowe (Bruce Willis)is a child psychologist who receives an award on the same night that he is visited by a very unhappy ex-patient. After this encounter, Crowe takes on the task of curing a young boy with the same ills as the ex-patient (Donnie Wahlberg) . This boy &quot;sees dead people&quot;. Crowe spends a lot of time with the boy much to the dismay of his wife (Olivia Williams). Cole's mom (Toni Collette) is at her wit's end with what to do about her son's increasing problems. Crowe is the boy's only hope."},
{"Title": "28 Days Later...", "Year": "2002", "Genre": "Drama, Horror, Sci-Fi", "Rating": "7.6", "Plot": "Animal activists invade a laboratory with the intention of releasing chimpanzees that are undergoing experimentation, infected by a virus -a virus that causes rage. The naive activists ignore the pleas of a scientist to keep the cages locked, with disastrous results. Twenty-eight days later, our protagonist, Jim, wakes up from a coma, alone, in an abandoned hospital. He begins to seek out anyone else to find London is deserted, apparently without a living soul. After finding a church, which had become inhabited by zombie like humans intent on his demise, he runs for his life. Selena and Mark rescue him from the horde and bring him up to date on the mass carnage and horror as all of London tore itself apart. This is a tale of survival and ultimately, heroics, with nice subtext about mankind's savage nature."},
{"Title": "Insidious", "Year": "2010", "Genre": "Horror, Mystery, Thriller", "Rating": "6.8", "Plot": "A gripping story of a family in search of help for their son, Dalton, who fell into a coma after a mysterious incident in the attic. Little do they know that there is much more to this endless sleep than meets the eye as they explore the paranormal, and rediscover the past; the key to getting their son back once and for all."},
{"Title": "Dawn of the Dead", "Year": "2004", "Genre": "Action, Horror, Thriller", "Rating": "7.3", "Plot": "Ana goes home to her peaceful suburban residence, but she is unpleasantly surprised the morning that follows when her husband is brutally attacked by her zombified neighbor. In the chaos of her once picturesque neighborhood, Ana flees and stumbles upon a police officer named Kenneth, along with more survivors who decide that their best chances of survival would be found in the deserted Crossroads Shopping Mall. When supplies begin running low and other trapped survivors need help, the group comes to the realization that they cannot stay put forever at the Shopping Mall, and devise a plan to escape."},
{"Title": "The Conjuring", "Year": "2013", "Genre": "Horror, Mystery, Thriller", "Rating": "7.5", "Plot": "In 1971, Carolyn and Roger Perron move their family into a dilapidated Rhode Island farm house and soon strange things start happening around it with escalating nightmarish terror. In desperation, Carolyn contacts the noted paranormal investigators, Ed and Lorraine Warren, to examine the house. What the Warrens discover is a whole area steeped in a satanic haunting that is now targeting the Perron family wherever they go. To stop this evil, the Warrens will have to call upon all their skills and spiritual strength to defeat this spectral menace at its source that threatens to destroy everyone involved."},
{"Title": "An American Werewolf in London", "Year": "1981", "Genre": "Comedy, Horror", "Rating": "7.6", "Plot": "Two American college students are on a walking tour of Britain and are attacked by a werewolf. One is killed, the other is mauled. The werewolf is killed but reverts to its human form, and the local townspeople are unwilling to acknowledge its existence. The surviving student begins to have nightmares of hunting on four feet at first but then finds that his friend and other recent victims appear to him, demanding that he commit suicide to release them from their curse, being trapped between worlds because of their unnatural deaths."},
{"Title": "The Amityville Horror", "Year": "2005", "Genre": "Drama, Horror, Mystery", "Rating": "6.0", "Plot": "In December 1975, George and Kathy Lutz along with their three children move into an elegant Long Island house. What they don't know is that the house was the site of a horrific mass murder a year before. They decide to keep the house and attempt to keep the horror in the past, but are now haunted by a murderous presence. This is until, George starts to behave weirdly and their daughter, Chelsea starts to see people. What follows is 28 days of sheer, unbridled terror for the family with demonic visions of the dead. Based on the true story of George and Kathy Lutz, The Amityville Horror remains one of the most horrifying haunted house stories ever told - because it actually happened."},
{"Title": "The Hills Have Eyes", "Year": "2006", "Genre": "Horror, Thriller", "Rating": "6.4", "Plot": "While celebrating their 50th wedding anniversary, a couple are caravanning through the desert with their 3 children, son in law and their baby granddaughter. While the rest of the family agrees there are plenty of better and more appropriate things to do to celebrate an anniversary, they make do with what they have, but things take a turn after a sketchy gas station attendant informs them about a &quot;short cut&quot; that will take them in between a series of hills in the desert. It doesn't take too long before they realise they're not alone and the hills indeed do have eyes."},
{"Title": "Misery", "Year": "1990", "Genre": "Crime, Drama, Thriller", "Rating": "7.8", "Plot": "Best-selling novelist Paul Sheldon is on his way home from his Colorado hideaway after completing his latest book, when he crashes his car in a freak blizzard. Paul is critically injured, but is rescued by former nurse Annie Wilkes, Paul's &quot;number one fan&quot;, who takes Paul back to her remote house in the mountains (without bothering to tell anybody). Unfortunately for Paul, Annie is also a headcase. When she discovers that Paul has killed off the heroine in her favorite novels, her reaction leaves Paul shattered (literally)..."},
{"Title": "Evil Dead II", "Year": "1987", "Genre": "Comedy, Horror", "Rating": "7.8", "Plot": "Ashley Williams travels to a secluded cabin in the woods with his girlfriend Linda where they find a tape recording of a professor and a book of evil. This unleashes a bunch of evil spirits that constantly terrorize Ash. Meanwhile a journalist comes to the area to study the book of evil. Ash and her end up having to survive this swarm of evil until morning comes."},
{"Title": "Candyman", "Year": "1992", "Genre": "Horror, Thriller", "Rating": "6.6", "Plot": "Helen Lyle is a student who decides to write a thesis about local legends and myths. She visits a part of the town, where she learns about the legend of the Candyman, a one-armed man who appears when you say his name five times, in front of a mirror. Of course, Helen doesn't believe all this stuff, but the people of the area are really afraid. When she ignores their warnings and begins her investigation in the places that he is rumored to appear, a series of horrible murders begins. Could the legend be true?"},
{"Title": "The Lost Boys", "Year": "1987", "Genre": "Comedy, Horror", "Rating": "7.3", "Plot": "A mother and her two sons move to a small coast town in California. The town is plagued by bikers and some mysterious deaths. The younger boy makes friends with two other boys who claim to be vampire hunters while the older boy is drawn into the gang of bikers by a beautiful girl. The older boy starts sleeping days and staying out all night while the younger boy starts getting into trouble because of his friends' obsession."},
{"Title": "Frankenstein", "Year": "1931", "Genre": "Drama, Horror, Sci-Fi", "Rating": "7.9", "Plot": "Henry Frankenstein is a doctor who is trying to discover a way to make the dead walk. He succeeds and creates a monster that has to deal with living again."},
{"Title": "The Birds", "Year": "1963", "Genre": "Drama, Horror, Mystery", "Rating": "7.7", "Plot": "Melanie Daniels is the modern rich socialite, part of the jet-set who always gets what she wants. When lawyer Mitch Brenner sees her in a pet shop, he plays something of a practical joke on her, and she decides to return the favor. She drives about an hour north of San Francisco to Bodega Bay, where Mitch spends the weekends with his mother Lydia and younger sister Cathy. Soon after her arrival, however, the birds in the area begin to act strangely. A seagull attacks Melanie as she is crossing the bay in a small boat, and then, Lydia finds her neighbor dead, obviously the victim of a bird attack. Soon, birds in the hundreds and thousands are attacking anyone they find out of doors. There is no explanation as to why this might be happening, and as the birds continue their vicious attacks, survival becomes the priority."},
{"Title": "Nosferatu", "Year": "1922", "Genre": "Fantasy, Horror", "Rating": "8.0", "Plot": "Wisbourg, Germany based estate agent Knock dispatches his associate, Hutter, to Count Orlok's castle in Transylvania as the Count wants to purchase an isolated house in Wisbourg. They plan on selling him the one across the way from Hutter's own home. Hutter leaves his innocent wife, Ellen, with some friends while he is away. Hutter's trek is an unusual one, with many locals not wanting to take him near the castle where strange events have been occurring. Once at the castle, Hutter does manage to sell the Count the house, but he also notices and feels unusual occurrences, primarily feeling like there is a dark shadow hanging over him, even in the daytime when the Count is unusually asleep. Hutter eventually sees the Count's sleeping chamber in a crypt, and based on a book he has recently read, believes the Count is really a vampire or Nosferatu. While Hutter is trapped in the castle, the Count, hiding in a shipment of coffins, makes his way to Wisbourg, causing death along his way, which most attribute to the plague. Hutter himself tries to rush home to save his town and most importantly save Ellen from Nosferatu's imminent arrival. In Wisbourg, Ellen can feel the impending darkness as Nosferatu gets closer. But she learns that a sinless woman can sacrifice herself to kill the vampire. Will Hutter be able to save Ellen either from Nosferatu and/or her self-sacrifice?"},
{"Title": "Children of the Corn", "Year": "1984", "Genre": "Horror, Thriller", "Rating": "5.6", "Plot": "A boy preacher named Isaac goes to a town in Nebraska called Gatlin and gets all the children to murder every adult in town. A young couple have a murder to report and they go to the nearest town (Gatlin) to seek help but the town seems deserted. They are soon trapped in Gatlin with little chance of getting out alive."},
{"Title": "Jeepers Creepers", "Year": "2001", "Genre": "Horror, Mystery", "Rating": "6.2", "Plot": "On their way back home during the spring break, Darry and Patricia Jenner witness a mysterious person dumping something down a tunnel. Deciding to discover what was dumped down there, Darry discovers a huge disturbing hideout full of modified bodies. Darry and Patricia set off to get help, unaware that the individual is now aware of who has been down the tunnel. Darry and Patricia soon realizes that their pursuer is not just a mysterious person, but something even more horrifying, who has more in store than they could possibly imagine."},
{"Title": "The Fly", "Year": "1986", "Genre": "Drama, Horror, Sci-Fi", "Rating": "7.5", "Plot": "Seth Brundle (Jeff Goldblum), a brilliant but eccentric scientist attempts to woo investigative journalist Veronica Quaife (Geena Davis) by offering her a scoop on his latest research in the field of matter transportation, which against all the expectations of the scientific establishment have proved successful. Up to a point. Brundle thinks he has ironed out the last problem when he successfully transports a living creature, but when he attempts to teleport himself a fly enters one of the transmission booths, and Brundle finds he is a changed man. This Science-Gone-Mad film is the source of the quotable quote &quot;Be afraid. Be very afraid.&quot;"},
{"Title": "Halloween II", "Year": "1981", "Genre": "Horror", "Rating": "6.6", "Plot": "In a continuation of the plot of Halloween, Michael Myers shows off his indestructability by resuming his murder spree despite being gunned down with six bullets in the original movie. Laurie Strode is once more his intended victim, with Dr. Sam Loomis again in hot pursuit."},
{"Title": "The Cabin in the Woods", "Year": "2012", "Genre": "Comedy, Horror", "Rating": "7.0", "Plot": "Five teenagers head off for a weekend at a secluded cabin in the woods. They arrive to find they are quite isolated with no means of communicating with the outside world. When the cellar door flings itself open, they of course go down to investigate. They find an odd assortment of relics and curios, but when one of the women, Dana, reads from a book, she awakens a family of deadly zombie killers. However, there's far more going on than meets the eye."},
{"Title": "Bram Stoker's Dracula", "Year": "1992", "Genre": "Horror", "Rating": "7.5", "Plot": "This version of Dracula is closely based on Bram Stoker's classic novel of the same name. A young lawyer (Jonathan Harker) is assigned to a gloomy village in the mists of eastern Europe. He is captured and imprisoned by the undead vampire Dracula, who travels to London, inspired by a photograph of Harker's betrothed, Mina Murray. In Britain, Dracula begins a reign of seduction and terror, draining the life from Mina's closest friend, Lucy Westenra. Lucy's friends gather together to try to drive Dracula away."},
{"Title": "The Blair Witch Project", "Year": "1999", "Genre": "Horror, Mystery", "Rating": "6.4", "Plot": "Three film students travel to Maryland to make a student film about a local urban legend... The Blair Witch. The three went into the woods on a two day hike to find the Blair Witch, and never came back. One year later, the students film and video were found in the woods. The footage was compiled and made into a movie. The Blair Witch Project."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."},
{"Title": "Fright Night", "Year": "2011", "Genre": "Comedy, Horror", "Rating": "6.4", "Plot": "A remake of the 1985 original, teenager Charley Brewster (Yelchin) guesses that his new neighbor Jerry Dandrige (Farrell) is a vampire responsible for a string of recent deaths. When no one he knows believes him, he enlists Peter Vincent (Tennant), a self proclaimed vampire killer and Las Vegas magician, to help him take down Jerry."},
{"Title": "The Others", "Year": "2001", "Genre": "Horror, Mystery, Thriller", "Rating": "7.6", "Plot": "A woman named Grace retires with her two children to a mansion on Jersey, towards the end of the Second World War, where she's waiting for her husband to come back from battle. The children have a disease which means they cannot be touched by direct sunlight without being hurt in some way. They will live alone there with oppressive, strange and almost religious rules, until she needs to hire a group of servants for them. Their arrival will accidentally begin to break the rules with unexpected consequences."}
]