[
{"Title": "Forrest Gump", "Year": "1994", "Genre": "Drama, Romance", "Rating": "8.8", "Plot": "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone."},
{"Title": "Titanic", "Year": "1997", "Genre": "Drama, Romance", "Rating": "7.8", "Plot": "84 years later, a 100 year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning."},
{"Title": "WALL·E", "Year": "2008", "Genre": "Animation, Adventure, Family", "Rating": "8.4", "Plot": "In a distant, but not so unrealistic, future where mankind has abandoned earth because it has become covered with trash from products sold by the powerful multi-national Buy N Large corporation, WALL-E, a garbage collecting robot has been left to clean up the mess. Mesmerized with trinkets of Earth's history and show tunes, WALL-E is alone on Earth except for a sprightly pet cockroach. One day, EVE, a sleek (and dangerous) reconnaissance robot, is sent to Earth to find proof that life is once again sustainable. WALL-E falls in love with EVE. WALL-E rescues EVE from a dust storm and shows her a living plant he found amongst the rubble. Consistent with her &quot;directive&quot;, EVE takes the plant and automatically enters a deactivated state except for a blinking green beacon. WALL-E, doesn't understand what has happened to his new friend, but, true to his love, he protects her from wind, rain, and lightning, even as she is unresponsive. One day a massive ship comes to reclaim EVE, but WALL-E, out of love or loneliness, hitches a ride on the outside of the ship to rescue EVE. The ship arrives back at a large space cruise ship, which is carrying all of the humans who evacuated Earth 700 years earlier. The people of Earth ride around this space resort on hovering chairs which give them a constant feed of TV and video chatting. They drink all of their meals through a straw out of laziness and/or bone loss, and are all so fat that they can barely move. When the auto-pilot computer, acting on hastily-given instructions sent many centuries before, tries to prevent the people of Earth from returning by stealing the plant, WALL-E, EVE, the portly captain, and a band of broken robots stage a mutiny."},
{"Title": "Casablanca", "Year": "1942", "Genre": "Drama, Romance, War", "Rating": "8.5", "Plot": "The story of Rick Blaine, a cynical world-weary ex-patriate who runs a nightclub in Casablanca, Morocco during the early stages of WWII. Despite the pressure he constantly receives from the local authorities, Rick's cafe has become a kind of haven for refugees seeking to obtain illicit letters that will help them escape to America. But when Ilsa, a former lover of Rick's, and her husband, show up to his cafe one day, Rick faces a tough challenge which will bring up unforeseen complications, heartbreak and ultimately an excruciating decision to make."},
{"Title": "Airplane!", "Year": "1980", "Genre": "Comedy", "Rating": "7.8", "Plot": "Still craving for the love of his life, Ted Striker follows Elaine onto the flight that she is working on as a member of the cabin crew. Elaine doesn't want to be with Ted anymore, but when the crew and passengers fall ill from food poisoning, all eyes are on Ted."},
{"Title": "The Princess Bride", "Year": "1987", "Genre": "Adventure, Family, Fantasy", "Rating": "8.1", "Plot": "An elderly man reads the book &quot;The Princess Bride&quot; to his sick and thus currently bedridden adolescent grandson, the reading of the book which has been passed down within the family for generations. The grandson is sure he won't like the story, with a romance at its core, he preferring something with lots of action and &quot;no kissing&quot;. But the grandson is powerless to stop his grandfather, whose feelings he doesn't want to hurt. The story centers on Buttercup, a former farm girl who has been chosen as the princess bride to Prince Humperdinck of Florian. Buttercup does not love him, she who still laments the death of her one true love, Westley, five years ago. Westley was a hired hand on the farm, his stock answer of &quot;as you wish&quot; to any request she made of him which she came to understand was his way of saying that he loved her. But Westley went away to sea, only to be killed by the Dread Pirate Roberts. On a horse ride to clear her mind of her upcoming predicament of marriage, Buttercup is kidnapped by a band of bandits: Vizzini who works on his wits, and his two associates, a giant named Fezzik who works on his brawn, and a Spaniard named Inigo Montoya, who has trained himself his entire life to be an expert swordsman. They in turn are chased by the Dread Pirate Roberts himself. But chasing them all is the Prince, and his men led by Count Tyrone Rugen. What happens to these collectives is dependent partly on Buttercup, who does not want to marry the Prince, and may see other options as lesser evils, and partly on the other motives of individuals within the groups. But a larger question is what the grandson will think of the story as it proceeds and at its end, especially as he sees justice as high a priority as action."},
{"Title": "Rocky", "Year": "1976", "Genre": "Drama, Sport", "Rating": "8.1", "Plot": "Rocky Balboa is a struggling boxer trying to make the big time, working as a debt collector for a pittance. When heavyweight champion Apollo Creed visits Philadelphia, his managers want to set up an exhibition match between Creed and a struggling boxer, touting the fight as a chance for a &quot;nobody&quot; to become a &quot;somebody&quot;. The match is supposed to be easily won by Creed, but someone forgot to tell Rocky, who sees this as his only shot at the big time."},
{"Title": "Unseen + Untold: National Lampoon's Animal House", "Year": "2003", "Genre": "Documentary", "Rating": "5.9", "Plot": "One 25th anniversary of one of the greatest comedies, the filmmakers and casts tell about their work on the cult classic: Animal House, a story about the dean of a college who is trying to kick the Delta House, a fraternity, out of school. However, the frat brothers of the house have other plans for him."},
{"Title": "Fast Times at Ridgemont High", "Year": "1982", "Genre": "Comedy, Drama", "Rating": "7.2", "Plot": "Follows a group of high school students growing up in southern California, based on the real-life adventures chronicled by Cameron Crowe. Stacy Hamilton and Mark Ratner are looking for a love interest, and are helped along by their older classmates, Linda Barrett and Mike Damone, respectively. The center of the film is held by Jeff Spicoli, a perpetually stoned surfer dude who faces off with the resolute Mr. Hand, who is convinced that everyone is on dope."},
{"Title": "There's Something About Mary", "Year": "1998", "Genre": "Comedy, Romance", "Rating": "7.1", "Plot": "Ted was a geek in high school, who was going to go to the prom with one of the most popular girls in school, Mary. The prom date never happened, because Ted had a very unusual accident. Thirteen years later he realizes he is still in love with Mary, so he hires a private investigator to track her down. That investigator discovers he too may be in love with Mary, so he gives Ted some false information to keep him away from her. But soon Ted finds himself back into Mary's life, as we watch one funny scene after another."},
{"Title": "Eternal Sunshine of the Spotless Mind", "Year": "2004", "Genre": "Drama, Romance, Sci-Fi", "Rating": "8.3", "Plot": "A man, Joel Barish, heartbroken that his girlfriend Clementine underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realizes that he still loves her, and may be too late to correct his mistake."},
{"Title": "American Pie", "Year": "1999", "Genre": "Comedy", "Rating": "7.0", "Plot": "Jim, Oz, Finch and Kevin are four friends who make a pact that before they graduate they will all lose their virginity. The hard job now is how to reach that goal by prom night. Whilst Oz begins singing to grab attention and Kevin tries to persuade his girlfriend, Finch tries any easy route of spreading rumors and Jim fails miserably. Whether it is being caught on top of a pie or on the Internet, Jim always ends up with his trusty sex advice from his father. Will they achieve their goal of getting laid by prom night? Or will they learn something much different?"},
{"Title": "The 40-Year-Old Virgin", "Year": "2005", "Genre": "Comedy, Romance", "Rating": "7.1", "Plot": "Andy at the age of 40 still hasn't had sex. He lets his secret slip at a poker game with his buds from work. After the revealing all his friends are on a mission to help get him laid. Along the way Andy meets a nice mom, Trish, and they fall head over heels for each other."},
{"Title": "Gone with the Wind", "Year": "1939", "Genre": "Drama, History, Romance", "Rating": "8.2", "Plot": "Scarlett is a woman who can deal with a nation at war, Atlanta burning, the Union Army carrying off everything from her beloved Tara, the carpetbaggers who arrive after the war. Scarlett is beautiful. She has vitality. But Ashley, the man she has wanted for so long, is going to marry his placid cousin, Melanie. Mammy warns Scarlett to behave herself at the party at Twelve Oaks. There is a new man there that day, the day the Civil War begins. Rhett Butler. Scarlett does not know he is in the room when she pleads with Ashley to choose her instead of Melanie."},
{"Title": "Annie Hall", "Year": "1977", "Genre": "Comedy, Romance", "Rating": "8.0", "Plot": "Alvy Singer, a forty year old twice divorced, neurotic, intellectual Jewish New York stand-up comic, reflects on the demise of his latest relationship, to Annie Hall, an insecure, flighty, Midwestern WASP aspiring nightclub singer. Unlike his previous relationships, Alvy believed he may have worked out all the issues in his life through fifteen years of therapy to make this relationship with Annie last, among those issues being not wanting to date any woman that would want to date him, and thus subconsciously pushing those women away. Alvy not only reviews the many ups and many downs of their relationship, but also reviews the many facets of his makeup that led to him starting to date Annie. Those facets include growing up next to Coney Island in Brooklyn, being attracted to the opposite sex for as long as he can remember, and enduring years of Jewish guilt with his constantly arguing parents."},
{"Title": "Groundhog Day", "Year": "1993", "Genre": "Comedy, Fantasy, Romance", "Rating": "8.0", "Plot": "A weather man is reluctantly sent to cover a story about a weather forecasting &quot;rat&quot; (as he calls it). This is his fourth year on the story, and he makes no effort to hide his frustration. On awaking the 'following' day he discovers that it's Groundhog Day again, and again, and again. First he uses this to his advantage, then comes the realisation that he is doomed to spend the rest of eternity in the same place, seeing the same people do the same thing EVERY day."},
{"Title": "Bram Stoker's Dracula", "Year": "1992", "Genre": "Horror", "Rating": "7.5", "Plot": "This version of Dracula is closely based on Bram Stoker's classic novel of the same name. A young lawyer (Jonathan Harker) is assigned to a gloomy village in the mists of eastern Europe. He is captured and imprisoned by the undead vampire Dracula, who travels to London, inspired by a photograph of Harker's betrothed, Mina Murray. In Britain, Dracula begins a reign of seduction and terror, draining the life from Mina's closest friend, Lucy Westenra. Lucy's friends gather together to try to drive Dracula away."},
{"Title": "Slumdog Millionaire", "Year": "2008", "Genre": "Drama, Romance", "Rating": "8.0", "Plot": "The story of Jamal Malik, an 18 year-old orphan from the slums of Mumbai, who is about to experience the biggest day of his life. With the whole nation watching, he is just one question away from winning a staggering 20 million rupees on India's Kaun Banega Crorepati? (2000) (Who Wants To Be A Millionaire?) But when the show breaks for the night, police arrest him on suspicion of cheating; how could a street kid know so much? Desperate to prove his innocence, Jamal tells the story of his life in the slum where he and his brother grew up, of their adventures together on the road, of vicious encounters with local gangs, and of Latika, the girl he loved and lost. Each chapter of his story reveals the key to the answer to one of the game show's questions. Each chapter of Jamal's increasingly layered story reveals where he learned the answers to the show's seemingly impossible quizzes. But one question remains a mystery: what is this young man with no apparent desire for riches really doing on the game show? When the new day dawns and Jamal returns to answer the final question, the Inspector and sixty million viewers are about to find out. At the heart of its storytelling lies the question of how anyone comes to know the things they know about life and love."},
{"Title": "American Beauty", "Year": "1999", "Genre": "Drama", "Rating": "8.4", "Plot": "After his death sometime in his forty-third year, suburbanite Lester Burnham tells of the last few weeks of his life, during which he had no idea of his imminent passing. He is a husband to real estate agent Carolyn Burnham and father to high school student Janie Burnham. Although Lester and Carolyn once loved each other, they now merely tolerate each other. Typical wallflower Janie too hates both her parents, the three who suffer individually in silence in their home life. Janie tries to steer clear of both her parents. Carolyn, relatively new to the real estate business, wants to create the persona of success to further her career, she aspiring to the professional life of Buddy Kane, the king of the real estate business in their neighborhood. Lester merely walks mindlessly through life, including at his job in advertising. His company is downsizing, and he, like all the other employees, has to justify his position to the newly hired efficiency expert to keep his job. Things change for Lester when he falls in love at first sight with Janie's more experienced classmate, Angela Hays. Both Janie and Angela can see Lester's sexual infatuation with Angela, who courts such attention from any man as a sign that she is model material, she having once appeared in Seventeen and it a career to which she aspires. Lester's infatuation with Angela gives him a reenergized view on life, where he openly doesn't care anymore what anyone thinks about what he does, anyone except Angela. This infatuation coincides with the Fittses moving in next door: homophobic disciplinarian US Marine Colonel Frank Fitts who rules the house with a military fist (that fist being both figurative and literal), his semi-comatose wife Barbara Fitts, and their bright and quietly subversive eighteen year old son Ricky Fitts, who openly abides by his father's rules while behind the scenes lives by his own quite different perspective. Much like Lester's infatuation, Ricky immediately becomes infatuated with Janie, he who considers girls like Angela as ordinary. The entry of Angela and the Fittses into the Burnhams' lives ultimately leads to each of the players confronting what is truly in his or her heart."},
{"Title": "Some Like It Hot", "Year": "1959", "Genre": "Comedy, Romance", "Rating": "8.3", "Plot": "When two Chicago musicians, Joe and Jerry, witness the the St. Valentine's Day massacre, they want to get out of town and get away from the gangster responsible, Spats Colombo. They're desperate to get a gig out of town but the only job they know of is in an all-girl band heading to Florida. They show up at the train station as Josephine and Daphne, the replacement saxophone and bass players. They certainly enjoy being around the girls, especially Sugar Kane Kowalczyk who sings and plays the ukulele. Joe in particular sets out to woo her while Jerry/Daphne is wooed by a millionaire, Osgood Fielding III. Mayhem ensues as the two men try to keep their true identities hidden and Spats Colombo and his crew show up for a meeting with several other crime lords."},
{"Title": "Twilight", "Year": "2008", "Genre": "Drama, Fantasy, Romance", "Rating": "5.2", "Plot": "Bella Swan has always been a little bit different. Never one to run with the crowd, Bella never cared about fitting in with the trendy, plastic girls at her Phoenix, Arizona high school. When her mother remarried and Bella chooses to live with her father in the rainy little town of Forks, Washington, she didn't expect much of anything to change. But things do change when she meets the mysterious and dazzlingly beautiful Edward Cullen. For Edward is nothing like any boy she's ever met. He's nothing like anyone she's ever met, period. He's intelligent and witty, and he seems to see straight into her soul. In no time at all, they are swept up in a passionate and decidedly unorthodox romance - unorthodox because Edward really isn't like the other boys. He can run faster than a mountain lion. He can stop a moving car with his bare hands. Oh, and he hasn't aged since 1918. Like all vampires, he's immortal. That's right - vampire. But he doesn't have fangs - that's just in the movies. And he doesn't drink human blood, though Edward and his family are unique among vampires in that lifestyle choice. To Edward, Bella is that thing he has waited 90 years for - a soul mate. But the closer they get, the more Edward must struggle to resist the primal pull of her scent, which could send him into an uncontrollable frenzy. Somehow or other, they will have to manage their unmanageable love. But when unexpected visitors come to town and realize that there is a human among them Edward must fight to save Bella? A modern, visual, and visceral Romeo and Juliet story of the ultimate forbidden love affair - between vampire and mortal."},
{"Title": "Wedding Crashers", "Year": "2005", "Genre": "Comedy, Romance", "Rating": "7.0", "Plot": "Two friends, John (played by Owen Wilson) and Jeremy (Vince Vaughn), crash weddings to pick up women. One day they crash the wedding of the daughter of the Treasury Secretary, Secretary Cleary (Christopher Walken). Instead of short-term flings they end up being invited to the Clearys' island estate, and potentially meet the loves of their lives..."},
{"Title": "The Graduate", "Year": "1967", "Genre": "Comedy, Drama, Romance", "Rating": "8.0", "Plot": "Ben has recently graduated from college, with his parents now expecting great things from him. At his &quot;Homecoming&quot; party, Mrs. Robinson, the wife of his father's business partner, has Ben drive her home, which leads to an affair between the two. The affair eventually ends, but comes back to haunt him when he finds himself falling for Elaine, Mrs. Robinson's daughter."},
{"Title": "Clueless", "Year": "1995", "Genre": "Comedy, Romance", "Rating": "6.8", "Plot": "Cher, a high school student in Beverly Hills, must survive the ups and downs of adolescent life. Her external demeanor at first seems superficial, but rather it hides her wit, charm, and intelligence which help her to deal with relationships, friends, family, school, and the all-important teenage social life."},
{"Title": "Anchorman: The Legend of Ron Burgundy", "Year": "2004", "Genre": "Comedy", "Rating": "7.2", "Plot": "In 1970s San Diego, journalism was a well respected profession and people actually cared about what they saw on TV. And the top rated anchor man in the city is Ron Burgundy. He enjoys his run at the top, and has for the last five years. And his news team is equally as good as he is. Professional jock and former professional baseball player Champ Kind handles the sports, the curiously dim witted Brick Tamland - who's a few channels short of a cable subscription - handles the weather, and ladies' man Brian Fantana - whose collection of fine scents would be in the Guinness Book Of Records - handles the on-field reporting. But now all that is about to change forever. The TV station Burgundy works for, Channel 4, has embraced diversity and has hired a beautiful new female anchor named Veronica Corningstone. While Ron Burgundy and the rest of the Channel 4 news team enjoys fighting with competitors, drinking, and flirting with the ladies, Veronica quietly climbs her way to the top. And Veronica's success drives Ron Burgundy crazy. So much that Veronica's meddling causes Ron to get demoted and ultimately lose his job with Channel 6. Now left with nothing, Ron must find a way to get back to the top - and that involves a story about a rare Chinese panda giving birth on US soil. Will Ron be the one to report the story on a national level?"},
{"Title": "Dirty Dancing", "Year": "1987", "Genre": "Drama, Music, Romance", "Rating": "6.9", "Plot": "In 1963, Frances &quot;Baby&quot; Houseman, a sweet daddy's girl, goes with her family to a resort in upstate New York's Catskill Mountains. Baby has grown up in privileged surroundings and all expect her to go on to college, join the Peace Corps and save the world before marrying a doctor, just like her father. Unexpectedly, Baby becomes infatuated with the camp's dance instructor, Johnny Castle, a man whose background is vastly different from her own. Baby lies to her father to get money to pay for an illegal abortion for Johnny's dance partner. She then fills in as Johnny's dance partner and it is as he is teaching her the dance routine that they fall in love. It all comes apart when Johnny's friend falls seriously ill after her abortion and Baby gets her father, who saves the girl's life. He then learns what Baby has been up to, who with and worse - that he funded the illegal abortion. He bans his daughter from any further association with &quot;those people&quot;. In the first deliberately willful action of her life, Baby later sneaks out to see Johnny - ostensibly to apologize for her father's rudeness - and ends up consummating her relationship with Johnny. A jealous fellow vacationer sees Baby sneaking out of Johnny's bungalow the next morning, and in an act of retribution, tells management that he is responsible for a theft the evening before, knowing he would not furnish his real whereabouts."},
{"Title": "Big", "Year": "1988", "Genre": "Comedy, Drama, Family", "Rating": "7.3", "Plot": "A young boy (David Moscow) makes a wish at a carnival machine to be big. He wakes up the following morning to find that it has been granted and his body has grown older overnight. But he is still the same 13-year-old boy inside. Now he must learn how to cope with the unfamiliar world of grown-ups including getting a job and having his first romantic encounter with a woman. What will he find out about this strange world?"},
{"Title": "Grease", "Year": "1978", "Genre": "Musical, Romance", "Rating": "7.2", "Plot": "A musical about teens in love in the 50's! It's California 1959 and greaser Danny Zuko and Australian Sandy Olsson are in love. They spend time at the beach, and when they go back to school, what neither of them knows is that they both now attend Rydell High. Danny's the leader of the T-Birds, a group of black leather jacket-wearing greasers while Sandy hangs with the Pink Ladies, a group of pink-wearing girls led by Rizzo. When they clash at Rydell's first pep rally, Danny isn't the same Danny from the beach. They try to be like each other so they can be together."},
{"Title": "Top Gun", "Year": "1986", "Genre": "Action, Drama, Romance", "Rating": "6.9", "Plot": "Lieutenant Pete &quot;Maverick&quot; Mitchell is an expert United States Naval Aviator. When he encounters a pair of MiGs over the Persian Gulf, his wingman is clearly outflown and freaks. On almost no fuel, Maverick is able to talk him back down to the carrier. When his wingman turns in his wings, Maverick is moved up in the standings and sent to the Top Gun Naval Flying School. There he fights the attitudes of the other pilots and an old story of his father's death in combat that killed others due to his father's error. Maverick struggles to be the best pilot, stepping on the toes of his other students and in another way to Charlie Blackwood, a civilian instructor to whom he is strongly attracted."},
{"Title": "The Karate Kid", "Year": "1984", "Genre": "Action, Drama, Family", "Rating": "7.2", "Plot": "Daniel and his mother move from New Jersey to California. She has a wonderful new job, but Daniel quickly discovers that a dark haired Italian boy with a Jersey accent doesn't fit into the blond surfer crowd. Daniel manages to talk his way out of some fights, but he is finally cornered by several who belong to the same karate school. As Daniel is passing out from the beating he sees Miyagi, the elderly gardener leaps into the fray and save him by outfighting half a dozen teenagers. Miyagi and Daniel soon find out the real motivator behind the boys' violent attitude in the form of their karate teacher. Miyagi promises to teach Daniel karate and arranges a fight at the all-valley tournament some months off. When his training begins, Daniel doesn't understand what he is being shown. Miyagi seems more interested in having Daniel paint fences and wax cars than teaching him Karate."},
{"Title": "The Naked Gun: From the Files of Police Squad!", "Year": "1988", "Genre": "Comedy, Crime", "Rating": "7.6", "Plot": "A re-run of many of the gags from the original TV series 'Police Squad'. An Airplane type spoof, this time with the an incompetent lieutenant (Drebin) who always 'gets his man'. Visual gags come thick and fast, and it's impossible to catch them all with one viewing. The plot.. Queen Elizabeth II of England is coming to town, and Vincent Ludwig has plans to assassinate her using a brainwashed baseball player."},
{"Title": "Juno", "Year": "2007", "Genre": "Comedy, Drama", "Rating": "7.5", "Plot": "A tale told over four seasons, starting in autumn when Juno, a 16-year-old high-school junior in Minnesota, discovers she's pregnant after one event in a chair with her best friend, Bleeker. In the waiting room of an abortion clinic, the quirky and whip-sharp Juno decides to give birth and to place the child with an adoptive couple. She finds one in the PennySaver personals, contacts them, tells her dad and step-mother, and carries on with school. The chosen parents, upscale yuppies (one of whom is cool and laid back, the other meticulous and uptight), meet Juno, sign papers, and the year unfolds. Will Juno's plan work, can she improvise, and what about Bleeker?"},
{"Title": "When Harry Met Sally...", "Year": "1989", "Genre": "Comedy, Drama, Romance", "Rating": "7.6", "Plot": "Harry and Sally meet when she gives him a ride to New York after they both graduate from the University of Chicago. The film jumps through their lives as they both search for love, but fail, bumping into each other time and time again. Finally a close friendship blooms between them, and they both like having a friend of the opposite sex. But then they are confronted with the problem: &quot;Can a man and a woman be friends, without sex getting in the way?&quot;"},
{"Title": "How the West Was Won", "Year": "1962", "Genre": "Western", "Rating": "7.1", "Plot": "Setting off on a journey to the west in the 1830s, the Prescott family run into a man named Linus, who helps them fight off a pack of thieves. Linus then marries daughter Eve Prescott (Carroll Baker), and 30 years later goes off to fight in the Civil War with their son, with bloody results. Eve's sister, Lily, heads farther west and has adventures with a professional gambler, stretching all the way to San Francisco and into the 1880s."},
{"Title": "King Kong", "Year": "2005", "Genre": "Action, Adventure, Drama", "Rating": "7.2", "Plot": "Carl Denham needs to finish his movie and has the perfect location; Skull Island. But he still needs to find a leading lady. This 'soon-to-be-unfortunate' soul is Ann Darrow. No one knows what they will encounter on this island and why it is so mysterious, but once they reach it, they will soon find out. Living on this hidden island is a giant gorilla and this beast now has Ann is its grasps. Carl and Ann's new love, Jack Driscoll must travel through the jungle looking for Kong and Ann, whilst avoiding all sorts of creatures and beasts. But Carl has another plan in mind."},
{"Title": "Aladdin", "Year": "1992", "Genre": "Animation, Adventure, Comedy", "Rating": "8.0", "Plot": "Aladdin is a poor street urchin who spends his time stealing food from the marketplace in the city of Agrabah. His adventures begin when he meets a young girl who happens to be Princess Jasmine, who is forced to be married by her wacky yet estranged father. Aladdin's luck suddenly changes when he retrieves a magical lamp from the Cave of Wonders. What he unwittingly gets is a fun-loving genie who only wishes to have his freedom. Little do they know is that the Sultan's sinister advisor Jafar has his own plans for both Aladdin and the lamp."},
{"Title": "True Romance", "Year": "1993", "Genre": "Crime, Drama, Romance", "Rating": "7.9", "Plot": "In Detroit, Clarence Worley goes to the movie theater alone on the day of his birthday to watch some movies. The gorgeous Alabama Whitman accidentally drops her popcorn on Clarence and they watch the movie together. Later they go to a diner for pie, and end up having a one night stand. In the morning, Alabama confesses that she is a call-girl hired to spend the night with him, but she has fallen in love with him. In the morning they get married and Clarence goes to the club where she worked to bring her some clothes. However, her pimp Drexl Spivey and his partner beat up Clarence and he reacts by killing them both. Clarence asks for Alabama's suitcase with her clothes and the other girls mistakenly give another one with cocaine. When Clarence discovers the mistake, he decides to travel with Alabama to the house of his friend, the aspiring actor Dick Ritchie, to sell the drug and travel to Mexico. He visits his father Clifford Worley and gives his address to him. But the Sicilian Mafia is the owner of the drug and a group of killers are sent to hunt down Clarnece and Alabama."},
{"Title": "Jerry Maguire", "Year": "1996", "Genre": "Comedy, Drama, Romance", "Rating": "7.3", "Plot": "Jerry Maguire (Tom Cruise) is a successful sports agent. The biggest clients, the respect, a beautiful fiancée, he has it all. Until one night he questions his purpose. His place in the world, and finally comes to terms with what's wrong with his career and life. Recording all his thoughts in a mission statement Jerry feels he has a new lease on life. Unfortunately his opinions aren't met with enthusiasm from his superiors and after dishonorably being stripped of his high earning clients and elite status within the agency Jerry steps out into the sports business armed with only one volatile client (Cuba Gooding Jr.) and the only person with belief in his abilities (Renée Zellweger) with the impossible task of rebuilding what he once had. Along the way he faces the harsh truths which he'd ignored in the past and a host of hardships that he'd never faced before."},
{"Title": "Pretty Woman", "Year": "1990", "Genre": "Comedy, Romance", "Rating": "7.0", "Plot": "Because of his extreme wealth and suave good looks, Edward Lewis could seemingly have any woman he wants, that committed significant other which he needs on his arm at social events to further how he makes his money as a corporate raider. However, he focuses more on his corporate raiding pursuits with his partner in crime, Philip Stuckey, his lawyer of ten years, than those women, with every significant other he's had in his life feeling neglected and eventually leaving him, this fact about which he is just coming to the realization. In Beverly Hills, Edward, in needing that woman on his arms as he and Philip work toward taking over the company owned by the increasingly insolvent James Morse, decides, based on a chance encounter, to hire Hollywood Boulevard hooker Vivian Ward as his escort for the week 24/7. He does so because he wants to have a professional who would be committed to the work, yet not have any commitments to her after the week is over. Beyond their chance encounter, he also makes this decision because she surprises him about how unhookerish she is in certain respects. Vivian, relatively new to Los Angeles and the business, still has to look and act the part, with Edward, beyond giving her money, leaving her largely to her own devices to do so. So she gets a somewhat unlikely Henry Higgins in Barney Thompson, the manager of the Beverly Wilshire Hotel where Edward is staying. Barney has to draw that fine line of keeping the hotel's upscale clients happy, while maintaining the posh decorum of the upper class, which does not include people coming into the hotel looking for rooms with hourly rates. As Barney and his associates are able to transform Vivian into a Cinderella, the questions become whether Vivian can go back to her Hollywood Boulevard life and whether she does have her Prince Charming beyond this week in the form of Edward or anyone else who truly does see her as Cinderella as opposed to a Hollywood Boulevard streetwalker."},
{"Title": "The Sound of Music", "Year": "1965", "Genre": "Biography, Drama, Family", "Rating": "8.0", "Plot": "In 1930's Austria, a young woman named Maria is failing miserably in her attempts to become a nun. When the Navy captain Georg Von Trapp writes to the convent asking for a governess that can handle his seven mischievous children, Maria is given the job. The Captain's wife is dead, and he is often away, and runs the household as strictly as he does the ships he sails on. The children are unhappy and resentful of the governesses that their father keeps hiring, and have managed to run each of them off one by one. When Maria arrives, she is initially met with the same hostility, but her kindness, understanding, and sense of fun soon draws them to her and brings some much-needed joy into all their lives -- including the Captain's. Eventually he and Maria find themselves falling in love, even though Georg is already engaged to a Baroness and Maria is still a postulant. The romance makes them both start questioning the decisions they have made. Their personal conflicts soon become overshadowed, however, by world events. Austria is about to come under the control of Germany, and the Captain may soon find himself drafted into the German navy and forced to fight against his own country."},
{"Title": "Say Anything...", "Year": "1989", "Genre": "Comedy, Drama, Romance", "Rating": "7.4", "Plot": "High school senior Lloyd Dobler wants nothing more than to go out with beautiful and intelligent Diane Court. Lloyd attempts to win her heart over the objections of her over-protective father before Diane leaves for a scholarship in England."},
{"Title": "Napoleon Dynamite", "Year": "2004", "Genre": "Comedy", "Rating": "6.9", "Plot": "Preston, Idaho's most curious resident, Napoleon Dynamite, lives with his grandma and his 32-year-old brother (who cruises chat rooms for ladies) and works to help his best friend, Pedro, snatch the Student Body President title from mean teen Summer Wheatley."},
{"Title": "Good Will Hunting", "Year": "1997", "Genre": "Drama", "Rating": "8.3", "Plot": "A touching tale of a wayward young man who struggles to find his identity, living in a world where he can solve any problem, except the one brewing deep within himself, until one day he meets his soul mate who opens his mind and his heart."},
{"Title": "A Beautiful Mind", "Year": "2001", "Genre": "Biography, Drama", "Rating": "8.2", "Plot": "From the heights of notoriety to the depths of depravity, John Forbes Nash, Jr. experienced it all. A mathematical genius, he made an astonishing discovery early in his career and stood on the brink of international acclaim. But the handsome and arrogant Nash soon found himself on a painful and harrowing journey of self-discovery. After many years of struggle, he eventually triumphed over his tragedy, and finally - late in life - received the Nobel Prize."},
{"Title": "Beauty and the Beast", "Year": "1991", "Genre": "Animation, Family, Fantasy", "Rating": "8.0", "Plot": "Having lived a life in selfishness, a young prince is cursed by a mysterious enchantress to having the appearance of a monstrous beast. His only hope is to learn to love a young woman and earn her love in return in order to redeem himself. Years later, his chance shows itself when a young maiden named Belle offers to take her ill father's place as his prisoner. With help from the castle's enchanted staff, Belle learns to appreciate her captor and immediately falls in love with him. Back in the village however, an unscrupulous hunter has his own plans for Belle."},
{"Title": "Coming to America", "Year": "1988", "Genre": "Comedy, Romance", "Rating": "7.0", "Plot": "It is the 21st birthday of Prince Akeem of Zamunda and he is to marry a woman he never saw before. Now the prince breaks with tradition and travels to America to look for the love of his life."},
{"Title": "Vertigo", "Year": "1958", "Genre": "Mystery, Romance, Thriller", "Rating": "8.3", "Plot": "John &quot;Scottie&quot; Ferguson is a retired San Francisco police detective who suffers from acrophobia and Madeleine is the lady who leads him to high places. A wealthy shipbuilder who is an acquaintance from college days approaches Scottie and asks him to follow his beautiful wife, Madeleine. He fears she is going insane, maybe even contemplating suicide, he believes she is possessed by a dead ancestor. Scottie is skeptical, but agrees after he sees the beautiful Madeleine."},
{"Title": "Love Actually", "Year": "2003", "Genre": "Comedy, Drama, Romance", "Rating": "7.6", "Plot": "Against the backdrop of aged has-been rock star Billy Mack's Christmas themed comeback cover of &quot;Love Is All Around&quot; which he knows is crap and makes no bones about it much to his manager Joe's chagrin as he promotes the record, several interrelated stories about romantic love and the obstacles to happiness through love for Londoners are presented in the five weeks preceding Christmas. Daniel's wife has just passed away, leaving him to take care of his adolescent stepson Sam by himself. Daniel is uncertain how to deal with Sam and his problems without his wife present, especially in light of a potential budding romance within their household. Juliet and Peter have just gotten married. They believe that Peter's best friend and best man Mark hates Juliet but won't say so to his or her face. Others looking at the situation from the outside believe Mark is jealous of Juliet as he is in love with Peter himself. Jamie, a writer, is taking a writing retreat by himself in rural France following catching his latest girlfriend in an indiscretion. Jamie ends up spending much time in France with Aurélia, the Portuguese woman hired as the housekeeper. The question becomes not only if they can communicate their day-to-day needs with each other as she speaks no English, he speaks no Portuguese, and neither speaks French well, but communicate what seems to be their increasing mutual attraction to each other. Sarah has been in love with her co-worker Karl for the two years they have worked together, this attraction which everyone in their workplace knows about. Sarah has to decide if she can be forward enough to express this love directly to Karl, especially in light of what has been her personal priority of dealing with a family issue. Harry and Karen have been in a stable long term marriage. His new assistant Mia drops hints to him that she would like them to be romantically involved. Harry has to decide whether to fall to the temptation, especially considering being married to a perceptive wife. Single and relatively young David is the newly elected Prime Minister. At 10 Downing Street, he is attracted to one of the new household servants, slightly overweight Natalie, but isn't sure what to do about it seeing as to their respective positions, the probable public scrutiny, and an incident involving the visiting U.S. President. Socially unaware Colin believes that the lack of romantic love in his life is all the fault of standoffish British women. As such, he decides to take decisive albeit somewhat unusual geographic action. And John and Judy are movie body doubles. They can communicate with each other straightforwardly while they are simulating sex filming a movie, but they may not be able to translate the feelings behind that simulation in real life to each other."},
{"Title": "The English Patient", "Year": "1996", "Genre": "Drama, Romance, War", "Rating": "7.4", "Plot": "October 1944 in war torn Italy. Hana, a French-Canadian nurse working in a mobile army medical unit, feels like everything she loves in life dies on her. Because of the difficulty traveling and the dangers, especially as the landscape is still heavily booby-trapped with mines, Hana volunteers to stay behind at a church to care solely for a dying semi-amnesiac patient, who is badly burned and disfigured. She agrees to catch up to the rest of the unit after he dies. All the patient remembers is that he is English and that he is married. Their solitude is disrupted with the arrival at the church of fellow Canadian David Caravaggio, part of the Intelligence Service, who is certain that he knows the patient as a man who cooperated with the Germans. Caravaggio believes that the patient's memory is largely in tact and that he is running away from his past, in part or in its entirety. The patient does open up about his past, all surrounding his work as a cartographer in North Africa, which was interrupted by the war. He may not be running from his work as a spy for the Germans as Caravaggio believes, but rather the memory of an affair he had with married Katherine Clifton, the love of his life, and the memory of a promise not totally fulfilled. Hana may also test her theory of her fates with love and death as she embarks on a relationship of her own with Kip Singh, a Sikh from India, whose unit has camped on the now overgrown lawn of the church. Their work entails sweeping for and diffusing mines, the discovery of one such mine which had earlier saved her life."},
{"Title": "Edward Scissorhands", "Year": "1990", "Genre": "Drama, Fantasy, Romance", "Rating": "7.9", "Plot": "In a castle high on top of a hill lives an inventor's greatest creation - Edward, a near-complete person. The creator died before he could finish Edward's hands; instead, he is left with metal scissors for hands. Since then, he has lived alone, until a kind lady called Peg discovers him and welcomes him into her home. At first, everyone welcomes him into the community, but soon things begin to take a change for the worse."}
]