[
{"Title": "Invasion of the Body Snatchers", "Year": "1978", "Genre": "Horror, Sci-Fi", "Rating": "7.4", "Plot": "The first remake of the paranoid infiltration classic moves the setting for the invasion from a small town to the city of San Fransisco and starts as Matthew Bennell notices that several of his friends are complaining that their close relatives are in some way different. When questioned later they themselves seem changed as they deny everything or make lame excuses. As the invaders increase in number they become more open and Bennell, who has by now witnessed an attempted &quot;replacement&quot; realises that he and his friends must escape or suffer the same fate. But who can he trust to help him and who has already been snatched?"},
{"Title": "Frankenstein", "Year": "1931", "Genre": "Drama, Horror, Sci-Fi", "Rating": "7.9", "Plot": "Henry Frankenstein is a doctor who is trying to discover a way to make the dead walk. He succeeds and creates a monster that has to deal with living again."},
{"Title": "The Day the Earth Stood Still", "Year": "2008", "Genre": "Drama, Sci-Fi, Thriller", "Rating": "5.5", "Plot": "Dr. Helen Benson is summoned to a military facility with several other scientists when an alien spacecraft of sorts arrives in New York City. Aboard is a human-like alien and a giant robot of immense size and power. The alien identifies himself as Klaatu and says he has come to save the Earth. The US military and political authorities see him as a threat however and decide to use so-called intensive interrogation techniques on him but Dr. Benson decides to facilitate his escape. When she learns exactly what he means when he says he is there to save the Earth, she tries to convince him to change his intentions."},
{"Title": "The Thing from Another World", "Year": "1951", "Genre": "Horror, Sci-Fi", "Rating": "7.2", "Plot": "Scientists at an Arctic research station discover a spacecraft buried in the ice. Upon closer examination, they discover the frozen pilot. All hell breaks loose when they take him back to their station and he is accidentally thawed out!"},
{"Title": "King Kong", "Year": "2005", "Genre": "Action, Adventure, Drama", "Rating": "7.2", "Plot": "Carl Denham needs to finish his movie and has the perfect location; Skull Island. But he still needs to find a leading lady. This 'soon-to-be-unfortunate' soul is Ann Darrow. No one knows what they will encounter on this island and why it is so mysterious, but once they reach it, they will soon find out. Living on this hidden island is a giant gorilla and this beast now has Ann is its grasps. Carl and Ann's new love, Jack Driscoll must travel through the jungle looking for Kong and Ann, whilst avoiding all sorts of creatures and beasts. But Carl has another plan in mind."},
{"Title": "Them!", "Year": "1954", "Genre": "Horror, Sci-Fi", "Rating": "7.3", "Plot": "In the New Mexico desert, Police Sgt. Ben Peterson and his partner find a child wandering in the desert and sooner they discover that giant ants are attacking the locals. FBI agent Robert Graham teams up with Ben and with the support of Dr. Harold Medford and his daughter Dr. Patricia 'Pat' Medford, they destroy the colony of ants in the middle of the desert. Dr. Harold Medford explains that the atomic testing in 1945 developed the dangerous mutant ants. But they also discover that two queen ants have flown away to Los Angeles and they are starting a huge colony in the underground of the city. When a mother reports that her two children are missing, the team and the army have a lead to follow. Will they arrive in time to save the children and destroy the colony?"},
{"Title": "The Blob", "Year": "1988", "Genre": "Horror, Sci-Fi, Thriller", "Rating": "6.4", "Plot": "Remake of the 1958 horror sci-fi about a deadly blob from another planet which consumes everyone in its path. Teenagers try in vain to warn the townsfolk, who refuse to take them seriously."},
{"Title": "Alien", "Year": "1979", "Genre": "Horror, Sci-Fi", "Rating": "8.5", "Plot": "A commercial crew aboard the deep space towing vessel, Nostromo is on its way home when they pick up an SOS warning from a distant moon. What they don't know is that the SOS warning is not like any other ordinary warning call. Picking up the signal, the crew realizes that they are not alone on the spaceship when an alien stowaway is on the cargo ship."},
{"Title": "Creature from the Black Lagoon", "Year": "1954", "Genre": "Horror", "Rating": "7.0", "Plot": "A scientific expedition searching for fossils along the Amazon River discovers a prehistoric Gill-Man in the legendary Black Lagoon. The explorers capture the mysterious creature, but it breaks free. The Gill-Man returns to kidnap the lovely Kay, fiancée of one in the expedition, with whom it has fallen in love."},
{"Title": "Forbidden Planet", "Year": "1956", "Genre": "Action, Adventure, Sci-Fi", "Rating": "7.6", "Plot": "When Adams and his crew are sent to investigate the silence from a planet inhabited by scientists, he finds all but two have died. Dr. Morbius and his daughter Altaira have somehow survived a hideous monster which roams the planet. Unknown to Adams, Morbius has made a discovery, and has no intention of sharing it (or his daughter!) with anyone."},
{"Title": "The Fly", "Year": "1986", "Genre": "Drama, Horror, Sci-Fi", "Rating": "7.5", "Plot": "Seth Brundle (Jeff Goldblum), a brilliant but eccentric scientist attempts to woo investigative journalist Veronica Quaife (Geena Davis) by offering her a scoop on his latest research in the field of matter transportation, which against all the expectations of the scientific establishment have proved successful. Up to a point. Brundle thinks he has ironed out the last problem when he successfully transports a living creature, but when he attempts to teleport himself a fly enters one of the transmission booths, and Brundle finds he is a changed man. This Science-Gone-Mad film is the source of the quotable quote &quot;Be afraid. Be very afraid.&quot;"},
{"Title": "Star Wars: Episode IV - A New Hope", "Year": "1977", "Genre": "Action, Adventure, Fantasy", "Rating": "8.6", "Plot": "The Imperial Forces, under orders from cruel Darth Vader, hold Princess Leia hostage in their efforts to quell the rebellion against the Galactic Empire. Luke Skywalker and Han Solo, captain of the Millennium Falcon, work together with the companionable droid duo R2-D2 and C-3PO to rescue the beautiful princess, help the Rebel Alliance and restore freedom and justice to the Galaxy."},
{"Title": "The Time Machine", "Year": "2002", "Genre": "Action, Adventure, Sci-Fi", "Rating": "5.9", "Plot": "Based on the classic sci-fi novel by H.G. Wells, scientist and inventor, Alexander Hartdegen, is determined to prove that time travel is possible. His determination is turned to desperation by a personal tragedy that now drives him to want to change the past. Testing his theories with a time machine of his own invention, Hartdegen is hurtled 800,000 years into the future, where he discovers that mankind has divided into the hunter - and the hunted."},
{"Title": "Blade Runner", "Year": "1982", "Genre": "Sci-Fi, Thriller", "Rating": "8.2", "Plot": "In the futuristic year of 2019, Los Angeles has become a dark and depressing metropolis, filled with urban decay. Rick Deckard, an ex-cop, is a &quot;Blade Runner&quot;. Blade runners are people assigned to assassinate &quot;replicants&quot;. The replicants are androids that look like real human beings. When four replicants commit a bloody mutiny on the Off World colony, Deckard is called out of retirement to track down the androids. As he tracks the replicants, eliminating them one by one, he soon comes across another replicant, Rachel, who evokes human emotion, despite the fact that she's a replicant herself. As Deckard closes in on the leader of the replicant group, his true hatred toward artificial intelligence makes him question his own identity in this future world, including what's human and what's not human."},
{"Title": "2001: A Space Odyssey", "Year": "1968", "Genre": "Adventure, Sci-Fi", "Rating": "8.3", "Plot": "&quot;2001&quot; is a story of evolution. Sometime in the distant past, someone or something nudged evolution by placing a monolith on Earth (presumably elsewhere throughout the universe as well). Evolution then enabled humankind to reach the moon's surface, where yet another monolith is found, one that signals the monolith placers that humankind has evolved that far. Now a race begins between computers (HAL) and human (Bowman) to reach the monolith placers. The winner will achieve the next step in evolution, whatever that may be."},
{"Title": "On the Beach", "Year": "1959", "Genre": "Drama, Romance, Sci-Fi", "Rating": "7.3", "Plot": "In 1964, atomic war wipes out humanity in the northern hemisphere; one American submarine finds temporary safe haven in Australia, where life-as-usual covers growing despair. In denial about the loss of his wife and children in the holocaust, American Captain Towers meets careworn but gorgeous Moira Davidson, who begins to fall for him. The sub returns after reconnaissance a month (or less) before the end; will Towers and Moira find comfort with each other?"},
{"Title": "Earth vs. the Flying Saucers", "Year": "1956", "Genre": "Action, Sci-Fi", "Rating": "6.4", "Plot": "While driving through the desert with his wife Carol Marvin to a military base to send the eleventh rocket into Earth orbit to assist the exploration of outer space in Operation Sky Hook, Dr. Russell A. Marvin and Carol see a flying saucer and accidentally records a message on their tape recorder. Once in the base, Dr. Russell is informed by his father-in-law and general that the ten first satellites mysteriously fell back to Earth. When Dr. Russell decodes the message, he encounters the aliens, who ask him to schedule a meeting with the leaders of Earth in Washington in 56 days in order to invade Earth without panicking the population. Dr. Russell develops an anti-magnetic weapon that becomes the last hope of the human race against the hostile aliens."},
{"Title": "Close Encounters of the Third Kind", "Year": "1977", "Genre": "Drama, Sci-Fi", "Rating": "7.7", "Plot": "Two parallel stories are told. In the first, a group of research scientists from a variety of backgrounds are investigating the strange appearance of items in remote locations, primarily desert regions. In continuing their investigation, one of the lead scientists, a Frenchman named Claude Lacombe, incorporates the Kodály method of music education as a means of communication in their work. The response, in turn, at first baffles the researchers, until American cartographer David Laughlin deciphers the meaning of the response. In the second, electric company lineman and family man Roy Neary and single mother Jillian Guiler are among some individuals in Muncie, Indiana who experience some paranormal activity before some flashes of bright lights in the sky, which they believe to be a UFO. Roy becomes obsessed with what he saw, unlike some others, especially in some form of authority, who refuse to acknowledge their belief that it was a UFO in not wanting to appear crazy. That obsession both for Roy and Jillian is ratcheted up a notch when they begin to have a vision of a mound with vertical striations on its side as a key to what is going on. While the obsession negatively affects Roy's life as he knows it in its entirety, Jillian knows she has to find the answer as to its meaning, especially as it relates to her only child, three year old Barry Guiler, who may be more attuned to what is happening than the adult figures around him. These two stories have the potential to intersect if Roy and Jillian can discover where they've seen that mound before, and if they can overcome what they believe to be the lies perpetrated by those in authority in covering up what is going on."},
{"Title": "It Came from Outer Space", "Year": "1953", "Genre": "Horror, Sci-Fi", "Rating": "6.6", "Plot": "John Putnam is a writer and an amateur stargazer with a new home out in the beautiful Arizona desert, which he enjoys with Ellen Fields, his girlfriend and a local schoolteacher. John is not trusted by the people of the small town near where he lives, certainly not by Sheriff Matt Warren, who feels protective of Ellen, and perhaps something more. One night, John and Ellen see a meteorite crash in the desert. John drags his friend, Pete, out of bed to take him over to the crash site in his helicopter. Once there, John climbs down into the crater. Unfortunately, he does so alone, as Pete and Ellen wait for him. John is the only one who sees the spaceship before a landslide covers it. And John is the only one who catches a glimpse of the hideous thing inside. At first John's story seems mad, until some of the townsfolk begin acting strange - as if they aren't really who they seem to be."},
{"Title": "Soylent Green", "Year": "1973", "Genre": "Crime, Mystery, Sci-Fi", "Rating": "7.1", "Plot": "In 2022, Earth is overpopulated and totally polluted; the natural resources have been exhausted and the nourishment of the population is provided by Soylent Industries, a company that makes a food consisting of plankton from the oceans. In New York City, when Soylent's member of the board William R. Simonson is murdered apparently by a burglar at the Chelsea Towers West where he lives, efficient Detective Thorn is assigned to investigate the case with his partner Solomon &quot;Sol&quot; Roth. Thorn comes to the fancy apartment and meets Simonson's bodyguard Tab Fielding and the &quot;furniture&quot; (woman that is rented together with the flat) Shirl and the detective concludes that the executive was not victim of burglary but executed. Further, he finds that the Governor Santini and other powerful men want to disrupt and end Thorn's investigation. But Thorn continues his work and discovers a bizarre and disturbing secret of the ingredient used to manufacture Soylent Green."},
{"Title": "The Invisible Man", "Year": "1933", "Genre": "Horror, Sci-Fi", "Rating": "7.7", "Plot": "Working in Dr. Cranley's laboratory, scientist Jack Griffin was always given the latitude to conduct some of his own experiments. His sudden departure, however, has Cranley's daughter Flora worried about him. Griffin has taken a room at the nearby Lion's Head Inn, hoping to reverse an experiment he conducted on himself that made him invisible. Unfortunately, the drug he used has also warped his mind, making him aggressive and dangerous. He's prepared to do whatever it takes to restore his appearance, and several will die in the process."},
{"Title": "The Incredible Shrinking Man", "Year": "1957", "Genre": "Horror, Sci-Fi", "Rating": "7.7", "Plot": "Scott Carey and his wife Louise are sunning themselves on their cabin cruiser, the small craft adrift on a calm sea. While his wife is below deck, a low mist passes over him. Scott, lying in the sun, is sprinkled with glittery particles that quickly evaporate. Later he is accidentally sprayed with an insecticide while driving and, in the next few days, he finds that he has begun to shrink. First just a few inches, so that his clothes no longer fit, then a little more. Soon he is only three feet tall, and a national curiosity. At six inches tall he can only live in a doll's house and even that becomes impossible when his cat breaks in. Scott flees to the cellar, his wife thinks he has been eaten by the cat and the door to the cellar is closed, trapping him in the littered room where, menaced by a giant spider, he struggles to survive."},
{"Title": "The Andromeda Strain", "Year": "1971", "Genre": "Sci-Fi, Thriller", "Rating": "7.2", "Plot": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. Many years prior to this incident, a group of eminent scientists led by Dr. Jeremy Stone (Arthur Hill) advocated for the construction of a secure laboratory facility that would serve as a base in the event an alien biological life form was returned to Earth from a space mission. Stone and his team - Drs. Dutton, Leavitt and Hall (David Wayne, Kate Reid, and (James Olson, respectively)- go to the facility, known as Wildfire, and try to first isolate the life form while determining why two people from Piedmont (an old wino and a six-month-old baby) survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device should it manage to escape."},
{"Title": "Village of the Damned", "Year": "1995", "Genre": "Horror, Sci-Fi, Thriller", "Rating": "5.6", "Plot": "An American village is visited by some unknown life form which leaves the women of the village pregnant. Nine months later, the babies are born, and they all look normal, but it doesn't take the &quot;parents&quot; long to realize that the kids are not human or humane."},
{"Title": "Journey to the Center of the Earth", "Year": "2008", "Genre": "Action, Adventure, Family", "Rating": "5.8", "Plot": "Professor Trevor Anderson receives his teenager nephew Sean Anderson. He will spend ten days with his uncle while his mother, Elizabeth, prepares to move to Canada. She gives a box to Trevor that belonged to his missing brother, Max, and Trevor finds a book with references to the last journey of his brother. He decides to follow the steps of Max with Sean and they travel to Iceland, where they meet the guide Hannah Ásgeirsson. While climbing a mountain, there is a thunderstorm and they protect themselves in a cave. However, a lightening collapses the entrance and the trio is trapped in the cave. They seek an exit and falls in a hole, discovering a lost world in the center of the Earth."},
{"Title": "Logan's Run", "Year": "1976", "Genre": "Action, Sci-Fi", "Rating": "6.8", "Plot": "It's 2274 and on the surface, it all seems to be an idyllic society. Living in a city within an enclosed dome, there is little or no work for humans to perform and inhabitants are free to pursue all of the pleasures of life. There is one catch however: your life is limited and when you reach 30, it is terminated in a quasi-religious ceremony known as Carousel. Some, known as runners, do try to escape their fate when the time comes and it's the job of Sandmen to track them down and kill them. Logan is such a man and with several years before his own termination date, thinks nothing of the job he does. Soon after meeting a young woman, Jessica-6, he is ordered to become a runner himself and infiltrate a community outside the dome known as Sanctuary and to destroy it. Pursued by his friend Francis, also a Sandman, Logan and Jessica find their way to the outside. There they discover a beautiful, virtually uninhabited world. Logan realizes that he must return to the dome to tell them what he's found and be set free."},
{"Title": "Metropolis", "Year": "1927", "Genre": "Drama, Sci-Fi", "Rating": "8.3", "Plot": "Sometime in the future, the city of Metropolis is home to a Utopian society where its wealthy residents live a carefree life. One of those is Freder Fredersen. One day, he spots a beautiful woman with a group of children, she and the children quickly disappear. Trying to follow her, he is horrified to find an underground world of workers who apparently run the machinery that keeps the Utopian world above ground functioning. One of the few people above ground who knows about the world below is Freder's father, John Fredersen, who is the founder and master of Metropolis. Freder learns that the woman is called Maria, who espouses the need to join the &quot;hands&quot; - the workers - to the &quot;head&quot; - those in power above - by a mediator who will act as the &quot;heart&quot;. Freder wants to help the plight of the workers in their struggle for a better life. But when John learns of what Maria is advocating and that Freder has joined their cause, with the assistance of an old colleague. an inventor called Rotwang, who turns out to be But their nemesis goes to works towards quashing a proposed uprising, with Maria at the centre of their plan. John, unaware that Rotwang has his own agenda., makes plans that include shutting down the machines, with the prospect of unleashing total anarchy both above and below ground."},
{"Title": "TRON", "Year": "1982", "Genre": "Action, Adventure, Sci-Fi", "Rating": "6.8", "Plot": "Hacker/arcade owner Kevin Flynn is digitally broken down into a data stream by a villainous software pirate known as Master Control and reconstituted into the internal, 3-D graphical world of computers. It is there, in the ultimate blazingly colorful, geometrically intense landscapes of cyberspace, that Flynn joins forces with Tron to outmaneuver the Master Control Program that holds them captive in the equivalent of a gigantic, infinitely challenging computer game."},
{"Title": "20 Million Miles to Earth", "Year": "1957", "Genre": "Fantasy, Sci-Fi", "Rating": "6.4", "Plot": "The first spaceship to visit Venus crash lands in the sea, freeing a small native Venusian creature called the Ymir. Eventually growing to enormous size, it threatens the city of Rome."},
{"Title": "The Fifth Element", "Year": "1997", "Genre": "Action, Adventure, Sci-Fi", "Rating": "7.7", "Plot": "In the twenty-third century, the universe is threatened by evil. The only hope for mankind is the Fifth Element, who comes to Earth every five thousand years to protect the humans with four stones of the four elements: fire, water, Earth and air. A Mondoshawan spacecraft is bringing The Fifth Element back to Earth but it is destroyed by the evil Mangalores. However, a team of scientists use the DNA of the remains of the Fifth Element to rebuild the perfect being called Leeloo. She escapes from the laboratory and stumbles upon the taxi driver and former elite commando Major Korben Dallas that helps her to escape from the police. Leeloo tells him that she must meet Father Vito Cornelius to accomplish her mission. Meanwhile, the Evil uses the greedy and cruel Jean-Baptiste Emanuel Zorg and a team of mercenary Mangalores to retrieve the stones and avoid the protection of Leeloo. But the skilled Korben Dallas has fallen in love with Leeloo and decides to help her to retrieve the stones."},
{"Title": "The Matrix", "Year": "1999", "Genre": "Action, Sci-Fi", "Rating": "8.7", "Plot": "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion."},
{"Title": "12 Monkeys", "Year": "2015–2018", "Genre": "Adventure, Drama, Mystery", "Rating": "7.7", "Plot": "Follows the journey of a time traveler from the post-apocalyptic future who appears in present day on a mission to locate and eradicate the source of a deadly plague that will nearly destroy the human race."},
{"Title": "When Worlds Collide", "Year": "1951", "Genre": "Action, Sci-Fi, Thriller", "Rating": "6.7", "Plot": "South African bush pilot and carefree ladies man Dave Randall finds he has been let in on the greatest and most terrible secret in the world when an eminent astronomer pays him to deliver some mysterious photos from to an equally prominent colleague in the U.S. The recipient, Dr. Hendron, confirms the awful findings of the sender: the star Bellus will collide with Earth, destroying our planet. Despite widespread disbelief, Marston and Spiro, a pair of millionaire philanthropists, give Dr. Hendron all their assets to begin construction on a huge rocket ship that will, at least theoretically, transport a nucleus of survivors to Zyra, a planet which orbiting Bellus that may or may not be habitable. The funds aren't enough to complete the spaceship, and Dr. Hendron solicits a contribution from elderly wheelchair-bound tycoon Sydney Stanton, a wheelchair-bound old man who, unlike the selfless Marston and Spiro, demands a place on the rocket, even though space and weight will be too precious for anyone but young, skilled men and women. Even as doomsday approaches, Randall is surprised to find himself in a love triangle with Dr. Hendron's daughter and her fiancé. Humanity is in peril, and only a modern-day Noah's ark, and the continued need of a man for a woman, can save it."},
{"Title": "The Day the Earth Caught Fire", "Year": "1961", "Genre": "Drama, Sci-Fi, Romance", "Rating": "7.2", "Plot": "Hysterical panic has engulfed the world after the United States and the Soviet Union simultaneously detonate nuclear devices causing a change to the nutation (axis of rotation) of the Earth."},
{"Title": "Things to Come", "Year": "2016", "Genre": "Drama", "Rating": "7.0", "Plot": "Nathalie teaches philosophy at a high school in Paris. She is passionate about her job and particularly enjoys passing on the pleasure of thinking. Married with two children, she divides her time between her family, former students and her very possessive mother. One day, Nathalie's husband announces he is leaving her for another woman. With freedom thrust upon her, Nathalie must reinvent her life."},
{"Title": "Tarantula", "Year": "1955", "Genre": "Horror, Sci-Fi", "Rating": "6.5", "Plot": "In the Arizona desert, Professor Gerald Deemer is experimenting with growth hormones in the hopes of finding a way to increase the world's food supply. His partner in the project was recently found dead in the desert, suffering from a disease that normally takes years to advance but, in his case, seems to have afflicted him in only a few days. The local doctor, Matt Hastings, is puzzled by the strange case and, with Deemer's recently arrived (and very pretty) assistant, Stephanie Clayton, tries to figure out what is going on. When cattle remains are found in the countryside, evidence points to a giant tarantula as the culprit."},
{"Title": "Aliens", "Year": "1986", "Genre": "Action, Adventure, Sci-Fi", "Rating": "8.4", "Plot": "Fifty seven years after Ellen Ripley survived her disastrous ordeal, her escape vessel is recovered after drifting across the galaxy as she slept in cryogenic stasis. Back on Earth, nobody believed her story about the &quot;Aliens&quot; on the moon LV-426. After the &quot;Company&quot; orders the colony on LV-426 to investigate, however, all communication with the colony is lost. The Company enlists Ripley to aid a team of tough, rugged space marines on a rescue mission to the now partially terraformed moon to find out if there are aliens or survivors. As the mission unfolds, Ripley will be forced to come to grips with her worst nightmare, but even as she does, she finds that the worst is yet to come."},
{"Title": "Jurassic Park", "Year": "1993", "Genre": "Adventure, Sci-Fi, Thriller", "Rating": "8.1", "Plot": "Huge advancements in scientific technology have enabled a mogul to create an island full of living dinosaurs. John Hammond has invited four individuals, along with his two grandchildren, to join him at Jurassic Park. But will everything go according to plan? A park employee attempts to steal dinosaur embryos, critical security systems are shut down and it now becomes a race for survival with dinosaurs roaming freely over the island."},
{"Title": "I Married a Monster from Outer Space", "Year": "1958", "Genre": "Horror, Sci-Fi", "Rating": "6.4", "Plot": "In Norrisville, Bill Farrell leaves his bachelor party on the eve of his marriage with Marge Bradley. He is abducted by an alien that takes his shape and marries Marge on the next day. Marge feels something strange with Bill and one year later she realizes that he is a totally different man. One day, Marge follows Bill and he goes to the woods; she finds that he is an alien and sees his spacecraft. She tries to tell to Washington and to the FBI, but the aliens have dominated key people in town that do not allow any sort of communication with the exterior world. What is the intention of the alien invasion?"},
{"Title": "War of the Colossal Beast", "Year": "1958", "Genre": "Horror, Sci-Fi", "Rating": "3.3", "Plot": "A mysterious series of food truck robberies makes government officials doubt that the 60-foot tall Colossal Man is dead. He is discovered in a desolate mountain range in Mexico, insane and horribly disfigured. The military drugs him and transports him back to America where he promptly escapes and wreaks havoc on a city."},
{"Title": "The Mole People", "Year": "1956", "Genre": "Adventure, Fantasy, Horror", "Rating": "4.8", "Plot": "On an archaeological dig in Asia, Dr. Roger Bentley finds a cuneiform tablet referring to an ancient society, the Shadow Dynasty, that was destroyed. An earthquake soon after reveals an ancient artifact and the scientists discover the ruins of an ancient temple world on a remote mountain site. It leads them to an underground world, lost in time, where people have adapted to low light. The High Priest Elinu doesn't welcome the presence of the new arrivals and wants them eliminated."},
{"Title": "Invaders from Mars", "Year": "1986", "Genre": "Horror, Sci-Fi", "Rating": "5.5", "Plot": "In this remake of the classic 50s SF tale, a boy tries to stop an invasion of his town by aliens who take over the the minds of his parents, his least-liked schoolteacher and other townspeople. With the aid of the school nurse the boy enlists the aid of the U.S. Marines."},
{"Title": "The Deadly Mantis", "Year": "1957", "Genre": "Horror, Sci-Fi, Thriller", "Rating": "4.9", "Plot": "The calving of an Arctic iceberg releases a giant praying mantis, trapped in suspended animation since prehistoric times. It first attacks military outposts to eat their occupants, then makes its way to the warmer latitudes of Washington and New York. A paleontologist works together with military units to try to kill it."},
{"Title": "Planet of the Apes", "Year": "2001", "Genre": "Action, Adventure, Sci-Fi", "Rating": "5.7", "Plot": "It is the year 2029: Astronaut Leo Davidson boards a pod cruiser on a Space Station for a &quot;routine&quot; reconnaissance mission. But an abrupt detour through a space time wormhole lands him on a strange planet where talking apes rule over the human race. With the help of a sympathetic chimpanzee activist named Ari and a small band of human rebels, Leo leads the effort to evade the advancing Gorilla Army led by General Thade and his most trusted warrior Attar. Now the race is on to reach a sacred temple within the planet's Forbidden Zone to discover the shocking secrets of mankind's past - and the key to its future."},
{"Title": "It! The Terror from Beyond Space", "Year": "1958", "Genre": "Horror, Sci-Fi", "Rating": "6.1", "Plot": "In 1973, the first manned expedition to Mars is marooned; by the time a rescue mission arrives, there is only one survivor: the leader, Col. Edward Carruthers, who appears to have murdered the others! According to Carruthers, an unknown life form killed his comrades during a sandstorm. But the skeptical rescuers little suspect that &quot;it&quot; has stowed away for the voyage back to Earth..."},
{"Title": "This Island Earth", "Year": "1955", "Genre": "Horror, Mystery, Sci-Fi", "Rating": "5.9", "Plot": "The electronic engineer Dr. Cal Meacham is a prominent scientist that is studying industrial application of nuclear energy and also a great pilot. One day, he receives a different condenser and soon his assistant Joe Wilson receives a manual instruction and several components of a sophisticated machine. Carl and Joe build a communication apparatus and a man called Exeter contacts Carl. He tells that Carl has passed the test assembling the Interocitor and invites him to join his research. The intrigued Carl decides to travel to meet Exeter that sends an unmanned airplane to bring him to an isolated facility in Georgia. He is welcomed by Dr. Ruth Adams but she mysteriously does not recall their love affair in the past. They team-up with Dr. Steve Carlson and they note that the other scientists in the facility have been transformed, having a weird behavior. They decide to flee in a car, but they are attacked by rays and Steve dies. Carl and Ruth also witness the facility blowing-up and they escape in an airplane. However they are pulled up into a flying saucer and realize that Exeter is an alien. Whal is the objective of the aliens?"},
{"Title": "Mars Attacks!", "Year": "1996", "Genre": "Comedy, Sci-Fi", "Rating": "6.3", "Plot": "It is a normal day for everyone, until the President of the United States announces Martians have been spotted circling Earth. The Martians land and a meeting is arranged, but not everything goes to plan, and the Martians seem to have other plans for Earth. Are they just misunderstood beings or do they really want to destroy all of humanity?"},
{"Title": "Target Earth", "Year": "1954", "Genre": "Horror, Sci-Fi", "Rating": "5.7", "Plot": "A large city is ordered to be completely evacuated as an army of robots, believed to be from the planet Venus, attack it. Left behind are Nora King and Frank Brooks, strangers until their chance meeting in the deserted streets. They meet a celebrating couple at a café, Vicki Harris and Jim Wilson. The quartet escape the robot patrol and take refuge in a large hotel. There, they encounter a new danger in Davis, a psychopathic killer. Venus robots or not, Davis practices his profession."},
{"Title": "Colossus: The Forbin Project", "Year": "1970", "Genre": "Sci-Fi, Thriller", "Rating": "7.2", "Plot": "Forbin is the designer of an incredibly sophisticated computer that will run all of America's nuclear defenses. Shortly after being turned on, it detects the existence of Guardian, the Soviet counterpart, previously unknown to US Planners. Both computers insist that they be linked, and after taking safeguards to preserve confidential material, each side agrees to allow it. As soon as the link is established the two become a new Super computer and threaten the world with the immediate launch of nuclear weapons if they are detached. Colossus begins to give its plans for the management of the world under its guidance. Forbin and the other scientists form a technological resistance to Colossus which must operate underground."},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."}
]