[
{"Title": "Vertigo", "Year": "1958", "Genre": "Mystery, Romance, Thriller", "Rating": "8.3", "Plot": "John &quot;Scottie&quot; Ferguson is a retired San Francisco police detective who suffers from acrophobia and Madeleine is the lady who leads him to high places. A wealthy shipbuilder who is an acquaintance from college days approaches Scottie and asks him to follow his beautiful wife, Madeleine. He fears she is going insane, maybe even contemplating suicide, he believes she is possessed by a dead ancestor. Scottie is skeptical, but agrees after he sees the beautiful Madeleine."},
{"Title": "Rear Window", "Year": "1954", "Genre": "Mystery, Thriller", "Rating": "8.5", "Plot": "Professional photographer L.B. &quot;Jeff&quot; Jeffries breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Freemont and his visiting nurse Stella to investigate."},
{"Title": "Jaws", "Year": "1975", "Genre": "Adventure, Drama, Thriller", "Rating": "8.0", "Plot": "It's a hot summer on Amity Island, a small community whose main business is its beaches. When new Sheriff Martin Brody discovers the remains of a shark attack victim, his first inclination is to close the beaches to swimmers. This doesn't sit well with Mayor Larry Vaughn and several of the local businessmen. Brody backs down to his regret as that weekend a young boy is killed by the predator. The dead boy's mother puts out a bounty on the shark and Amity is soon swamped with amateur hunters and fisherman hoping to cash in on the reward. A local fisherman with much experience hunting sharks, Quint, offers to hunt down the creature for a hefty fee. Soon Quint, Brody and Matt Hooper from the Oceanographic Institute are at sea hunting the Great White shark. As Brody succinctly surmises after their first encounter with the creature, they're going to need a bigger boat."},
{"Title": "Rear Window", "Year": "1954", "Genre": "Mystery, Thriller", "Rating": "8.5", "Plot": "Professional photographer L.B. &quot;Jeff&quot; Jeffries breaks his leg while getting an action shot at an auto race. Confined to his New York apartment, he spends his time looking out of the rear window observing the neighbors. He begins to suspect that a man across the courtyard may have murdered his wife. Jeff enlists the help of his high society fashion-consultant girlfriend Lisa Freemont and his visiting nurse Stella to investigate."},
{"Title": "The Hunt for Red October", "Year": "1990", "Genre": "Action, Adventure, Thriller", "Rating": "7.6", "Plot": "Soviets create a new nuclear submarine that runs silent due to a revolutionary propulsion system. Russian sub captain defects, goal of taking it to the U.S.A. to prevent the Russians from using the sub to wreak nuclear (missile) war against the U.S. Lots of plot turns and twists in this high-tech thriller."},
{"Title": "Clue", "Year": "1985", "Genre": "Comedy, Crime, Mystery", "Rating": "7.3", "Plot": "Clue is a movie about six guests, a butler, and a maid, who are all involved in the murders of six people. The guests all meet at Hill House, where you learn that Professor Plum works in D.C., where everyone else lives. Colonel Mustard is a client of Miss Scarlet, who is the ex-employer of Yvette, the maid, who had an affair with the husband of Mrs. White, etc. Blackmailer Mr. Boddy gives each guest a weapon and tells them to kill butler Wadsworth to avoid being exposed. Add in Mrs. Peacock's craziness and Mr. Green's clumsiness, and meet a whole group tangled in a web of murder, lies, and hilarity."},
{"Title": "Invasion of the Body Snatchers", "Year": "1978", "Genre": "Horror, Sci-Fi", "Rating": "7.4", "Plot": "The first remake of the paranoid infiltration classic moves the setting for the invasion from a small town to the city of San Fransisco and starts as Matthew Bennell notices that several of his friends are complaining that their close relatives are in some way different. When questioned later they themselves seem changed as they deny everything or make lame excuses. As the invaders increase in number they become more open and Bennell, who has by now witnessed an attempted &quot;replacement&quot; realises that he and his friends must escape or suffer the same fate. But who can he trust to help him and who has already been snatched?"},
{"Title": "All the President's Men", "Year": "1976", "Genre": "Biography, Drama, History", "Rating": "8.0", "Plot": "In the run-up to the 1972 elections, Washington Post reporter Bob Woodward covers what seems to be a minor break-in at the Democratic Party National headquarters. He is surprised to find top lawyers already on the defense case, and the discovery of names and addresses of Republican fund organizers on the accused further arouses his suspicions. The editor of the Post is prepared to run with the story and assigns Woodward and Carl Bernstein to it. They find the trail leading higher and higher in the Republican Party, and eventually into the White House itself."},
{"Title": "Time After Time", "Year": "1979", "Genre": "Adventure, Drama, Sci-Fi", "Rating": "7.2", "Plot": "It's 1893 London. Futurist H.G. Wells believes that the future holds a Utopian society. He also believes in time travel. He has just built a time machine which he is displaying to a group of skeptical friends, including surgeon Dr. John Leslie Stevenson. Unbeknown to Wells or anyone else among that circle, Stevenson is better known to the public as Jack the Ripper. Just as the police are about to capture Stevenson, he uses the time machine to escape, with Wells being the only one who knows what happened to him. Not telling anyone except his trusting housekeeper, Wells follows Stevenson in order to capture and bring him back to face justice. Where Stevenson has gone is 1979 San Francisco. There, Wells is dismayed to find that the future is not Utopia as he had predicted. But Wells is also picked up by a young woman named Amy Robbins. As Wells and Amy search for Stevenson, Stevenson conversely is after Wells to obtain the master key to the time machine. As Stevenson continues his murderous ways, he will stop at nothing to achieve his desires, which places Amy in danger."},
{"Title": "The Stepford Wives", "Year": "2004", "Genre": "Comedy, Horror, Sci-Fi", "Rating": "5.3", "Plot": "Joanna Eberhart, a wildly successful president of a TV Network, after a series of shocking events, suffers a nervous breakdown and is moved by her milquetoast of a husband, Walter, from Manhattan to the chic, upper-class, and very modern planned community of Stepford, Connecticut. Once there, she makes good friends with the acerbic Bobbie Markowitz, a Jewish writer who's also a recovering alcoholic. Together they find out, much to their growing stupor and-then horror, that all the housewives in town are strangely blissful and, somehow... doomed. What is going on behind the closed doors of the Stepford Men's Association and the Stepford Day Spa? Why is everything perfect here? Will it be too late for Joanna and Bobbie when they finally find out?"},
{"Title": "Papillon", "Year": "1973", "Genre": "Biography, Crime, Drama", "Rating": "8.0", "Plot": "A semi-fictional account of Henri Charrière's time in the penal system in French Guyana - some of it spent on infamous Devil's Island - is presented. It's the early 1930s. Charrière - nicknamed Papillon because of his butterfly tattoo - and Louis Dega are two among many who have been convicted in the French judicial system, they now being transferred to French Guyana where they will serve their time, never to return to France even if they are ever released. A safe-cracker by criminal profession, Papillon is serving a life sentence for murdering a pimp, a crime for which he adamantly states he was framed. Dega is a wealthy counterfeiter, who expects his well-to-do wife eventually to get him released. On Papillon's initiative, Papillon and Dega enter into a business arrangement: Papillon will provide protection for Dega, while Dega will finance Papillon's escape attempt. As Papillon and Degas' time together lasts longer than either expects, their burgeoning friendship ends up being an important factor altering their original plans, needed as they work with and against others who are trying to achieve their own goals, sometime conflicting with Papillon and Dega's."},
{"Title": "Bullitt", "Year": "1968", "Genre": "Action, Crime, Mystery", "Rating": "7.5", "Plot": "High profile San Francisco Police Lieutenant Frank Bullitt is asked personally by ambitious Walter Chalmers, who is in town to hold a US Senate subcommittee hearing on organized crime, to guard Johnny Ross, a Chicago based mobster who is about to turn evidence against the organization at the hearing. Chalmers wants Ross' safety at all cost, or else Bullitt will pay the consequences. Bullitt and his team of Sergeant Delgetti and Detective Carl Stanton have Ross in protective custody for 48 hours over the weekend until Ross provides his testimony that upcoming Monday. Bullitt's immediate superior, Captain Samuel Bennet, gives Bullitt full authority to lead the case, no questions asked for any move Bullitt makes. When an incident occurs early during their watch, Bullitt is certain that Ross and/or Chalmers are not telling them the full story to protect Ross properly. Without telling Bennet or an incensed Chalmers, Bullitt clandestinely moves Ross while he tries to find out who is after Ross, and why Ross has seemingly made it so easy for &quot;them&quot; to find him. As Bullitt enlists the help of his live-in artist girlfriend Cathy over the weekend and as she sees for the first time with what he deals every day, she wonders if he is indeed the man with whom she should be."},
{"Title": "A View to a Kill", "Year": "1985", "Genre": "Action, Adventure, Thriller", "Rating": "6.3", "Plot": "James Bond has one more mission. Bond returns from his travels in the USSR with a computer chip. This chip is capable of withstanding a nuclear electromagnetic pulse that would otherwise destroy a normal chip. The chip was created by Zorin Industries, and Bond heads off to investigate its owner, Max Zorin. Zorin may only seem like a innocent guilty man, but is really planning to set off an earthquake in San Andreas which will wipe out all of Silicon Valley. As well as Zorin, Bond must also tackle May Day and equally menacing companion of Zorin, whilst dragging Stacy Sutton along for the ride."},
{"Title": "Dial M for Murder", "Year": "1954", "Genre": "Crime, Thriller", "Rating": "8.2", "Plot": "In London, wealthy Margot Mary Wendice had a brief love affair with the American writer Mark Halliday while her husband and professional tennis player Tony Wendice was on a tennis tour. Tony quits playing to dedicate to his wife and finds a regular job. She decides to give him a second chance for their marriage. When Mark arrives from America to visit the couple, Margot tells him that she had destroyed all his letters but one that was stolen. Subsequently she was blackmailed, but she had never retrieved the stolen letter. Tony arrives home, claims that he needs to work and asks Margot to go with Mark to the theater. Meanwhile Tony calls Captain Lesgate (aka Charles Alexander Swann who studied with him at college) and blackmails him to murder his wife, so that he can inherit her fortune. But there is no perfect crime, and things do not work as planned."},
{"Title": "The Man Who Knew Too Much", "Year": "1956", "Genre": "Drama, Thriller", "Rating": "7.5", "Plot": "While attending a medical conference in Paris, American physician Dr. Ben McKenna, his wife, retired musical theater actress and singer Jo McKenna née Conway, and their adolescent son Hank McKenna decide to take a side trip to among other places Marrekesh, French Morocco. With a knife plunged into his back, Frenchman Louis Bernard, who the family met earlier in their bus ride into Marrakesh and who is now masquerading as an Arab, approaches Ben, cryptically whispering into Ben's ears that there will be an attempted assassination in London of a statesman, this news whispered just before Bernard dies. Ben is reluctant to provide any information of this news to the authorities because concurrently Hank is kidnapped by British couple, Edward and Lucy Drayton, who also befriended the McKennas in Marrakesh and who probably have taken Hank out of the country back to England. Whoever the unknown people the Draytons are working for have threatened to kill Hank if Ben divulges any information told to him by Bernard. With what little information they have on hand, Ben and Jo head to London to try and thwart the assassination attempt and more importantly find an alive and safe Hank. Scotland Yard is aware of some pieces to the puzzle, including the fact that Bernard was a French secret service agent and that there will be an assassination attempt on someone. They and the McKennas will have to work together as they hit a diplomatic roadblock, one that may be overcome with a special Jo Conway song."},
{"Title": "Goldfinger", "Year": "1964", "Genre": "Action, Adventure, Thriller", "Rating": "7.7", "Plot": "Bond is back and his next mission takes him to Fort Knox, where Auric Goldfinger and his henchman are planning to raid Fort Knox and obliterate the world economy. To save the world once again, Bond will need to become friends with Goldfinger, dodge killer hats and avoid Goldfinger's personal pilot, the sexy Pussy Galore. She might not have feelings for Bond, but will 007 help her change her mind?"},
{"Title": "WarGames", "Year": "1983", "Genre": "Sci-Fi, Thriller", "Rating": "7.1", "Plot": "A young computer whiz kid accidentally connects into a top secret super-computer which has complete control over the U.S. nuclear arsenal. It challenges him to a game between America and Russia, and he innocently starts the countdown to World War 3. Can he convince the computer he wanted to play a game and not the real thing ?"},
{"Title": "The Poseidon Adventure", "Year": "1972", "Genre": "Action, Adventure, Drama", "Rating": "7.1", "Plot": "A passenger ship, on her way to the scrap yard is pushed to her limits by the new owners to save on the dismantling fees. A tidal wave hits her, flipping her over so that all the internal rooms are upside down. A priest takes a mixed band of survivors on a journey through the bowels of the ship in an attempt to survive."},
{"Title": "Duel", "Year": "1971", "Genre": "Action, Horror, Thriller", "Rating": "7.7", "Plot": "While traveling through the desert for an appointment with a client, the businessman David Mann from California passes a slow and old tanker truck. The psychotic truck driver feels offended and chases David along the empty highway trying to kill him."},
{"Title": "The Day of the Jackal", "Year": "1973", "Genre": "Crime, Drama, Thriller", "Rating": "7.8", "Plot": "It is the early 60s in France. The remaining survivors of the aborted French Foreign Legion have made repeated attempts to kill DeGaulle. The result is that he is the most closely guarded man in the world. As a desperate act, they hire The Jackal, the code name for a hired killer who agrees to kill French President De Gaulle for half a million dollars. We watch his preparations which are so thorough we wonder how he could possibly fail even as we watch the French police attempt to pick up his trail. The situation is historically accurate. There were many such attempts and the film closely follows the plot of the book."},
{"Title": "Maverick", "Year": "1994", "Genre": "Action, Adventure, Comedy", "Rating": "7.0", "Plot": "Maverick is recreated from the character James Garner created in the 1950s TV program. Maverick is a gambler who would rather con someone than fight them. He needs an additional three thousand dollars in order to enter a Winner Take All poker game that begins in a few days. He tries to win some, tries to collect a few debts, and recover a little loot for the reward, all with a light hearted air. He joins forces with a woman gambler with a marvelous, though fake, southern accent as the two both try and enter the game."},
{"Title": "Missing", "Year": "1982", "Genre": "Biography, Drama, History", "Rating": "7.8", "Plot": "In September1973, in Chile, the American journalist Charles Horman arrives in Valparaiso with his friend Terry Simon to meet his wife Beth and bring her back to New York with him. However, they are surprised by the military coup d'état sponsored by the US Government to replace President Salvador Allende and Charles is arrested by the military force. His father Ed Horman, a conservative businessman from New York, arrives in Chile to seek out his missing son with Beth. He goes to the American Consulate to meet the Consul that promises the best efforts to find Charles while the skeptical Beth does not trust on the word of the American authorities. The nationalism and confidence of Ed in his government changes when he finds the truth about what happened with his beloved son."},
{"Title": "The Conversation", "Year": "1974", "Genre": "Drama, Mystery, Thriller", "Rating": "7.9", "Plot": "Harry Caul is a devout Catholic and a lover of jazz music who plays his saxophone while listening to his jazz records. He is a San Francisco-based electronic surveillance expert who owns and operates his own small surveillance business. He is renowned within the profession as being the best, one who designs and constructs his own surveillance equipment. He is an intensely private and solitary man in both his personal and professional life, which especially irks Stan, his business associate who often feels shut out of what is happening with their work. This privacy, which includes not letting anyone into his apartment and always telephoning his clients from pay phones is, in part, intended to control what happens around him. His and Stan's latest job (a difficult one) is to record the private discussion of a young couple meeting in crowded and noisy Union Square. The arrangement with his client, known only to him as &quot;the director&quot;, is to provide the audio recording of the discussion and photographs of the couple directly to him alone in return for payment. Based on circumstances with the director's assistant, Martin Stett, and what Harry ultimately hears on the recording, Harry believes that the lives of the young couple are in jeopardy. Harry used to be detached from what he recorded, but is now concerned ever since the deaths of three people that were the direct result of a previous audio recording he made for another job. Harry not only has to decide if he will turn the recording over to the director, but also if he will try and save the couple's lives using information from the recording. As Harry goes on a quest to find out what exactly is happening on this case, he finds himself in the middle of his worst nightmare."},
{"Title": "From Russia with Love", "Year": "1963", "Genre": "Action, Adventure, Thriller", "Rating": "7.5", "Plot": "James Bond 007 is on the search for a Russian decoding machine, known as Lektor. Bond needs to find this machine, before the evil SPECTRE organization discovers it first. Whilst being romantically linked with Russian girl, Tatiana Romanova, Bond sneaks his way around Istanbul, whilst each SPECTRE agent tries to pick him off, including the over powering Donald 'Red' Grant and ex-KGB agent Rosa Klebb who knows all the tricks in the books and even possesses an incredible poison tipped shoe!"},
{"Title": "Shadow of a Doubt", "Year": "1943", "Genre": "Thriller", "Rating": "7.9", "Plot": "Charlotte 'Charlie' Newton is bored with her quiet life at home with her parents and her younger sister. She wishes something exciting would happen and knows exactly what they need: a visit from her sophisticated and much traveled uncle Charlie Oakley, her mother's younger brother. Imagine her delight when, out of the blue, they receive a telegram from uncle Charlie announcing that he is coming to visit them for awhile. Charlie Oakley creates quite a stir and charms the ladies club as well as the bank president where his brother-in-law works. Young Charlie begins to notice some odd behavior on his part, such as cutting out a story in the local paper about a man who marries and then murders rich widows. When two strangers appear asking questions about him, she begins to imagine the worst about her dearly beloved uncle Charlie."},
{"Title": "Saboteur", "Year": "1942", "Genre": "Thriller, War", "Rating": "7.2", "Plot": "Los Angeles aircraft worker Barry Kane evades arrest after he is unjustly accused of sabotage. Following leads, he travels across the country to New York trying to clear his name by exposing a gang of fascist-supporting saboteurs led by apparently respectable Charles Tobin. Along the way, he involves Pat Martin, eventually preventing another major act of sabotage. They finally catch up with Frank Frye, the man who actually committed the act of sabotage at the aircraft factory."},
{"Title": "The Drowning Pool", "Year": "1975", "Genre": "Action, Crime, Mystery", "Rating": "6.5", "Plot": "Harper is brought to Louisiana bayou country to help out an old girlfriend who is worried that her husband will find out that she is cheating on him. What is more, he finds himself caught in a power struggle between the matriarch of the family and a greedy oil baron, who wants her property. Poor Harper! Things are not as straight-forward as they initially appeared."},
{"Title": "The Seven-Ups", "Year": "1973", "Genre": "Action, Crime, Drama", "Rating": "6.8", "Plot": "Buddy, Barilli, Mingo and Ansel, detectives with the NYPD, comprise a secret investigative unit called the Seven-Ups, who, largely undercover, focus on cases leading to felony convictions with prison sentences of seven years or more for the criminals in question. Many within the NYPD who know about the unit don't support the idea of it because of the often unethical way they work on the cases, but their superior, Inspector Gilson, defends the unit solely because of the results. On the sly, Buddy, who is the head of the team, gets much of the information for the cases from Vito Lucia, a childhood friend who still lives and works in the old neighborhood where much of the crime is based. Vito knows that his life could be in danger if the mob finds out that he acts as a snitch for the police. After Buddy starts looking into the loan sharking business of some local mob members, unknown to him some of those mob members are shaken down for a minimum $100,000 apiece, one by one kidnapped for ransom before they are released when the extortionists are able to abscond with the ransom money. The M.O. of the extortionists is for two to act as police detectives bringing the mob member in for questioning, before showing their true colors of kidnapping the person for ransom. The mob has no reason to doubt that the men truly are NYPD gone bad. Buddy even sees one of them taken in, a bail bondsman named Festa with mob ties, he knowing that what he witnessed was not what it appeared on the surface, however unaware that this situation was not a one off in the scuttlebutt he had previous heard about general unrest on the streets. By the time that Buddy learns of the serial kidnappings and the unofficial war the mob has with the NYPD because of it, Buddy and the team are determined to nab the mastermind behind the extortions as it has become more than a professional issue for them."},
{"Title": "The Passenger", "Year": "1975", "Genre": "Drama, Thriller", "Rating": "7.6", "Plot": "A journalist researching a documentary in the Sahara Desert meets a gunrunner who dies suddenly. When the journalist notices that they have a similar appearance, he assumes the recently deceased's identity and accepts the consequences that it brings."},
{"Title": "The Odessa File", "Year": "1974", "Genre": "Drama, Thriller", "Rating": "7.0", "Plot": "After reading the diary of an elderly Jewish man who committed suicide, freelance journalist Peter Miller begins to investigate the alleged sighting of a former SS-Captain who commanded a concentration camp during World War II. Miller eventually finds himself involved with the powerful organization of former SS members, called ODESSA, as well as with the Israeli secret service. Miller probes deeper and eventually discovers a link between the SS-Captain, ODESSA, and his own family."},
{"Title": "Deathtrap", "Year": "1982", "Genre": "Comedy, Crime, Mystery", "Rating": "7.0", "Plot": "To make Sidney's slump all the more painful, Clifford Anderson, a student of one of Sidney's writing seminars, has recently sent his mentor a copy of his first attempt at playwrighting for Sidney's review and advice. The play, &quot;Deathtrap,&quot; is a five character, two act thriller so perfect in its construction that, as Sidney says, &quot;A gifted director couldn't even hurt it.&quot; Using his penchant for plot, and out of his desperate desire to once again be the toast of Broadway, Sidney, along with Myra, cook up an almost unthinkable scheme: They'll lure the would-be playwright to the Bruhl home, kill him, and market the sure-fire script as Sidney's own. But shortly after Clifford arrives, it's clear that things are not what they seem! Indeed, even Helga Ten Dorp, a nosey psychic from next door, and Porter Milgram, Sidney's observant attorney, can only speculate where the line between truth and deception lies."},
{"Title": "Murder on the Orient Express", "Year": "2017", "Genre": "Crime, Drama, Mystery", "Rating": "6.5", "Plot": "When a murder occurs on the train he's travelling on, celebrated detective Hercule Poirot is recruited to solve the case."},
{"Title": "Rope", "Year": "1948", "Genre": "Crime, Drama, Mystery", "Rating": "8.0", "Plot": "Brandon and Philip are two young men who share a New York apartment. They consider themselves intellectually superior to their friend David Kentley and as a consequence decide to murder him. Together they strangle David with a rope and placing the body in an old chest, they proceed to hold a small party. The guests include David's father, his fiancée Janet and their old schoolteacher Rupert from whom they mistakenly took their ideas. As Brandon becomes increasingly more daring, Rupert begins to suspect."},
{"Title": "The Mirror Crack'd", "Year": "1980", "Genre": "Crime, Mystery, Thriller", "Rating": "6.2", "Plot": "The year is 1953. The small English village of St. Mary Mead, home to Miss Jane Marple, is delighted when a big American movie company arrives to make a movie telling of the relationship between Jane Grey and Elisabeth I, starring the famous actresses Marina Rudd and Lola Brewster. Marina arrives with her husband, Jason, and when she discovers that Lola is going to be in the movie with her she hits the roof as Lola and Marina loathe each other on sight. Marina has been getting death threats and at a party at the manor house, Heather Babcock, after boring Marina with a long story, drinks a cocktail made for Marina and dies from poisoning. Everybody believes that Marina is the target but the police officer investigating the case, Inspector Craddock isn't sure so he asks Miss Marple, his aunt, to investigate..."},
{"Title": "Death on the Nile", "Year": "1978", "Genre": "Crime, Drama, Mystery", "Rating": "7.3", "Plot": "Based on the Agatha Christie novel, our favourite Belgian detective, Hercule Poirot, is on a cruise up the Nile. He is surrounded by an interesting assortment of characters, including a wealthy heiress and her husband, on their honeymoon. It appears that everyone hates the heiress..."},
{"Title": "Superman III", "Year": "1983", "Genre": "Action, Comedy, Sci-Fi", "Rating": "4.9", "Plot": "Wealthy businessman Ross Webster (Robert Vaughn)discovers the hidden talents of Gus Gorman (Richard Pryor), a mischievous computer genius. Ross decides to abuse his talents, in a way to help Webster with his plans for economic control. When the man of steel interferes, something must be done about Supes. When Gus' synthetic Kryptonite fails to kill Superman, it turns him in an evil incarnation of his former self. The tar-laced Kryptonite pits man against himself, setting up the Clark vs. Superman battle."},
{"Title": "The Living Daylights", "Year": "1987", "Genre": "Action, Adventure, Thriller", "Rating": "6.7", "Plot": "James Bond 007's mission is to firstly, organise the defection of a top Soviet general. When the general is re-captured, Bond heads off to find why an ally of General Koskov was sent to murder him. Bond's mission continues to take him to Afghanistan, where he must confront an arms dealer known as Brad Whitaker. Everything eventually reveals its self to Bond."},
{"Title": "Jumanji", "Year": "1995", "Genre": "Adventure, Family, Fantasy", "Rating": "6.9", "Plot": "After being trapped in a jungle board game for 26 years, a Man-Child wins his release from the game. But, no sooner has he arrived that he is forced to play again, and this time sets the creatures of the jungle loose on the city. Now it is up to him to stop them."},
{"Title": "Marnie", "Year": "1964", "Genre": "Crime, Drama, Mystery", "Rating": "7.2", "Plot": "Marnie Edgar is a habitual liar and a thief who gets jobs as a secretary and after a few months robs the firms in question, usually of several thousand dollars. When she gets a job at Rutland's, she also catches the eye of the handsome owner, Mark Rutland. He prevents her from stealing and running off, as is her usual pattern, but also forces her to marry him. Their honeymoon is a disaster and she cannot stand to have a man touch her and on their return home, Mark has a private detective look into her past. When he has the details of what happened in her childhood to make her what she is, he arranges a confrontation with her mother realizing that reliving the terrible events that occurred in her childhood and bringing out those repressed memories is the only way to save her."},
{"Title": "Thunderball", "Year": "1965", "Genre": "Action, Adventure, Thriller", "Rating": "7.0", "Plot": "James Bond continues on his fourth mission, with his aim to recover two stolen warheads. They have been taken by the evil SPECTRE organization. The world is held hostage and Bond heads to Nassau. Here, he meets the beautiful Domino and is forced into a thrilling confrontation with SPECTRE agent Emilio Largo, on board his boat, the Disco Volante. Will 007 prevent the killing of millions of innocent victims?"},
{"Title": "Dr. No", "Year": "1962", "Genre": "Action, Adventure, Thriller", "Rating": "7.3", "Plot": "James Bond (007) is Britain's top agent and is on an exciting mission, to solve the mysterious murder of a fellow agent. The task sends him to Jamaica, where he joins forces with Quarrel and a loyal CIA agent, Felix Leiter. While dodging tarantulas, &quot;fire breathing dragons&quot; and a trio of assassins, known as the three blind mice. Bond meets up with the beautiful Honey Ryder and goes face to face with the evil Dr. No."},
{"Title": "Never Say Never Again", "Year": "1983", "Genre": "Action, Adventure, Thriller", "Rating": "6.2", "Plot": "SPECTRE agents under the command of Ernst Blofeld infiltrate a US air force base situated in the UK and steal two Tomahawk cruise missiles. When NATO is held to ransom, the British reactive their &quot;00&quot; agents and send James Bond to recapture the warheads and kill Blofeld."},
{"Title": "Moonraker", "Year": "1979", "Genre": "Action, Adventure, Sci-Fi", "Rating": "6.3", "Plot": "James Bond is back for another mission and this time, he is blasting off into space. A spaceship traveling through space is mysteriously hi-jacked and Bond must work quickly to find out who was behind it all. He starts with the rockets creators, Drax Industries and the man behind the organisation, Hugo Drax. On his journey he ends up meeting Dr. Holly Goodhead and encounters the metal-toothed Jaws once again."},
{"Title": "Streets of Fire", "Year": "1984", "Genre": "Action, Crime, Drama", "Rating": "6.8", "Plot": "Rock and Roll singer is taken captive by a motorcycle gang in a strange world that seems to be a cross of the 1950's and the present or future. Her ex-boyfriend returns to town and to find her missing and goes to her rescue."},
{"Title": "Live and Let Die", "Year": "1973", "Genre": "Action, Adventure, Thriller", "Rating": "6.8", "Plot": "Several British agents have been murdered and James Bond is sent to New Orleans, to investigate these mysterious deaths. Mr. Big comes to his knowledge, who is self-producing heroin. Along his journeys he meets Tee Hee who has a claw for a hand, Baron Samedi the voodoo master and Solitaire a tarot card reader. Bond must travel to New Orleans, and deep into the Bayou."},
{"Title": "Strangers on a Train", "Year": "1951", "Genre": "Crime, Film-Noir, Thriller", "Rating": "8.0", "Plot": "Bruno Anthony thinks he has the perfect plot to rid himself of his hated father and when he meets tennis player Guy Haines on a train, he thinks he's found the partner he needs to pull it off. His plan is relatively simple. Two strangers each agree to kill someone the other person wants disposed of. For example, Guy could kill his father and he could get rid of Guy's wife Miriam, freeing him to marry Anne Morton, the beautiful daughter of a U.S. Senator. Guy dismisses it all out of hand but Bruno goes ahead with his half of the 'bargain' and disposes of Miriam. When Guy balks, Bruno makes it quite clear that he will plant evidence to implicate Guy in her murder if he doesn't get rid of his father. Guy had also made some unfortunate statements about Miriam after she had refused him a divorce. It all leads the police to believe Guy is responsible for the murder, forcing him to deal with Bruno's mad ravings."},
{"Title": "Children Shouldn't Play with Dead Things", "Year": "1972", "Genre": "Comedy, Horror", "Rating": "5.5", "Plot": "Actors led by Alan Ormsby go to a graveyard on a remote island to perform a necromantic ritual. The ritual works and soon the dead are walking about and chowing down on human flesh."},
{"Title": "For Your Eyes Only", "Year": "1981", "Genre": "Action, Adventure, Thriller", "Rating": "6.8", "Plot": "After disposing of a familiar looking face, Bond is sent to recover a communication device, known as an ATAC, which went down with a British Spy ship as it sunk. Bond must hurry though, as the Russians are also out for this device. On his travels, he also meets Melina Havelock, whose parents were brutally murdered. Bond also encounters both Aristotle Kristatos and Milos Colombo. Each of them are accusing the other of having links with with the Russian's. Bond must team up with Melina, solve who the true ally is and find the ATAC before it's too late."},
{"Title": "Picnic at Hanging Rock", "Year": "1975", "Genre": "Drama, Mystery", "Rating": "7.6", "Plot": "Three students and a school teacher disappear on an excursion to Hanging Rock, in Victoria, on Valentine's Day, 1900. Widely (and incorrectly) regarded as being based on a true story, the movie follows those that disappeared, and those that stayed behind, but it delights in the asking of questions, not the answering of them."},
{"Title": "Star Trek VI: The Undiscovered Country", "Year": "1991", "Genre": "Action, Adventure, Sci-Fi", "Rating": "7.2", "Plot": "After an explosion on their moon, the Klingons have an estimated 50 years before their ozone layer is completely depleted, and they all die. They have only one choice - to make peace with the Federation, which will mean an end to 70 years of conflict. Captain James T. Kirk and crew are called upon to help in the negotiations because of their experience with the Klingons. Peace talks don't quite proceed, and Kirk and McCoy are convicted of assassinating the Klingon High Chancellor, and imprisoned on Rura Penthe, a snowy hard-labor prison camp. Will they manage to escape? And will there ever be peace with the Klingons?"},
{"Title": "Master of None", "Year": "2015–", "Genre": "Comedy", "Rating": "8.3", "Plot": "Dev is a 30 year-old actor, living in New York City. His life goes by in a humorous, yet meaningful sequence of events. Everything he does is usually related to hanging out with his three friends, finding a relationship, or getting ahead in his career."}
]