[
{"Title": "The Good, the Bad and the Ugly", "Year": "1966", "Genre": "Western", "Rating": "8.9", "Plot": "Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know the location of the gold. All he needs is for the two to lead him to it. Now The Good, The Bad and The Ugly must all battle it out to get their hands on $200,000 worth of gold."},
{"Title": "The Outlaw Josey Wales", "Year": "1976", "Genre": "Western", "Rating": "7.9", "Plot": "Josey Wales makes his way west after the Civil War, determined to live a useful and helpful life. He joins up with a group of settlers who need the protection that a man as tough and experienced as he is can provide. Unfortunately, the past has a way of catching up with you, and Josey is a wanted man."},
{"Title": "The Magnificent Seven", "Year": "2016", "Genre": "Action, Adventure, Western", "Rating": "6.9", "Plot": "Director Antoine Fuqua brings his modern vision to a classic story in The Magnificent Seven. With the town of Rose Creek under the deadly control of industrialist Bartholomew Bogue, the desperate townspeople employ protection from seven outlaws, bounty hunters, gamblers and hired guns. As they prepare the town for the violent showdown that they know is coming, these seven mercenaries find themselves fighting for more than money."},
{"Title": "Unforgiven", "Year": "1992", "Genre": "Drama, Western", "Rating": "8.2", "Plot": "The town of Big Whisky is full of normal people trying to lead quiet lives. Cowboys try to make a living. Sheriff 'Little Bill' tries to build a house and keep a heavy-handed order. The town whores just try to get by.Then a couple of cowboys cut up a whore. Dissatisfied with Bill's justice, the prostitutes put a bounty on the cowboys. The bounty attracts a young gun billing himself as 'The Schofield Kid', and aging killer William Munny. Munny reformed for his young wife, and has been raising crops and two children in peace. But his wife is gone. Farm life is hard. And Munny is no good at it. So he calls his old partner Ned, saddles his ornery nag, and rides off to kill one more time, blurring the lines between heroism and villainy, man and myth."},
{"Title": "Butch Cassidy and the Sundance Kid", "Year": "1969", "Genre": "Biography, Crime, Drama", "Rating": "8.1", "Plot": "Butch and Sundance are the two leaders of the Hole-in-the-Wall Gang. Butch is all ideas, Sundance is all action and skill. The west is becoming civilized and when Butch and Sundance rob a train once too often, a special posse begins trailing them no matter where they run. Over rock, through towns, across rivers, the group is always just behind them. When they finally escape through sheer luck, Butch has another idea, &quot;Let's go to Bolivia&quot;. Based on the exploits of the historical characters."},
{"Title": "For a Few Dollars More", "Year": "1965", "Genre": "Western", "Rating": "8.3", "Plot": "Monco is a bounty killer chasing El Indio and his gang. During his hunting, he meets Col. Douglas Mortimer, another bounty killer, and they decide to make a partnership, chase the bad guys together and split the reward. During their enterprise, there will be lots of bullets and funny situations. In the end, one of the bounty hunters shows the real intention of his hunting."},
{"Title": "The Searchers", "Year": "1956", "Genre": "Adventure, Drama, Western", "Rating": "8.0", "Plot": "Ethan Edwards, returned from the Civil War to the Texas ranch of his brother, hopes to find a home with his family and to be near the woman he obviously but secretly loves. But a Comanche raid destroys these plans, and Ethan sets out, along with his 1/8 Indian nephew Martin, on a years-long journey to find the niece kidnapped by the Indians under Chief Scar. But as the quest goes on, Martin begins to realize that his uncle's hatred for the Indians is beginning to spill over onto his now-assimilated niece. Martin becomes uncertain whether Ethan plans to rescue Debbie...or kill her."},
{"Title": "Tombstone", "Year": "1993", "Genre": "Action, Biography, Drama", "Rating": "7.8", "Plot": "After success cleaning up Dodge City, Wyatt Earp moves to Tombstone, Arizona, and wishes to get rich in obscurity. He meets his brothers there, as well as his old friend Doc Holliday. A band of outlaws that call themselves The Cowboys are causing problems in the region with various acts of random violence, and inevitably come into confrontation with Holliday and the Earps, which leads to a shoot-out at the OK Corral."},
{"Title": "True Grit", "Year": "2010", "Genre": "Adventure, Drama, Western", "Rating": "7.6", "Plot": "Following the murder of her father by hired hand Tom Chaney, 14-year-old farm girl Mattie Ross sets out to capture the killer. To aid her, she hires the toughest U.S. marshal she can find, a man with &quot;true grit,&quot; Reuben J. &quot;Rooster&quot; Cogburn. Mattie insists on accompanying Cogburn, whose drinking, sloth, and generally reprobate character do not augment her faith in him. Against his wishes, she joins him in his trek into the Indian Nations in search of Chaney. They are joined by Texas Ranger LaBoeuf, who wants Chaney for his own purposes. The unlikely trio find danger and surprises on the journey, and each has his or her &quot;grit&quot; tested."},
{"Title": "Rio Bravo", "Year": "1959", "Genre": "Action, Drama, Western", "Rating": "8.0", "Plot": "Sheriff John T. Chance has his hands full after arresting Joe Burdette for murder. He knows that Burdette's brother Nathan, a powerful rancher, will go to any lengths to get him out of jail. Chance's good friend Pat Wheeler offers to help but within 20 minutes of making the offer is gunned down in the street, shot in the back. That leaves his elderly deputy Stumpy, the town drunk Dude - once a deputy and a pretty good shot when he was sober - and a young hand, Colorado, who used to work for Wheeler. Nathan Burdette meanwhile has a couple of dozen men at his disposal. Chance does his best to prepare all the while romancing a pretty gamblers who goes by the name of Feathers."},
{"Title": "The Man Who Shot Liberty Valance", "Year": "1962", "Genre": "Drama, Western", "Rating": "8.1", "Plot": "When Senator Ransom Stoddard returns home to Shinbone for the funeral of Tom Doniphon, he recounts to a local newspaper editor the story behind it all. He had come to town many years before, a lawyer by profession. The stage was robbed on its way in by the local ruffian, Liberty Valance, and Stoddard has nothing to his name left save a few law books. He gets a job in the kitchen at the Ericson's restaurant and there meets his future wife, Hallie. The territory is vying for Statehood and Stoddard is selected as a representative over Valance, who continues terrorizing the town. When he destroys the local newspaper office and attacks the editor, Stoddard calls him out, though the conclusion is not quite as straightforward as legend would have it."},
{"Title": "Once Upon a Time in the West", "Year": "1968", "Genre": "Western", "Rating": "8.5", "Plot": "Story of a young woman, Mrs. McBain, who moves from New Orleans to frontier Utah, on the very edge of the American West. She arrives to find her new husband and family slaughtered, but by whom? The prime suspect, coffee-lover Cheyenne, befriends her and offers to go after the real killer, assassin gang leader Frank, in her honor. He is accompanied by Harmonica, a man already on a quest to get even."},
{"Title": "High Noon", "Year": "1952", "Genre": "Action, Drama, Thriller", "Rating": "8.0", "Plot": "On the day he gets married and hangs up his badge, lawman Will Kane is told that a man he sent to prison years before, Frank Miller, is returning on the noon train to exact his revenge. Having initially decided to leave with his new spouse, Will decides he must go back and face Miller. However, when he seeks the help of the townspeople he has protected for so long, they turn their backs on him. It seems Kane may have to face Miller alone, as well as the rest of Miller's gang, who are waiting for him at the station..."},
{"Title": "Shane", "Year": "1953", "Genre": "Drama, Western", "Rating": "7.7", "Plot": "Shane rides into a conflict between cattleman Ryker and a bunch of settlers, like Joe Starrett and his family, whose land Ryker wants. When Shane beats up Ryker's man Chris, Ryker tries to buy him. Then Shane and Joe take on the whole Ryker crew. Ryker sends to Cheyenne for truly evil gunslinger Wilson. Shane must clear out all the guns from the valley."},
{"Title": "Dances with Wolves", "Year": "1990", "Genre": "Adventure, Drama, Western", "Rating": "8.0", "Plot": "Lt. John Dunbar is dubbed a hero after he accidentally leads Union troops to a victory during the Civil War. He requests a position on the western frontier, but finds it deserted. He soon finds out he is not alone, but meets a wolf he dubs &quot;Two-socks&quot; and a curious Indian tribe. Dunbar quickly makes friends with the tribe, and discovers a white woman who was raised by the Indians. He gradually earns the respect of these native people, and sheds his white-man's ways."},
{"Title": "Pale Rider", "Year": "1985", "Genre": "Western", "Rating": "7.3", "Plot": "A gold mining camp in the California foothills is besieged by a neighboring landowner intent on stealing their claims. A preacher rides into camp and uses all of his powers of persuasion to convince the landowner to give up his attacks on the miners."},
{"Title": "The Wild Bunch", "Year": "1969", "Genre": "Action, Adventure, Western", "Rating": "8.0", "Plot": "It's 1913, and the traditional American West is dying. Among the inhabitants of this dying time era are a outlaw gang called &quot;The Wild Bunch&quot;. After a failed bank robbery, the gang head to Mexico to do one last job. Seeing their times and lives drifting away in the newly formed world of the 20th century, the gang take the job and end up in a brutally, violent last stand against their enemies who deemed to be corrupt in a small Mexican town, ruled by a ruthless general."},
{"Title": "High Plains Drifter", "Year": "1973", "Genre": "Mystery, Western", "Rating": "7.6", "Plot": "A Stranger rides into in the dusty mining town of Lago, where the townspeople are living in the shadow of a dark secret. After a shootout leaves the town's hired-gun protectors dead, the town's leaders petition the Stranger to stay and protect them from three ruthless outlaws who are soon to be released from prison. The three have their sights set on returning to Lago to wreak havoc and take care of some unfinished business. A series of events soon has the townspeople questioning whether siding with the Stranger was a wise idea as they quickly learn the price that they each must pay for his services. As the outlaws make their way back into Lago, they discover that the town is not exactly as they had left it, and waiting in the shadows is the Stranger, ready to expose the town's secret and serve up his own brand of justice."},
{"Title": "Stagecoach", "Year": "1939", "Genre": "Adventure, Western", "Rating": "7.9", "Plot": "A simple stagecoach trip is complicated by the fact that Geronimo is on the warpath in the area. The passengers on the coach include a drunken doctor, two women, a bank manager who has taken off with his client's money, and the famous Ringo Kid, among others."},
{"Title": "The Shootist", "Year": "1976", "Genre": "Drama, Romance, Western", "Rating": "7.7", "Plot": "John Books an aging gunfighter goes to see a doctor he knows for a second opinion after another doctor told him he has a cancer which is terminal. The doctor confirms what the other said. He says Books has a month maybe two left. He takes a room in the boarding house and the son of the woman who runs it recognizes him and tells his mother who he is. She doesn't like his kind but when he tells her of his condition, she empathizes. Her son wants him to teach him how to use a gun. Books tries to tell him that killing is not something he wants to live with. Books, not wanting to go through the agony of dying from cancer, tries to find a quicker way to go."},
{"Title": "True Grit", "Year": "2010", "Genre": "Adventure, Drama, Western", "Rating": "7.6", "Plot": "Following the murder of her father by hired hand Tom Chaney, 14-year-old farm girl Mattie Ross sets out to capture the killer. To aid her, she hires the toughest U.S. marshal she can find, a man with &quot;true grit,&quot; Reuben J. &quot;Rooster&quot; Cogburn. Mattie insists on accompanying Cogburn, whose drinking, sloth, and generally reprobate character do not augment her faith in him. Against his wishes, she joins him in his trek into the Indian Nations in search of Chaney. They are joined by Texas Ranger LaBoeuf, who wants Chaney for his own purposes. The unlikely trio find danger and surprises on the journey, and each has his or her &quot;grit&quot; tested."},
{"Title": "Red River", "Year": "1948", "Genre": "Action, Adventure, Romance", "Rating": "7.8", "Plot": "Fourteen years after starting his cattle ranch in Texas, Tom Dunston is finally ready to drive his 10,000 head of cattle to market. Back then Dunston, his sidekick Nadine Groot and a teen-aged boy, Matt Garth -who was the only survivor of an Indian attack on a wagon train - started off with only two head of cattle. The nearest market however is in Missouri, a 1000 miles away. Dunston is a hard task master demanding a great deal from the men who have signed up for the drive. Matt is a grown man now and fought in the Civil War. He has his own mind as well and he soon runs up against the stubborn Dunston who won't listen to advice from anyone. Soon, the men on the drive are taking sides and Matt ends up in charge with Dunston vowing to kill him."},
{"Title": "Jeremiah Johnson", "Year": "1972", "Genre": "Adventure, Drama, Western", "Rating": "7.6", "Plot": "During the mid-nineteenth century, Jeremiah Johnson, after a stint in the US Army, decides that he would prefer a life of solitude and more importantly peace by living with nature in the mountains of the frontier of the American west. This plan entails finding a piece of land upon which to build a house. This quest ends up being not quite what he envisioned as he does require the assistance of others to find his footing, and in turn he amasses friends and acquaintances along the way, some who become more a part of his life than he would have imagined. Perhaps most importantly, some of those people provide him with the knowledge of how to co-exist with some of the many Indian tribes, most importantly the Crow, on whose land in Colorado Jeremiah ultimately decides to build his home. But an act by Jeremiah upon a request by the US Cavalry leads to a chain of events that may forever change the peaceful relationship he worked so hard to achieve with his neighbors and their land."},
{"Title": "The Sons of Katie Elder", "Year": "1965", "Genre": "Western", "Rating": "7.2", "Plot": "The Elder boys return to Clearwater, Texas for their Mother's funeral. John the eldest is a well known gunfighter and trouble follows him wherever he goes. The boys try to get back their ranch from the towns gunsmith who won it from their father in a card game with which he was shortly murdered there after but not before getting through the troubles that come with the Elders name."},
{"Title": "Hang 'Em High", "Year": "1968", "Genre": "Western", "Rating": "7.0", "Plot": "A band of vigilantes catch Jed Cooper and, incorrectly believing him guilty of cattle rustling and murder, hang him and leave him for dead. But he doesn't die. He returns to his former profession of lawman to hunt down his lynchers and bring them to justice."},
{"Title": "Silverado", "Year": "1985", "Genre": "Action, Crime, Drama", "Rating": "7.2", "Plot": "In 1880, four men travel together to the city of Silverado. They come across many dangers before they finally engage the &quot;bad guys&quot; and bring peace and equality back to the city."},
{"Title": "Open Range", "Year": "2003", "Genre": "Action, Drama, Romance", "Rating": "7.5", "Plot": "Boss Spearman, Charley Waite, Mose Harrison and Button freegraze their cattle across the vast prairies of the West, sharing a friendship forged by a steadfast code of honor and living a life unencumbered by civilization. When their wayward herd forces them near the small town of Harmonville, the cowboys encounter a corrupt sheriff and kingpin rancher who govern the territory through fear, tyranny and violence. Boss and Charley find themselves inextricably drawn towards an inevitable showdown, as they are forced to defend the freedom and values of a lifestyle that is all too quickly vanishing. Amidst the turmoil, life suddenly takes an unexpected turn for the loner Charley when he meets the beautiful and warm spirited Sue Barlow, a woman who embraces both his heart and his soul."},
{"Title": "Big Jake", "Year": "1971", "Genre": "Western", "Rating": "7.2", "Plot": "The McCandles ranch is run over by a gang of cutthroats led by the evil John Fain. They kidnap little Jacob McCandles and hold him for a million dollar ransom. There is only one man who is brave enough and smart enough to bring him back and that man is Big Jake."},
{"Title": "How the West Was Won", "Year": "1962", "Genre": "Western", "Rating": "7.1", "Plot": "Setting off on a journey to the west in the 1830s, the Prescott family run into a man named Linus, who helps them fight off a pack of thieves. Linus then marries daughter Eve Prescott (Carroll Baker), and 30 years later goes off to fight in the Civil War with their son, with bloody results. Eve's sister, Lily, heads farther west and has adventures with a professional gambler, stretching all the way to San Francisco and into the 1880s."},
{"Title": "3:10 to Yuma", "Year": "2007", "Genre": "Action, Adventure, Crime", "Rating": "7.7", "Plot": "Rancher Dan Evans heads into Bisbee to clear up issues concerning the sale of his land when he witnesses the closing events of a stagecoach robbery led by famed outlaw Ben Wade. Shortly thereafter, Wade is captured by the law in Bisbee and Evans finds himself one of the escorts who will take Wade to the 3:10 to Yuma train in Contention for the reward of $200. Evans's effort to take Wade to the station is in part an effort to save his land but also part of an inner battle to determine whether he can be more than just a naive rancher in the eyes of his impetuous and gunslinging son William Evans. The transport to Contention is hazardous and filled with ambushes by Indians, pursuits by Wade's vengeful gang and Wade's own conniving and surreptitious demeanor that makes the ride all the more intense."},
{"Title": "Young Guns", "Year": "1988", "Genre": "Action, Crime, Drama", "Rating": "6.9", "Plot": "1878 in New Mexico: John Tunstall picks up young gun men from the road to have them work on his ranch, but also to teach them reading and to civilize them. However he's a thorn in the side of the rich rancher Murphy, as he's a competitor in selling cattle. One day he's shot by Murphy's men. Judge Wilson can't do anything, since Sheriff Brady is one of Murphy's men. But attorney Alex persuades him to constitute Tunstall's young friends to Deputies and give them warrants of arrest for the murderers. Instead of arresting them, William Bonney just shoots them down. Soon the 5 guys become famous and William gets the name &quot;Billie the Kid&quot; - but they're also chased by dozens of Murphy's men and the army. The people however honor him as fighter for justice."},
{"Title": "Blazing Saddles", "Year": "1974", "Genre": "Comedy, Western", "Rating": "7.8", "Plot": "The Ultimate Western Spoof. A town where everyone seems to be named Johnson is in the way of the railroad. In order to grab their land, Hedley Lemar (Harvey Korman), a politically connected nasty person, sends in his henchmen to make the town unlivable. After the sheriff is killed, the town demands a new sheriff from the Governor (Mel Brooks). Hedley convinces him to send the town the first Black sheriff (Cleavon Little) in the west. Bart is a sophisticated urbanite who will have some difficulty winning over the townspeople."},
{"Title": "El Dorado", "Year": "1967", "Genre": "Drama, Romance, Western", "Rating": "7.6", "Plot": "Hired gunman Cole Thornton turns down a job with Bart Jason as it would mean having to fight an old sheriff friend. Some months later he finds out the lawman is on the bottle and a top gunfighter is heading his way to help Jason. Along with young Mississippi, handy with a knife and now armed with a diabolical shotgun, Cole returns to help."},
{"Title": "McLintock!", "Year": "1963", "Genre": "Comedy, Romance, Western", "Rating": "7.3", "Plot": "George Washington McLintock, &quot;GW&quot; to friends and foes alike, is a cattle baron and the richest man in the territory. He anxiously awaits the return of his daughter Becky who has been away at school for the last two years. He's also surprised to see that his wife Katherine has also returned. She had left him some years before without really explaining what he done but she does make the point of saying that she's returned to take their daughter back to the State Capitol with her. GW is highly respected by everyone around him including the farmers who are pouring into the territories with free grants of land and the Indians who are under threat of being relocated to another reservation. Between his wife, his headstrong daughter, the crooked land agent and the thieving government Indian agent, GW tries to keep the peace and do what is best for everyone."},
{"Title": "Winchester '73", "Year": "1950", "Genre": "Action, Drama, Western", "Rating": "7.7", "Plot": "In a marksmanship contest, Lin McAdam wins a prized Winchester rifle, which is immediately stolen by the runner-up, Dutch Henry Brown. This &quot;story of a rifle&quot; then follows McAdams' pursuit, and the rifle as it changes hands, until a final showdown and shoot-out on a rocky mountain precipice."},
{"Title": "Hondo", "Year": "1953", "Genre": "Drama, Romance, War", "Rating": "7.1", "Plot": "This is typical Wayne, but that's what makes Hondo a movie well worth watching. Good writing and fine acting, again proving how so under rated Wayne was his entire career. Take the time and watch Hondo, it most definitely will be time we'll spent. As for prejudicial moments, remember, this was 1953 and that's just as it was. Wayne is Wayne, and the Apaches were the white man's idea of Apaches. God bless good ole Sam!"},
{"Title": "Rio Grande", "Year": "1950", "Genre": "Romance, Western", "Rating": "7.2", "Plot": "Rio Grande takes place after the Civil War when the Union turned their attention towards the Apaches. Union officer Kirby Yorke is in charge of an outpost on the Rio Grande in which he is in charge of training of new recruits one of which is his son whom he hasn't seen in 15 years. He whips him into shape to take on the Apaches but not before his mother shows up to take him out of there.The decision to leave is left up to Trooper Yorke who decides to stay and fight. Through it all Kirby and Kathleen though separated for years fall back into love and decide that it's time to give it another try. But Yorke faces his toughest battle when his unorthodox plan to outwit the elusive Apaches leads to possible court- martial. Locked in a bloody Indian war, he must fight to redeem his honor and save the love and lives of his broken family"},
{"Title": "She Wore a Yellow Ribbon", "Year": "1949", "Genre": "Western", "Rating": "7.4", "Plot": "After Custer and the 7th Cavalry are wiped out by Indians, everyone expects the worst. Capt. Nathan Brittles is ordered out on patrol but he's also required to take along Abby Allshard, wife of the Fort's commanding officer, and her niece, the pretty Olivia Dandridge, who are being evacuated for their own safety. Brittles is only a few days away from retirement and Olivia has caught the eye of two of the young officers in the Company, Lt. Flint Cohill and 2nd Lt. Ross Pennell. She's taken to wearing a yellow ribbon in her hair, a sign that she has a beau in the Cavalry, but refuses to say for whom she is wearing it."},
{"Title": "Fort Apache", "Year": "1948", "Genre": "Action, Adventure, Western", "Rating": "7.6", "Plot": "In John Ford's sombre exploration mythologising of American heroes, he slowly reveals the character of Owen Thursday, who sees his new posting to the desolate Fort Apache as a chance to claim the military honour which he believes is rightfully his. Arrogant, obsessed with military form and ultimately self-destructive, Thursday attempts to destroy the Apache chief Cochise after luring him across the border from Mexico, against the advice of his subordinates."},
{"Title": "Quigley Down Under", "Year": "1990", "Genre": "Action, Adventure, Drama", "Rating": "6.9", "Plot": "Sharpshooter Matt Quigley is hired from America by an Australian rancher so he can shoot aborigines at a distance. Quigley takes exception to this and leaves. The rancher tries to kill him for refusing, and Quigley escapes into the brush with a woman he rescued from some of the rancher's men, and are helped by aborigines. Quigley returns the help, before going on to destroy all his enemies."},
{"Title": "Gunfight at the O.K. Corral", "Year": "1957", "Genre": "Biography, Drama, Western", "Rating": "7.2", "Plot": "After a long career as a lawman that made him a legend, Wyatt Earp decides to quit and join his brothers in Tombstone, Arizona. There he would see them in a feud with the Clantons, a local clan of thugs and cattle thieves. When the showdown becomes inevitable, the help will come from Doc Holliday, a terminally-ill gambler who happens to be another Wild West legend."},
{"Title": "The Alamo", "Year": "2004", "Genre": "Drama, History, War", "Rating": "6.0", "Plot": "Historical drama detailing the 1835-36 Texas revolution before, during, and after the famous siege of the Alamo (February 23-March 6, 1836) where 183 Texans (American-born Texans) and Tejanos (Mexican-born Texans) commanded by Colonel Travis, along with Davey Crockett and Jim Bowie, were besieged in an abandoned mission outside San Antonio by a Mexican army of nearly 2,000 men under the personal command of the dictator of Mexico, General Santa Anna, as well as detailing the Battle of San Jacinto (April 21, 1836) where General Sam Houston's rag-tag army of Texans took on and defeated Santa Anna's army which led to the indepedence of Texas."},
{"Title": "The Cowboys", "Year": "1972", "Genre": "Adventure, Drama, Western", "Rating": "7.4", "Plot": "When his cattle drivers abandon him for the gold fields, rancher Wil Andersen is forced to take on a collection of young boys as his drivers in order to get his herd to market in time to avoid financial disaster. The boys learn to do a man's job under Andersen's tutelage; however, neither Andersen nor the boys know that a gang of cattle thieves is stalking them."},
{"Title": "Two Mules for Sister Sara", "Year": "1970", "Genre": "Adventure, Romance, War", "Rating": "7.0", "Plot": "Set in Mexico, a nun called Sara is rescued from three cowboys by Hogan, who is on his way to do some reconnaissance, for a future mission to capture a French fort. The French are chasing Sara, but not for the reasons she tells Hogan, so he decides to help her in return for information about the fort defences. Inevitably the two become good friends but Sara has a secret.."},
{"Title": "Rooster Cogburn", "Year": "1975", "Genre": "Adventure, Drama, Western", "Rating": "6.9", "Plot": "A small village in the Indian Nation that is run by a Minister Goodnight and his daughter Eula is overrun by a band of drunken thugs. They kill and rape the people of the village. Miss Goodnight then teams up with the ruthless Marshal Rooster J. Cogburn who goes after them and bring them to justice."},
{"Title": "The Last of the Mohicans", "Year": "1992", "Genre": "Action, Adventure, Drama", "Rating": "7.8", "Plot": "The last members of a dying Native American tribe, the Mohicans -- Uncas, his father Chingachgook, and his adopted half-white brother Hawkeye -- live in peace alongside British colonists. But when the daughters of a British colonel are kidnapped by a traitorous scout, Hawkeye and Uncas must rescue them in the crossfire of a gruesome military conflict of which they wanted no part: the French and Indian War."},
{"Title": "Chisum", "Year": "1970", "Genre": "Biography, Western", "Rating": "6.9", "Plot": "As one of the founders of the town of Lincoln, John Chisum is increasingly worried as Lawrence Murphy moves in on the local stores, bank and land by questionable means. Chisum and fellow honest ranch owner Henry Tunstall try and use the law, but Murphy owns that too. Confrontation threatens and Tunstall's man Billy Bonney is not slow to get involved."},
{"Title": "Rio Lobo", "Year": "1970", "Genre": "Adventure, Romance, War", "Rating": "6.8", "Plot": "Col. Cord McNally an ex union officer teams up with a couple of ex Johnny Rebs to search for the traitor who sold information to the South during the Civil War. Their quest brings them to the town of Rio Lobo where they help recover this little Texas town from ruthless outlaws who are led by the traitor they were looking for."}
]